{
  "event_id": 1,
  "event_label": "start",
  "dialogue": [
    {
      "character": "narrator",
      "text": "There are several things in life I have accepted that I will never understand."
    },
    {
      "character": "narrator",
      "text": "The first of which has been explained to me many times- "
    },
    {
      "character": "narrator",
      "text": "It’s the way floating dust particles manage to shimmer and glow when hit at the correct angle by light. "
    },
    {
      "character": "narrator",
      "text": "How something invisible to the naked eye can be {i}made{/i} visible by pure electromagnetic radiation...or something like that."
    },
    {
      "character": "narrator",
      "text": "I’ve retained the information. I’d be foolish not to after how many times I have heard it."
    },
    {
      "character": "narrator",
      "text": "But I will never understand."
    },
    {
      "character": "narrator",
      "text": "The second thing is the romanticization of death. "
    },
    {
      "character": "narrator",
      "text": "And how there are people who speak of it with such fervor that it often appears to bring them more joy and curiosity than the unwrapping of presents on Christmas morning."
    },
    {
      "character": "narrator",
      "text": "The third thing is you."
    },
    {
      "character": "narrator",
      "text": "You’re a curious one...do you know that?"
    },
    {
      "character": "narrator",
      "text": "Trapped in the dark, suspended somewhere between life and death...with eyes swollen shut so dramatically that you can’t even see the dust I’ve taken the liberty of illuminating for you."
    },
    {
      "character": "narrator",
      "text": "I want you to be just as confused as me, you know?"
    },
    {
      "character": "narrator",
      "text": "It’s lonely here."
    },
    {
      "character": "narrator",
      "text": "It’s lonely having no one to talk to...no one to submerge myself in uncertainties with."
    },
    {
      "character": "narrator",
      "text": "It’s just me, the dust, and the incessant circling of the drain that is the idea that I will, one day, no longer be able to share little thoughts like these with anyone."
    },
    {
      "character": "narrator",
      "text": "Do you like poetry?"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Yes?"
    },
    {
      "character": "narrator",
      "text": "No?"
    },
    {
      "character": "narrator",
      "text": "I’m sorry. I’m sure it’s difficult to answer a question like that in your current state."
    },
    {
      "character": "narrator",
      "text": "Personally, I’ve never been a big fan of it. "
    },
    {
      "character": "narrator",
      "text": "It requires too much...interpretation. To the point where sometimes, even the clearest of thoughts have a variety of different meanings that all go on to contradict one another."
    },
    {
      "character": "narrator",
      "text": "But-"
    },
    {
      "character": "narrator",
      "text": "There is one line from a very famous poet paraphrasing a very famous politician that goes something like..."
    },
    {
      "character": "narrator",
      "text": "{i}There is no beauty without some strangeness in its proportions.{/i}"
    },
    {
      "character": "narrator",
      "text": "And I like that line very much."
    },
    {
      "character": "narrator",
      "text": "In fact, I’m sure that if you don’t already enjoy it yourself, that you’ll come to do so soon."
    },
    {
      "character": "narrator",
      "text": "Because where you’re going is somewhere special."
    },
    {
      "character": "narrator",
      "text": "Somewhere with so much strangeness in every single one of its proportions that you’ll be forced to understand how truly beautiful life can be, even during its darkest moments."
    },
    {
      "character": "narrator",
      "text": "Would it be a bit preemptive for me to tell you that I love you?"
    },
    {
      "character": "narrator",
      "text": "Not romantically, of course. We barely even know each other."
    },
    {
      "character": "narrator",
      "text": "But I love that you’re here. "
    },
    {
      "character": "narrator",
      "text": "I love that we’re here together because, like I said, I have been very...{i}very{/i} lonely."
    },
    {
      "character": "narrator",
      "text": "I’m sure you’ll come to despise me in time."
    },
    {
      "character": "narrator",
      "text": "I’m sure these little conversations that I’ll force you to have with me will eat away at you like botflies. "
    },
    {
      "character": "narrator",
      "text": "And I’m even more sure that every one of the thoughts I share with you will get underneath your skin like the eggs those botflies lay."
    },
    {
      "character": "narrator",
      "text": "But it’s all for good reason, you see."
    },
    {
      "character": "narrator",
      "text": "It’s because that is my job."
    },
    {
      "character": "narrator",
      "text": "It’s because, for some reason even I don’t understand, I was chosen to be your personal, mysterious and anonymous narrator."
    },
    {
      "character": "narrator",
      "text": "Will we ever meet for real?"
    },
    {
      "character": "narrator",
      "text": "Who knows?"
    },
    {
      "character": "narrator",
      "text": "But I hope so."
    },
    {
      "character": "narrator",
      "text": "Now, then!"
    },
    {
      "character": "narrator",
      "text": "I suppose it’s time we get down to business."
    },
    {
      "character": "narrator",
      "text": "Ahh, how I have missed the daylight."
    },
    {
      "character": "narrator",
      "text": "There’s nothing quite like the feeling of sunlight soaking into your skin on a hot, summer day."
    },
    {
      "character": "narrator",
      "text": "But I’ve bothered you enough already, so I won’t get the two of us sidetracked with some tangent about the weather."
    },
    {
      "character": "narrator",
      "text": "Especially since it’ll be like this for...well, you’ll see soon enough."
    },
    {
      "character": "narrator",
      "text": "Oh! There is {i}one{/i} more thing I’m obligated to tell you before the game starts, though. "
    },
    {
      "character": "narrator",
      "text": "You can take it seriously or not, it doesn’t matter to me. This will be {i}your{/i} life after all- and what good is a life where you can’t even think for yourself?"
    },
    {
      "character": "narrator",
      "text": "Anyway, the thing I’m supposed to tell you is this..."
    },
    {
      "character": "narrator",
      "text": "Nothing is real."
    },
    {
      "character": "narrator",
      "text": "Not me...not you...not {i}anyone{/i} you’ll meet in the journey you start today."
    },
    {
      "character": "narrator",
      "text": "We’re all just air."
    },
    {
      "character": "narrator",
      "text": "So..."
    },
    {
      "character": "narrator",
      "text": "How about we breathe {i}together?{/i}"
    },
    {
      "character": "narrator",
      "text": "It’ll be fun! "
    },
    {
      "character": "narrator",
      "text": "Go on! Expel your worries from the depths of your lungs and envelop yourself in happier days!"
    },
    {
      "character": "narrator",
      "text": "For this world was made for you and you alone."
    },
    {
      "character": "narrator",
      "text": "I can’t tell you {i}who{/i} made it...and I sure as hell can’t tell you why {i}you{/i} were special enough to be given something like this."
    },
    {
      "character": "narrator",
      "text": "But I can tell you, and I truly do wish this from the bottom of my heart-"
    },
    {
      "character": "narrator",
      "text": "That I hope you have fun."
    },
    {
      "character": "narrator",
      "text": "And if you’re ever feeling lost or lonely, all you have to do is close your eyes and I’ll be right there-"
    },
    {
      "character": "narrator",
      "text": "Annoying you every step of the way."
    },
    {
      "character": "narrator",
      "text": "So!"
    },
    {
      "character": "narrator",
      "text": "Are you ready?"
    }
  ],
  "state_changes": {}
}