{
  "event_id": 5,
  "event_label": "firsttimemall",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I decide to spend my afternoon at the mall because-"
    },
    {
      "character": "narrator",
      "text": "Well, I don’t really know. "
    },
    {
      "character": "narrator",
      "text": "It’s probably safe to just chalk it up to some subconscious desire to hang around teenage girls, though, since that’s pretty much all there is to do with my life now."
    },
    {
      "character": "narrator",
      "text": "Not like there are many other things I’d prefer doing in the first place, but you get the point."
    },
    {
      "character": "narrator",
      "text": "Without an inkling of what to do as a middle-aged man in a shopping mall, I spend my time walking around in circles, hoping to bump into someone I know."
    },
    {
      "character": "narrator",
      "text": "Unfortunately, this process repeats itself a good five times before I’m able to find any amount of success."
    },
    {
      "character": "narrator",
      "text": "That success comes in the form of one of the girls from my class, alone on a bench I’ve passed several times over now."
    },
    {
      "character": "narrator",
      "text": "I doubt she’ll be happy to see me since the mall is like a...recreational sanctuary to girls her age, but that’s not something I’m going to dwell on when I’m getting desperate at this point."
    },
    {
      "character": "narrator",
      "text": "Worse comes to worst, I simply walk away and the two of us forget I ever tried to talk to her in the first place."
    },
    {
      "character": "???",
      "text": "Sensei? Is that you?"
    },
    {
      "character": "Sensei",
      "text": "Hey, Chika."
    },
    {
      "character": "Chika",
      "text": "Hey! It’s not often I see you outside of school. What brings you to the mall?"
    },
    {
      "character": "Sensei",
      "text": "A mix of despondence, boredom, and lack of direction. You?"
    },
    {
      "character": "Chika",
      "text": "I work here. Just sat down for my break, actually."
    },
    {
      "character": "Chika",
      "text": "You’re welcome to join me if you want, but I doubt you’d-"
    },
    {
      "character": "Sensei",
      "text": "Deal."
    },
    {
      "character": "Chika",
      "text": "Oh! Okay. Nevermind, then."
    },
    {
      "character": "Chika",
      "text": "I didn’t really think you’d want to spend your day off hanging out with somebody like, half your age."
    },
    {
      "character": "Sensei",
      "text": "And I didn’t think you’d want to spend your break with someone old enough to be your father, but here we are."
    },
    {
      "character": "Chika",
      "text": "Oh, come on. You’re not {i}that{/i} old..."
    },
    {
      "character": "Chika",
      "text": "Are you?"
    },
    {
      "character": "Sensei",
      "text": "I really wish I could tell you."
    },
    {
      "character": "Chika",
      "text": "Uhh...why can’t-"
    },
    {
      "character": "Sensei",
      "text": "Anyway, which one of these stores do you work at? Maybe I can drop by sometime and like, support local business or whatever."
    },
    {
      "character": "Chika",
      "text": "If by “support local business” you mean pump some money into a major corporation, feel free to drop by. It’s the really fancy looking place at the east end of the mall."
    },
    {
      "character": "Sensei",
      "text": "Does it have a weird, French name? Because I passed by a place like that earlier and couldn’t even bring myself to look inside again after catching a glimpse of the prices."
    },
    {
      "character": "Chika",
      "text": "Yup. That’s the one. I am but a humble slave to the retail machine that is {i}Les Vêtements{/i}."
    },
    {
      "character": "Chika",
      "text": "Gotta pay the bills somehow, though. You know?"
    },
    {
      "character": "Sensei",
      "text": "Sure, but I can’t imagine someone your age has very many bills to worry about."
    },
    {
      "character": "Chika",
      "text": "Hahah...yeah..."
    },
    {
      "character": "Chika",
      "text": "But, uhh...yeah. That’s where I work. So if you ever want to drop by just to say hi or something, feel free. I won’t pressure you into buying anything since I know how crazy expensive it all is."
    },
    {
      "character": "Sensei",
      "text": "I appreciate that. Here’s hoping the “retail machine” doesn’t eat you alive."
    },
    {
      "character": "Chika",
      "text": "Have you ever worked a job like that before, Sensei? "
    },
    {
      "character": "Sensei",
      "text": "Me? No. "
    },
    {
      "character": "narrator",
      "text": "Or at least I don’t think so?"
    },
    {
      "character": "narrator",
      "text": "For all I know (which isn’t much on account of the whole “rebirth” thing), I could have worked in the same exact store as Chika when I was her age."
    },
    {
      "character": "narrator",
      "text": "Without any experience to pull from, though, I’m probably better off just steering the topic toward something else."
    },
    {
      "character": "Sensei",
      "text": "So about those bills you supposedly have to pay-"
    },
    {
      "character": "Chika",
      "text": "What? No. Why? How are we back to that?"
    },
    {
      "character": "Sensei",
      "text": "I’m just curious, that’s all."
    },
    {
      "character": "narrator",
      "text": "I’m not, really. I just don’t want to risk talking about myself before understanding a little more about...who I am or where I’m from or...anything like that."
    },
    {
      "character": "narrator",
      "text": "And if making Chika slightly uncomfortable is the price to pay for saving face, I suppose she’ll just have to suffer."
    },
    {
      "character": "Chika",
      "text": "I’ve just got...other obligations, I guess. It’s not really something I want to get into right now."
    },
    {
      "character": "Sensei",
      "text": "Other obligations? You mean like, a boyfriend?"
    },
    {
      "character": "Chika",
      "text": "Boyfriend?! No way. Nuh-uh. It’s nothing even remotely {i}close{/i} to that. I have literally never even held hands before."
    },
    {
      "character": "Chika",
      "text": "My obligations are like, way more boring."
    },
    {
      "character": "Sensei",
      "text": "Well, I’m sorry to hear that."
    },
    {
      "character": "narrator",
      "text": "But I’m not sorry I was able to confirm that Chika is, at this moment in time, completely and entirely single."
    },
    {
      "character": "Sensei",
      "text": "I have a hard time believing you’re completely inexperienced, though. Like, based on how you look, I kind of just figured that-"
    },
    {
      "character": "Chika",
      "text": "What’s wrong with how I look?"
    },
    {
      "character": "Sensei",
      "text": "What? Nothing. I was just trying to say you look a lot more...{i}mature{/i} than the other girls in class."
    },
    {
      "character": "Chika",
      "text": "Oh! Well, that’s totally fine then."
    },
    {
      "character": "Chika",
      "text": "I thought you were gonna lean into that whole “gyarus are slutty” stereotype thing for a sec and I was about to get really upset."
    },
    {
      "character": "Sensei",
      "text": "That’s not where I was going. I just kind of figured that someone as attractive as you would be popular with the opposite sex."
    },
    {
      "character": "Chika",
      "text": "I don’t know. I guess I just never really- "
    },
    {
      "character": "Chika",
      "text": "Wait a second. What did you just call me?"
    },
    {
      "character": "Sensei",
      "text": "Should I not have said that?"
    },
    {
      "character": "Chika",
      "text": "No, you should say it again. I want to confirm that I’m not going crazy and that those words actually did just come out of your mouth."
    },
    {
      "character": "Sensei",
      "text": "I’m not being recorded, am I? Because this is starting to sound like a set-up."
    },
    {
      "character": "Chika",
      "text": "A set-up for what? If I didn’t want you around, do you really think I would have invited you to chill with me during my break?"
    },
    {
      "character": "Sensei",
      "text": "This is our first time spending time together outside of school. I have no idea what sorts of strategies you employ."
    },
    {
      "character": "Chika",
      "text": "Sensei, just friggin’ say it already. It’s totally cool."
    },
    {
      "character": "Sensei",
      "text": "Fine. I think you’re attractive. Are you happy now?"
    },
    {
      "character": "Chika",
      "text": "Duh! I’m obviously not gonna get upset by a compliment I basically forced out of you."
    },
    {
      "character": "Sensei",
      "text": "To be fair, the first time was voluntary. "
    },
    {
      "character": "Chika",
      "text": "Well...thanks, Sensei. "
    },
    {
      "character": "Chika",
      "text": "Even if we’re like, way out of each other’s dating ranges, I’m totally flattered. And, just for the record, I think you’re pretty handsome too."
    },
    {
      "character": "narrator",
      "text": "Well, {i}now{/i} we’re getting somewhere."
    },
    {
      "character": "Sensei",
      "text": "Oh?"
    },
    {
      "character": "Chika",
      "text": "{i}Oh{/i} what? Don’t believe me? You want it in writing or something?"
    },
    {
      "character": "Sensei",
      "text": "No, I think that would be just as risky as the whole recording thing."
    },
    {
      "character": "Chika",
      "text": "Do {i}you{/i} have someone back at home, Sensei? You asked me, so it’s only fair that I get to ask you as well."
    },
    {
      "character": "Sensei",
      "text": "Me? No. I already have ten teenagers I have to keep track of and that’s more than enough for me."
    },
    {
      "character": "Sensei",
      "text": "Also, I {i}quite literally{/i} have Ami back at home, but that’s a totally different sort of thing."
    },
    {
      "character": "narrator",
      "text": "A thing that I should...probably start putting some more thought into since that is absolutely a bridge I’ll have to cross one day."
    },
    {
      "character": "Chika",
      "text": "I would {i}really{/i} hope so! Because I’m pretty sure that would be like, way illegal."
    },
    {
      "character": "Sensei",
      "text": "This is not a thing we should be talking about at the mall."
    },
    {
      "character": "Chika",
      "text": "Probs not, but we’ve been crossing boundaries for a few minutes now, so it would probably be good to start backing things up a bit."
    },
    {
      "character": "Sensei",
      "text": "Agreed. The big takeaway from today’s conversation is that we’re equally attracted to one another and that I’m going to be coming to the mall more often from now on."
    },
    {
      "character": "Chika",
      "text": "For real? You actually are? "
    },
    {
      "character": "Sensei",
      "text": "Is there a problem with that?"
    },
    {
      "character": "Chika",
      "text": "Not at all. It’s just..."
    },
    {
      "character": "Chika",
      "text": "This is all kinda coming out of nowhere."
    },
    {
      "character": "Chika",
      "text": "Like, just a few days ago, I looked at you as a totally normal teacher. And now we’re, like...bantering and stuff, and..."
    },
    {
      "character": "Chika",
      "text": "I don’t know. Doesn’t this feel a little weird to you, Sensei? Like, why’d your whole outlook on teaching change all of a sudden?"
    },
    {
      "character": "Sensei",
      "text": "Just...woke up a brand new person, I guess."
    },
    {
      "character": "Chika",
      "text": "Well, for what it’s worth...I like this person a lot more so far. "
    },
    {
      "character": "Chika",
      "text": "He’s a lot of fun to talk to if this...spontaneous meeting on a bench says anything about the kind of guy he normally is outside of school."
    },
    {
      "character": "Chika",
      "text": "Unfortunately, that’s kind of all the time I have to hang out today since I’ve gotta be getting back to work."
    },
    {
      "character": "Chika",
      "text": "But I’ll be looking forward to seeing you more from now on, Sensei. Both in {i}and{/i} out of school."
    },
    {
      "character": "Sensei",
      "text": "I’ll be looking forward to that as well."
    },
    {
      "character": "Sensei",
      "text": "See you around, Chika."
    },
    {
      "character": "narrator",
      "text": "“The kind of guy I normally am outside of school...”"
    },
    {
      "character": "narrator",
      "text": "This can’t possibly be that, can it?"
    },
    {
      "character": "narrator",
      "text": "I was able to contain myself today, but...wasn’t it only because I was dead set on doing that?"
    },
    {
      "character": "narrator",
      "text": "Moving too quickly in the beginning tends to scare people away. It doesn’t take a genius to understand that."
    },
    {
      "character": "narrator",
      "text": "In order to get closer, sometimes you need to lure a person into a false sense of security."
    },
    {
      "character": "narrator",
      "text": "There’s no way that girl is truly {i}safe{/i} with me when I’ve already begun planting seeds in her garden."
    },
    {
      "character": "narrator",
      "text": "Soon, the flowers will begin to bloom and the two of us will flourish."
    },
    {
      "character": "narrator",
      "text": "But it will be all because I got a head start."
    },
    {
      "character": "narrator",
      "text": "And because she left her gate unlocked."
    },
    {
      "character": "narrator",
      "text": "I leave the mall and try to figure out what else to do with my day."
    },
    {
      "character": "narrator",
      "text": "{i}Chika’s affection has increased to [chika_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "chika_love +": {
      "from": null,
      "to": 1
    },
    "firsttimemall": {
      "from": null,
      "to": true
    }
  }
}