{
  "event_id": 9,
  "event_label": "firsttimeamisroom",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I step out into a living room that I’ve yet to fully familiarize myself with and think for a moment about who I am and why I am here."
    },
    {
      "character": "narrator",
      "text": "But then I remember that there is a cute girl sleeping in the room right next to mine and that any thought I could possibly have apart from that is essentially pointless."
    },
    {
      "character": "narrator",
      "text": "I still don’t know much about Kumon-mi...but what’s even more bizarre is that, somehow, I know even less about the girl who’s been guiding me through it thus far."
    },
    {
      "character": "narrator",
      "text": "Well, I guess {i}guiding{/i} might be a bit too generous of a word when all she’s really done is provide baseline hints and...vaguely generic information I would have likely figured out on my own."
    },
    {
      "character": "narrator",
      "text": "But I guess now is as good a time as any to try and change that."
    },
    {
      "character": "narrator",
      "text": "I knock on Ami’s door, hoping that she hasn’t gone out for the morning as that would leave me alone with nothing but my thoughts- and my thoughts have been rather...intense these last few nights."
    },
    {
      "character": "narrator",
      "text": "In a good way, of course. But it’s kind of hard to {i}not{/i} have thoughts like that when you wake up in what I’m pretty sure is the early stages of a harem."
    },
    {
      "character": "Ami",
      "text": "Come in, Sensei! The door is open."
    },
    {
      "character": "narrator",
      "text": "Good. It looks like my unofficial tour guide and slightly-official niece hasn’t gone out yet."
    },
    {
      "character": "narrator",
      "text": "Now, all I have to do is figure out how to talk to her without sounding like a complete creep. And how hard could that possibly be?"
    },
    {
      "character": "Sensei",
      "text": "Good morning, Ami. You smell nice."
    },
    {
      "character": "narrator",
      "text": "Fuck."
    },
    {
      "character": "Ami",
      "text": "Oh! Umm...thank you! "
    },
    {
      "character": "Ami",
      "text": "Are you sure it’s me and not my room, though? Because I was doing some cleaning a little earlier and sprayed way too much Cleaning Juice all over the place."
    },
    {
      "character": "Sensei",
      "text": "Please don’t call it cleaning juice. I don’t like that at all."
    },
    {
      "character": "Ami",
      "text": "Hm? That’s just the name of the brand. It’s some kind of deodorizer or something...Which isn’t me saying that my room normally smells bad. I just...want it to smell better?"
    },
    {
      "character": "Ami",
      "text": "Anyway, if you’re wondering why there’s still stuff all over the place, I’m just taking a little break before I get back to business. I promise it’ll all be gone soon."
    },
    {
      "character": "Sensei",
      "text": "Oh, I don’t really care. You can leave your room a mess indefinitely and it really won’t make much of a difference to me."
    },
    {
      "character": "Ami",
      "text": "Well, it will make a difference to me since keeping things clean is a good quality and I want you to love me even more than you already do. "
    },
    {
      "character": "narrator",
      "text": "Any amount of love at all would be more than what I currently have for this girl..."
    },
    {
      "character": "narrator",
      "text": "But I will keep that to myself for the time being as it’s still way too early for me to do something with the potential to ruin this prospective harem."
    },
    {
      "character": "Ami",
      "text": "But yeah...I should be done with my room by the afternoon. And I handled the living room and the bathroom yesterday, so that really just leaves the attic after this."
    },
    {
      "character": "Sensei",
      "text": "So is cleaning just...what you do as a hobby or something? "
    },
    {
      "character": "Ami",
      "text": "Wait a second...is your memory still all weird from when I woke you up from your nap the other day?"
    },
    {
      "character": "Sensei",
      "text": "...Yes. That is what is happening."
    },
    {
      "character": "Ami",
      "text": "Should we maybe take you to the doctor or something? Because if you’re still feeling weird all this time later, you might be, like...really really sick or something."
    },
    {
      "character": "Sensei",
      "text": "I’m sure I’ll be fine. I just need to get my bearings a little."
    },
    {
      "character": "Ami",
      "text": "Never worry, Sensei. Your beloved niece and favorite girl in the entire world, Ami Arakawa, can help you with that."
    },
    {
      "character": "Ami",
      "text": "To start off...no. Cleaning isn’t a {i}hobby{/i} of mine. It’s just something I do because I know you never will."
    },
    {
      "character": "narrator",
      "text": "Well, at least that’s one thing the original Sensei and I have in common."
    },
    {
      "character": "Ami",
      "text": "In fact, I handle basically all the chores around here so you can relax to your heart’s content. It’s the least I can do after all you’ve done for me."
    },
    {
      "character": "Sensei",
      "text": "I see. So...there’s nothing I need to do to like, repay you for all of your work around here? "
    },
    {
      "character": "Ami",
      "text": "Sensei, all you need to do is repay me with love."
    },
    {
      "character": "Sensei",
      "text": "Is there anything {i}else{/i} I can repay you with?"
    },
    {
      "character": "Ami",
      "text": "Love is like the easiest thing I could have possibly asked for! Can you at least go back in time to when you remembered you cared about me?!"
    },
    {
      "character": "Sensei",
      "text": "Yeah, I don’t really think time works like that. But I do thank you for...all of the work that you apparently do around here while I..."
    },
    {
      "character": "Sensei",
      "text": "I..."
    },
    {
      "character": "Ami",
      "text": "You can’t even remember what to do with your free time?"
    },
    {
      "character": "Sensei",
      "text": "Honestly, it would probably be easier for both of us if you just pretend I know literally nothing about this place."
    },
    {
      "character": "Ami",
      "text": "Hah...I’m starting to feel like one of those NPCs that guides the protagonist in the beginning of an RPG."
    },
    {
      "character": "Sensei",
      "text": "I think I know what those acronyms mean, but I’m not sure. So I’m just going to nod in agreement and hope you tell me more about how to live my life."
    },
    {
      "character": "Ami",
      "text": "Of course. But only because I’m so used to helping you out when you’re at your lowest point."
    },
    {
      "character": "Ami",
      "text": "Now, I don’t know {i}exactly{/i} how you spend every day...but I do know that you normally try to ration your time so you’re not spending all of it on just one person. {size=15}But if you do, that person should be me.{/size}"
    },
    {
      "character": "Ami",
      "text": "Now, let’s see...What are some things to do in the morning?"
    },
    {
      "character": "Ami",
      "text": "Oh. There’s a place called Koi Cafe just a few miles away from here that opened up a couple months ago that you might like."
    },
    {
      "character": "Ami",
      "text": "And the school library is also open on weekends if you ever want to go check out a book or something, so...there’s always that!"
    },
    {
      "character": "Ami",
      "text": "Also, I’m pretty sure the soccer team is looking for a coach as well. But you’ve never really been into sports so I can’t really see you ever going there."
    },
    {
      "character": "Sensei",
      "text": "And what about things to do in the afternoon? Anything notable? Or..."
    },
    {
      "character": "Ami",
      "text": "Well...there’s the shrine or the dojo, but...again, I have no idea why you’d go to either one of those places."
    },
    {
      "character": "Ami",
      "text": "There’s the mall as well, but..."
    },
    {
      "character": "Sensei",
      "text": "I’m going to take a wild guess here and say that you’re assuming I wouldn’t like hanging out in a place like that."
    },
    {
      "character": "Ami",
      "text": "Yeah. That’s exactly what I was assuming."
    },
    {
      "character": "Ami",
      "text": "You’re not a very exciting person, Sensei."
    },
    {
      "character": "narrator",
      "text": "It’s true that none of those options sound particularly appealing to me...but I am not about to allow myself to be ridiculed by a pubescent redhead in bunny pajamas."
    },
    {
      "character": "narrator",
      "text": "But I am also not about to fight back because Ami really is going out on a limb for me here and I don’t want to risk her just...not cooking or cleaning anymore."
    },
    {
      "character": "Sensei",
      "text": "There has to be {i}something{/i} else for me to do around noon, right?"
    },
    {
      "character": "Ami",
      "text": "You...could always just walk around and look for something to do, I guess? Most people are busy in the afternoon, so I have no idea if you’ll find anything you’re interested in, though."
    },
    {
      "character": "Ami",
      "text": "Oh! You could always come hang out with me! I-"
    },
    {
      "character": "Sensei",
      "text": "And what about night? What are some things to do around then?"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "I’m not sure if I want to tell you anymore if you’re just going to be mean and neglect me."
    },
    {
      "character": "Sensei",
      "text": "I’m not neglecting you at all. I came to you first thing in the morning, didn’t I?"
    },
    {
      "character": "Ami",
      "text": "You did...but I’m starting to think you would have just left if I kept a pile of travel brochures near the door."
    },
    {
      "character": "Sensei",
      "text": "Hey, if you want to run a travel agency out of your bedroom, that’s fine by me. I’ll be your first customer and everything."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Hah...I really hope your memories come back soon, Sensei. I’m kind of tempted to feed you false information just to confuse you at this point."
    },
    {
      "character": "Sensei",
      "text": "Please don’t. You’re all I have right now."
    },
    {
      "character": "Ami",
      "text": "I’m all you’ll ever have because I’m also all you’ll ever need."
    },
    {
      "character": "Ami",
      "text": "But, when it comes to night time...all I can really think of is the school dorms."
    },
    {
      "character": "Ami",
      "text": "Pretty much all of us gather there so, if you’re ever looking to kill some time or come see your adorable niece, that’s where you should go."
    },
    {
      "character": "Ami",
      "text": "I’m sure there’s also some {i}nightlife{/i} stuff you can find if you really want to..."
    },
    {
      "character": "Ami",
      "text": "But I’d really prefer you didn’t! "
    },
    {
      "character": "Sensei",
      "text": "What? Why not?"
    },
    {
      "character": "Ami",
      "text": "Because that’s where I imagine older girls would be. And if you ever get a girlfriend, I will burn this house to the ground."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Okay. I’m beginning to think that Ami may like her uncle a little too much."
    },
    {
      "character": "Ami",
      "text": "Did you hear me, Sensei? I said I would-"
    },
    {
      "character": "Sensei",
      "text": "Burn this house to the ground. I know. Which, by the way, is completely irrational."
    },
    {
      "character": "Ami",
      "text": "You would think it’s rational if you understood how much I love you."
    },
    {
      "character": "Sensei",
      "text": "I can’t imagine that’s true. But I doubt you’d have to worry about something like that in the first place since...relationships aren’t really my type of thing."
    },
    {
      "character": "Sensei",
      "text": "Besides, I already have ten girls I need to worry about on a daily basis. I don’t have time for romance."
    },
    {
      "character": "narrator",
      "text": "Seduction, however, is another story entirely. But I’m fine with keeping that contained to my students for the time being."
    },
    {
      "character": "Ami",
      "text": "This is the best news I have ever heard."
    },
    {
      "character": "Sensei",
      "text": "Because you’re not going to be abandoned?"
    },
    {
      "character": "Ami",
      "text": "If you abandoned me, what would happen if I needed to get something off of the top shelf? "
    },
    {
      "character": "Sensei",
      "text": "What would happen if you needed to pay rent? Or...the mortgage? "
    },
    {
      "character": "Sensei",
      "text": "You don’t happen to know how all of the bills here are handled, do you?"
    },
    {
      "character": "Ami",
      "text": "I’m pretty sure that all of our bills are automated since I’ve only seen you use your checkbook like one or two times."
    },
    {
      "character": "Ami",
      "text": "Either that or we’re way behind on every bill we have and will have to go live in an Internet cafe soon."
    },
    {
      "character": "Sensei",
      "text": "I’d like to avoid that if at all possible, so I guess I’ll just...look into it on my own or something."
    },
    {
      "character": "Ami",
      "text": "Okay. And I’ll go back to being a teenage girl who doesn’t fully understand what a mortgage is yet."
    },
    {
      "character": "Sensei",
      "text": "Sounds good. And thanks for all your help today, Ami."
    },
    {
      "character": "Ami",
      "text": "You don’t have to thank me, Sensei. I do this because I love you. Even {i}if{/i} you’d rather spend your free time aimlessly wandering around Kumon-mi instead of calling me pretty and buying me clothes."
    },
    {
      "character": "Sensei",
      "text": "Sorry. I’d offer to take you to the mall but, like you implied, that’s just not really a place that a guy like me would hang out at."
    },
    {
      "character": "Ami",
      "text": "How the heck did you manage to forget literally everything except how to be sarcastic?"
    },
    {
      "character": "Sensei",
      "text": "Luck maybe? I’m not really sure."
    },
    {
      "character": "Sensei",
      "text": "But I should probably be heading out. There are a series of places I wouldn’t normally go to calling my name right now, and you need to get back to cleaning anyway."
    },
    {
      "character": "Ami",
      "text": "Yeah...I guess I should probably finish up as soon as possible if I’m going to make it back to the dorm by dinner time."
    },
    {
      "character": "Ami",
      "text": "And I haven’t even {i}looked{/i} at the attic yet, so I have no idea how long that’s going to take."
    },
    {
      "character": "Sensei",
      "text": "Well...good luck, I guess. "
    },
    {
      "character": "Ami",
      "text": "Thanks, Sensei. Have fun taking advantage of your free time and remember to text me every thirty minutes so I know you’re okay."
    },
    {
      "character": "Sensei",
      "text": "No."
    },
    {
      "character": "Ami",
      "text": "At least pretend that you’re going to! I deserve at least that much!"
    },
    {
      "character": "narrator",
      "text": "I exit Ami’s room and make my way to the front door to see what else this city has to offer."
    },
    {
      "character": "narrator",
      "text": "And while I didn’t learn much about my niece herself (Apart from her...extreme affinity for “me”), I do feel a little more at home now."
    },
    {
      "character": "narrator",
      "text": "I’m still a fish out of water at the end of the day- but I’m one of those fish that can breathe on land for an extended period of time and won’t just flat out die within the first few minutes."
    },
    {
      "character": "narrator",
      "text": "Either way, I’m glad Ami is as helpful and reliable as she’s been so far."
    },
    {
      "character": "narrator",
      "text": "I can’t see any way at all that the two of us don’t wind up even closer."
    },
    {
      "character": "narrator",
      "text": "It’s just {i}how{/i} close that remains to be seen."
    },
    {
      "character": "narrator",
      "text": "{i}Ami’s affection has increased to [ami_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "ami_love +": {
      "from": null,
      "to": 1
    },
    "firsttimeamisroom": {
      "from": null,
      "to": true
    }
  }
}