{
  "event_id": 11,
  "event_label": "firsttimelibrary",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I decide to spend the morning at the library."
    },
    {
      "character": "narrator",
      "text": "It’s still a little too early for me to bother getting involved in whatever is going on in the more exciting parts of town, so I figure relaxing in here is probably the best way to avoid that."
    },
    {
      "character": "narrator",
      "text": "Besides, the library is attached to the school, which greatly increases my chances of bumping into one of my students and ultimately having sex with them."
    },
    {
      "character": "narrator",
      "text": "This calculated move has been brought to you in part by a man with nothing to lose and everything to gain."
    },
    {
      "character": "???",
      "text": "Oh! Good morning, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Good morning, Futaba. What brings you here today?"
    },
    {
      "character": "Futaba",
      "text": "The same thing that always brings me here, I suppose...Until someone else volunteers to handle mornings, I'll be right where I always am on Saturday and Sunday."
    },
    {
      "character": "narrator",
      "text": "Ah. So Futaba volunteers at the school library over the weekend. I guess that seems pretty in-line with the type of girl she came across as in {i}my{/i} journal."
    },
    {
      "character": "Futaba",
      "text": "You’re here early as ever, I see."
    },
    {
      "character": "narrator",
      "text": "And...I suppose {i}I{/i} also frequently drop by on the weekends? I guess that's useful to know."
    },
    {
      "character": "narrator",
      "text": "I wonder if whoever the last person to possess this body was {i}also{/i} wound up being dragged here by an early morning appetite for immorality?"
    },
    {
      "character": "Sensei",
      "text": "You know me. Early bird gets the worm and whatnot."
    },
    {
      "character": "narrator",
      "text": "I do my best to feign a slightly pompous teacher-laugh but it sounds pretty terrible and I promise myself to never try that again."
    },
    {
      "character": "Futaba",
      "text": "Hahaha...right..."
    },
    {
      "character": "Futaba",
      "text": "Oh! That reminds me...Do you have a moment to go over the homework assignment from last week with me?"
    },
    {
      "character": "Futaba",
      "text": "I was going to wait until we were in class again but, seeing as you're here right now...there's not really a need to wait."
    },
    {
      "character": "Sensei",
      "text": "Oh. Uhh...sure. You might need to remind me what that assignment actually was, though."
    },
    {
      "character": "Futaba",
      "text": "Of course, Sensei. I don't mind at all. Just give me a moment to get my notebook."
    },
    {
      "character": "narrator",
      "text": "Futaba retreats behind the front desk and reaches into something on one of the shelves I can't see from where I'm standing."
    },
    {
      "character": "narrator",
      "text": "She returns a moment later and pulls up a seat next to me, revealing a bright pink notebook that, based on a few glimpses I'm able to steal of the insides, seems pretty well-used."
    },
    {
      "character": "narrator",
      "text": "The scent of her perfume tickles my nostrils as a gust of wind from the open window steers it closer to me."
    },
    {
      "character": "narrator",
      "text": "It’s a mix of lemon and lavender- or at least something along those lines."
    },
    {
      "character": "narrator",
      "text": "It’s subtle, but enjoyable...The type of scent I wouldn’t mind waking up to every day."
    },
    {
      "character": "Futaba",
      "text": "The assignment you gave us was another, umm...poetry interpretation thing."
    },
    {
      "character": "Futaba",
      "text": "The part I'm having trouble with is this one poem in particular."
    },
    {
      "character": "Futaba",
      "text": "I know that all you asked us to do was give you our interpretation of the writer’s words, but...I guess I'm just having trouble actually {i}interpreting{/i} anything."
    },
    {
      "character": "Sensei",
      "text": "Not much of a poetry person?"
    },
    {
      "character": "Futaba",
      "text": "I like it! It's just...harder than what I'm used to."
    },
    {
      "character": "Futaba",
      "text": "I...umm...well, I read mostly fantasy. And there's usually a lot less {i}interpreting{/i} to do in books that often overload you on details."
    },
    {
      "character": "Sensei",
      "text": "Fair enough. Let's see what we've got here, then."
    },
    {
      "character": "narrator",
      "text": "I peer into the notebook and scan the pages for whatever poem Futaba is referencing."
    },
    {
      "character": "narrator",
      "text": "Thankfully, her handwriting is both elegant and easy to decipher, so I'm able to find it in no time at all..."
    },
    {
      "character": "Sensei",
      "text": "'There are days we live...as if death were nowhere...in the background; from joy to joy to joy..."
    },
    {
      "character": "Sensei",
      "text": "From wing to wing...from blossom to blossom...to impossible blossom...to sweet impossible blossom.'"
    },
    {
      "character": "Futaba",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Futaba",
      "text": "So...what does all this mean, exactly?"
    },
    {
      "character": "Sensei",
      "text": "I think this stanza is about how death is much closer than most of us imagine."
    },
    {
      "character": "Futaba",
      "text": "Really? But that’s in such stark contrast to the rest of the poem."
    },
    {
      "character": "Sensei",
      "text": "That’s exactly why this part hits as hard as it does."
    },
    {
      "character": "Sensei",
      "text": "Like death itself, this poem embodies the same element of surprise typically associated with it."
    },
    {
      "character": "Sensei",
      "text": "The more sudden type of death, of course. Not the drawn-out type we're all subjected to enduring over the course of our lives."
    },
    {
      "character": "Futaba",
      "text": "That's...so much darker than I thought. No wonder I couldn't get it."
    },
    {
      "character": "Sensei",
      "text": "Of course, we’re all free to create our own interpretations of the work. That’s the entire point of poetry, after all."
    },
    {
      "character": "Sensei",
      "text": "I'm just letting you know how I feel about it."
    },
    {
      "character": "Futaba",
      "text": "Wow..."
    },
    {
      "character": "Futaba",
      "text": "You’re amazing, Sensei..."
    },
    {
      "character": "Sensei",
      "text": "I exist."
    },
    {
      "character": "Sensei",
      "text": "I might not be a great or attentive teacher, but even I can handle this much."
    }
  ],
  "state_changes": {}
}