{
  "event_id": 17,
  "event_label": "firsttimeshrine",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I find myself wandering up the stairs to one of the last places I ever expected to be."
    },
    {
      "character": "narrator",
      "text": "I’m sure that doesn’t mean much to you considering we haven’t known each other very long, but it’s the truth."
    },
    {
      "character": "narrator",
      "text": "I’ve never been a religious person. Or...at least I don’t {i}think{/i} I’ve ever been much of a religious person."
    },
    {
      "character": "narrator",
      "text": "Ask me again later and I might have a better answer for you. "
    },
    {
      "character": "narrator",
      "text": "But for now, I’ll take cover in the shade provided by the clouds within my head and hope to somehow escape this summer heat unscathed."
    },
    {
      "character": "narrator",
      "text": "There’s an old saying here where all Japanese are born Shinto and die Buddhist, but just because it’s a commonly used expression doesn’t mean it’s something that applies to all of us."
    },
    {
      "character": "narrator",
      "text": "Some of us are simply born. "
    },
    {
      "character": "narrator",
      "text": "Some of us simply die."
    },
    {
      "character": "narrator",
      "text": "Some of us get lost somewhere in between those two things."
    },
    {
      "character": "narrator",
      "text": "And some of us are lucky enough to wake up in an alternate reality based on sheer luck and no influence from any god whatsoever."
    },
    {
      "character": "narrator",
      "text": "I’ll throw myself into that category as it keeps me out of debt with any higher power...and I’ll tell myself that the reason I am standing here right now is not because I am seeking salvation."
    },
    {
      "character": "narrator",
      "text": "It is not because I am lost."
    },
    {
      "character": "narrator",
      "text": "It is because I wanted to spit in God’s face."
    },
    {
      "character": "narrator",
      "text": "I contort my mouth into a grotesque shape and allow saliva to pool up inside of my cheeks, but wind up swallowing it all down when a soft set of footsteps head my way to break me out of my daydreaming."
    },
    {
      "character": "???",
      "text": "Oh...wonderful. "
    },
    {
      "character": "???",
      "text": "Getting started early this time, I see."
    },
    {
      "character": "Maya",
      "text": "And here I was thinking I’d be able to make it at least the first weekend without you showing up and ruining my day."
    },
    {
      "character": "Sensei",
      "text": "I’m sorry?"
    },
    {
      "character": "Maya",
      "text": "It’s nothing. Just...complaining to myself."
    },
    {
      "character": "Sensei",
      "text": "Well, feel free to complain to me if you like. We’ve known each other long enough that-"
    },
    {
      "character": "Maya",
      "text": "Oh, give me a break. We both know you’re not who you say you are."
    },
    {
      "character": "Sensei",
      "text": "I...have no idea what you’re talking about."
    },
    {
      "character": "Maya",
      "text": "Oh? So you {i}didn’t{/i} just happen to wake up inside of that body and assume the role of someone entirely unfamiliar to you?"
    },
    {
      "character": "narrator",
      "text": "How...does she know that?"
    },
    {
      "character": "narrator",
      "text": "This has to be some sort of trap, right? "
    },
    {
      "character": "narrator",
      "text": "If my own niece wasn’t able to pick up on me taking over, why would one of her friends be able to?"
    },
    {
      "character": "Sensei",
      "text": "Nope. In fact, that sounds pretty ridiculous."
    },
    {
      "character": "Maya",
      "text": "It does, doesn’t it?"
    },
    {
      "character": "Maya",
      "text": "Allow me to clue you in on something if you’re going to continue being so determined to walk a mile in someone else’s shoes."
    },
    {
      "character": "Maya",
      "text": "The {i}real{/i} you would have never come to a place like this. So, if you’re going to be that dedicated to playing the part, you should probably just leave now before someone else sees you here."
    },
    {
      "character": "narrator",
      "text": "Well, at least that’s one thing the previous inhabitant of this body and I have in common."
    },
    {
      "character": "narrator",
      "text": "I say, despite acting out of my own character and deciding to come here anyway for no reason whatsoever."
    },
    {
      "character": "Sensei",
      "text": "You’re really just...not going to believe me, are you?"
    },
    {
      "character": "Maya",
      "text": "Sorry. I normally have to get to know someone a little better before I start trusting them like that."
    },
    {
      "character": "Maya",
      "text": "Unfortunately for you, you’re one of the last people I’d ever go out of my way to do that with."
    },
    {
      "character": "Maya",
      "text": "So again, quit while you’re ahead and leave. You’ll be saving both of us a great deal of energy."
    },
    {
      "character": "Sensei",
      "text": "Just out of curiosity, are you always this confrontational with me? "
    },
    {
      "character": "Maya",
      "text": "Yes. Yes, I am."
    },
    {
      "character": "Maya",
      "text": "But isn’t that something you would already know if you really were {i}you?{/i}"
    },
    {
      "character": "Sensei",
      "text": "Didn’t Ami tell you the other day? I’ve been having-"
    },
    {
      "character": "Maya",
      "text": "Memory problems? Is that really the best that all of you can come up with?"
    },
    {
      "character": "Maya",
      "text": "Just once, I’d like to hear a new excuse and not the same...default answer I always get."
    },
    {
      "character": "Sensei",
      "text": "For the last time, I’m-"
    },
    {
      "character": "Maya",
      "text": "If you’re the real Sensei, what’s Ami’s birthday? Here, I’ll even give you a hint. It’s sometime in August."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "What’s wrong? Have you really forgotten your own niece’s birthday?"
    },
    {
      "character": "Sensei",
      "text": "August..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Seventh?"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Hah..."
    },
    {
      "character": "narrator",
      "text": "Fuck."
    },
    {
      "character": "Maya",
      "text": "Just as I thought. And I even gave you a hint this time and everything."
    },
    {
      "character": "Maya",
      "text": "Though...I guess I have no idea if the {i}real{/i} you would have even remembered that answer in the first place. That was just the type of guy he was."
    },
    {
      "character": "Sensei",
      "text": "Just the type of guy I {i}am,{/i} you mean."
    },
    {
      "character": "Maya",
      "text": "Seriously? You’re going to keep the charade up even though I’ve already caught you in like, three different ways so far? How stupid are you?"
    },
    {
      "character": "Sensei",
      "text": "Correct me if I’m wrong, but I don’t think shrine maidens are really supposed to be talking to people that way."
    },
    {
      "character": "Maya",
      "text": "Fine. I will. You are wrong and this is me correcting you."
    },
    {
      "character": "Maya",
      "text": "Do you feel like an idiot yet? Are you embarrassed at how easily I managed to see through your act?"
    },
    {
      "character": "Sensei",
      "text": "Are {i}you{/i} embarrassed wearing that dress?"
    },
    {
      "character": "Maya",
      "text": "Why would I be embarrassed? I am fucking adorable."
    },
    {
      "character": "Sensei",
      "text": "I don’t think shrine maidens are supposed to say “fucking adorable” either."
    },
    {
      "character": "Maya",
      "text": "You sure seem to know a lot about shrine maidens for someone who has yet to even pray. "
    },
    {
      "character": "Maya",
      "text": "Is your affinity for girls who dress like me the reason you came here first this time?"
    },
    {
      "character": "Maya",
      "text": "Am I just fetish material for you? Are you that unabashedly perverted?"
    },
    {
      "character": "Sensei",
      "text": "No, I just...didn’t really have a choice, I think."
    },
    {
      "character": "Maya",
      "text": "You...didn’t have a choice? What is that supposed to mean?"
    },
    {
      "character": "Sensei",
      "text": "After talking to Ami, I left the house. Then...before I knew it, I was walking up the steps and monologuing about the whole “Born Shinto, Die Buddhist” thing."
    },
    {
      "character": "Maya",
      "text": "Oh, is {i}that{/i} why you looked so pathetic on your way up the stairs? I had just assumed it was because you’re getting too old to walk anymore."
    },
    {
      "character": "Sensei",
      "text": "Come on. I’m not that old, am I?"
    },
    {
      "character": "Maya",
      "text": "You tell me. At the very least, you should remember your age. Right?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "The longer this conversation carries on, the further Maya manages to press me into a corner. "
    },
    {
      "character": "narrator",
      "text": "And as much as I want to say I don’t think she’s serious and that this is all just some sort of...vetting process or something, I understand that it’s much more than that."
    },
    {
      "character": "narrator",
      "text": "She knows something. "
    },
    {
      "character": "narrator",
      "text": "Something about {i}me.{/i}"
    },
    {
      "character": "narrator",
      "text": "Something about how I got here or...where we are or...any of the things Ami wasn’t able to fill me in on during our talk earlier."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "But-"
    },
    {
      "character": "narrator",
      "text": "For some reason..."
    },
    {
      "character": "narrator",
      "text": "I can’t bring myself to admit that she’s right out loud."
    },
    {
      "character": "narrator",
      "text": "And so I do what I imagine I always did in my previous life."
    },
    {
      "character": "narrator",
      "text": "I lie through my teeth in hopes of persuading her."
    },
    {
      "character": "Sensei",
      "text": "You’re wrong about me, you know."
    },
    {
      "character": "Maya",
      "text": "No, I’m not."
    },
    {
      "character": "narrator",
      "text": "As you can see, it doesn’t work."
    },
    {
      "character": "Maya",
      "text": "So...this monologue you speak of...exactly what did it entail?"
    },
    {
      "character": "Sensei",
      "text": "Oh? Are you actually interested in something I have to say now? Or are you just going to use this opportunity to mock me a little more?"
    },
    {
      "character": "Maya",
      "text": "I guess it really depends on your answer. I’m not particularly fond of religion, but I’d be lying if I said it didn’t interest me in...some form."
    },
    {
      "character": "Sensei",
      "text": "You’re really just full of anti-miko jargon, aren’t you?"
    },
    {
      "character": "Maya",
      "text": "I’m perhaps the world’s worst {i}and{/i} best shrine maiden all at once. Though, I imagine anyone actually good at this wouldn’t really understand what I consider my strong points."
    },
    {
      "character": "Sensei",
      "text": "Well, the monologue wasn’t all that interesting. It was moreso just an excuse for me to be fatalistic on the way up the stairs, I think."
    },
    {
      "character": "Maya",
      "text": "I see."
    },
    {
      "character": "Maya",
      "text": "Well, you’re right about it not being interesting if that’s really all it was. So allow me to use this opportunity to tell you more about what {i}I{/i} think."
    },
    {
      "character": "Maya",
      "text": "Do you have a pen and paper on you? Because this is information that I think you’ll want to keep in mind if you really do want to succeed in this world."
    },
    {
      "character": "Maya",
      "text": "{i}Especially{/i} if you have so many alleged memory issues."
    },
    {
      "character": "Sensei",
      "text": "I...don’t really carry that sort of stuff with me."
    },
    {
      "character": "Maya",
      "text": "Aren’t you supposed to be a teacher?"
    },
    {
      "character": "Sensei",
      "text": "Just...tell me what you’re trying to tell me, Maya."
    },
    {
      "character": "Maya",
      "text": "Okay. But, if you’re anything like the rest of them, you’re not going to remember any of this anyway. "
    },
    {
      "character": "Sensei",
      "text": "Then why bother telling me at all? Since you’re so sure of who I am, I mean."
    },
    {
      "character": "Maya",
      "text": "Because despite my cold demeanor and mostly expressionless face...and the fact that I really just abhor you all around-"
    },
    {
      "character": "Maya",
      "text": "I want to give you a head start."
    },
    {
      "character": "Maya",
      "text": "Or a...chance, so to speak."
    },
    {
      "character": "Maya",
      "text": "It’s the least I can do before permanently severing ties with you."
    },
    {
      "character": "Sensei",
      "text": "Permanently? Why does it have to be permanent?"
    },
    {
      "character": "Maya",
      "text": "Because I want absolutely nothing to do with you for reasons I don’t have the time to explain today."
    },
    {
      "character": "Maya",
      "text": "If you must, you may speak to me in school. But only when there are others present and only when what you need to speak about pertains to school itself."
    },
    {
      "character": "Maya",
      "text": "Or anything I personally find interesting. But even then, I’d likely rather just think about those things on my own than discuss them with my friend’s grandfather."
    },
    {
      "character": "Sensei",
      "text": "Uncle."
    },
    {
      "character": "Maya",
      "text": "Great uncle?"
    },
    {
      "character": "Sensei",
      "text": "Just uncle..."
    },
    {
      "character": "Maya",
      "text": "Apologies."
    },
    {
      "character": "narrator",
      "text": "Maya closes her eyes and smacks her broom against the ground but, since the hard part of it is facing upward, the soft part is the one that makes contact with the concrete and barely makes a noise at all."
    },
    {
      "character": "narrator",
      "text": "Needless to say, it was a failed attempt at looking cool and I’m hoping that whatever her speech is about winds up earning her some bonus points in that department."
    },
    {
      "character": "Maya",
      "text": "There is an infinite amount of worlds out there...and an infinite amount of possibilities within each and every one of them."
    },
    {
      "character": "Maya",
      "text": "And with an infinite amount of people and souls waiting to be recycled, the contents of each one of those worlds are rapidly changing. "
    },
    {
      "character": "Maya",
      "text": "They spin together, but in different directions. "
    },
    {
      "character": "Maya",
      "text": "Sometimes, they spin so fast that parts of them combine. "
    },
    {
      "character": "Maya",
      "text": "With that in mind, each one of those potential worlds in the never ending, ever expanding list of them is like a cocktail of misfortune and agony with an occasional splash of joy and...mint."
    },
    {
      "character": "Sensei",
      "text": "Mint?"
    },
    {
      "character": "Maya",
      "text": "Shut up. I’m not done."
    },
    {
      "character": "narrator",
      "text": "Maya slaps the ground with the broom again, but actually looks a little bit cool this time."
    },
    {
      "character": "Maya",
      "text": "Somehow or another, despite the endless amount of possibilities and universes overflowing with the opposites of what we desire-"
    },
    {
      "character": "Maya",
      "text": "Somehow or another, you wound up here. "
    },
    {
      "character": "Maya",
      "text": "At the same shrine as me. "
    },
    {
      "character": "Maya",
      "text": "In the same town as me."
    },
    {
      "character": "Maya",
      "text": "Feigning ignorance and pretending that you’ve been here all along is a slap in the face to whatever force or forces brought you before me."
    },
    {
      "character": "Maya",
      "text": "If you believe that force to be coincidence, coincidence is God. "
    },
    {
      "character": "Maya",
      "text": "If you believe it to be some supernatural entity, {i}that{/i} is your God."
    },
    {
      "character": "Maya",
      "text": "But no matter what “God” you choose and what story you decide on, you must remember first and foremost..."
    },
    {
      "character": "Maya",
      "text": "That none of that matters at all."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Maya",
      "text": "None of it. "
    },
    {
      "character": "Sensei",
      "text": "Then why did you even bother-"
    },
    {
      "character": "Maya",
      "text": "Because what matters more than {i}how{/i} you got here is what you are going to do now that you are."
    },
    {
      "character": "Maya",
      "text": "Now that you know how the world works, you are free to ignore it...for the most part, at least."
    },
    {
      "character": "Sensei",
      "text": "{i}What?{/i}"
    },
    {
      "character": "Maya",
      "text": "Somehow or another, you were given a life in the same space as me. At the same time as me."
    },
    {
      "character": "Maya",
      "text": "And you would be an absolute moron to not make the most of it- whether you call that life yours or accept that it belongs to someone else."
    },
    {
      "character": "Sensei",
      "text": "But...why are you telling me this when you’ve already come out and admitted to disliking me?"
    },
    {
      "character": "Sensei",
      "text": "Why help me at all?"
    },
    {
      "character": "Maya",
      "text": "The answer to that is one I’ve already alluded to."
    },
    {
      "character": "Maya",
      "text": "And it’s because..."
    },
    {
      "character": "Maya",
      "text": "From this moment on..."
    },
    {
      "character": "Maya",
      "text": "You will have nothing to do with me."
    },
    {
      "character": "Maya",
      "text": "I don’t care how badly you want to see me. I don’t care if it eats at you from the inside out."
    },
    {
      "character": "Maya",
      "text": "You are strictly forbidden from coming here...and you are strictly forbidden from ever even {i}attempting{/i} to get to know me."
    },
    {
      "character": "Maya",
      "text": "The reason I was willing to help you out to the extent I have today is that {i}my{/i} existence is heavily dependent on yours."
    },
    {
      "character": "Maya",
      "text": "And that existence is in grave danger if you do not heed this warning."
    },
    {
      "character": "Maya",
      "text": "Do I make myself clear?"
    },
    {
      "character": "Sensei",
      "text": "Absolutely."
    },
    {
      "character": "Maya",
      "text": "So you agree to leave me alone? And to never come here again?"
    },
    {
      "character": "Sensei",
      "text": "Absolutely not."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Hah..."
    },
    {
      "character": "narrator",
      "text": "There is no slap of the broom this time- just the resigned sigh of a girl who looks like she’s all out of options."
    },
    {
      "character": "Maya",
      "text": "Predictable as ever."
    },
    {
      "character": "Sensei",
      "text": "Why is it so important that I stay away from you? And what do you mean when you say that your existence is dependent on mine?"
    },
    {
      "character": "Maya",
      "text": "What I mean is that I want you to stop looking for answers and just go enjoy your exciting new life surrounded by tons of cute girls not named Maya."
    },
    {
      "character": "Sensei",
      "text": "But what if I’m only into girls named Maya?"
    },
    {
      "character": "Maya",
      "text": "Then I suggest you find another."
    },
    {
      "character": "Maya",
      "text": "Because getting close to you is the actual worst thing that could possibly happen."
    },
    {
      "character": "Sensei",
      "text": "That’s-"
    },
    {
      "character": "Maya",
      "text": "For {i}both{/i} of us. Not just me."
    },
    {
      "character": "Maya",
      "text": "Now, go. I still have work to do around here."
    },
    {
      "character": "Maya",
      "text": "And don’t worry about me revealing your big {i}secret{/i} to any of the other girls. It’s not like they’d even believe me if I told them anyway."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Why have you not left yet?"
    },
    {
      "character": "Sensei",
      "text": "I just figured I’d say thank you first."
    },
    {
      "character": "Maya",
      "text": "Oh?"
    },
    {
      "character": "Sensei",
      "text": "Especially since I can’t make good on that whole “leaving you alone” thing."
    },
    {
      "character": "Maya",
      "text": "So you intend to drag the two of us into ruin together? Is that really what you want?"
    },
    {
      "character": "Sensei",
      "text": "I have no idea what I want. "
    },
    {
      "character": "Sensei",
      "text": "I just know that leaving you out of it won’t be part of the plan."
    },
    {
      "character": "Maya",
      "text": "You’re disgusting. Please leave me alone forever."
    },
    {
      "character": "Sensei",
      "text": "I’ll leave you alone {i}for now{/i}."
    },
    {
      "character": "Sensei",
      "text": "But I’ll be back soon."
    },
    {
      "character": "Maya",
      "text": "Then I suppose I’ll begin looking for hiding places as soon as you leave. I appreciate you for giving me a heads up."
    },
    {
      "character": "Sensei",
      "text": "Same here. Just...with the whole parallel universes thing and not the hiding thing. Even if I...barely understood any of what you were talking about."
    },
    {
      "character": "Maya",
      "text": "I knew that you wouldn’t. Your brain is too smooth and full of sexual fantasies involving your niece and her friends. "
    },
    {
      "character": "Sensei",
      "text": "You know you’re one of those friends, right?"
    },
    {
      "character": "Maya",
      "text": "Please don’t ruin my lunch for me before I’ve even had a chance to eat it..."
    },
    {
      "character": "narrator",
      "text": "So..."
    },
    {
      "character": "narrator",
      "text": "That’s Maya, I guess."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "She’s a little...different from how I expected her to be."
    },
    {
      "character": "narrator",
      "text": "Granted, I wasn’t really sure what {i}to{/i} expect since every interaction I’ve had with her up until now has been extremely brief, but..."
    },
    {
      "character": "narrator",
      "text": "Having her...aware of my existence when no one else is?"
    },
    {
      "character": "narrator",
      "text": "How is that even possible?"
    },
    {
      "character": "narrator",
      "text": "And how can she expect me to just leave her alone after {i}revealing{/i} that she knows all of that?"
    },
    {
      "character": "narrator",
      "text": "Of course I’m going to keep coming back to her when she’s presenting an entire platter worth of reasons to do that right in front of my face."
    },
    {
      "character": "narrator",
      "text": "I just..."
    },
    {
      "character": "narrator",
      "text": "I have no idea where to start when I do."
    },
    {
      "character": "narrator",
      "text": "Everything on the platter is something I’ve never seen before."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "But, I guess that’s how {i}everything{/i} is for me now."
    },
    {
      "character": "narrator",
      "text": "This life. This town. "
    },
    {
      "character": "narrator",
      "text": "It’s all one big platter full of beautiful, new things."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "And I can’t wait to get my hands on all of them."
    },
    {
      "character": "narrator",
      "text": "{i}Maya’s affection has increased to [maya_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Enjoy your stay in Kumon-mi!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "maya_love +": {
      "from": null,
      "to": 1
    },
    "firsttimeshrine": {
      "from": null,
      "to": true
    }
  }
}