{
  "event_id": 19,
  "event_label": "firsttimesoccer",
  "dialogue": [
    {
      "character": "narrator",
      "text": "You know, after being reborn into a world where I’m suddenly expected to fulfill the role of a teacher, I didn’t really expect to be using my {i}free time{/i} to hang out at school as well."
    },
    {
      "character": "narrator",
      "text": "But here I am, drenched in sunlight and making my way over to the soccer field for reasons unbeknownst to even me."
    },
    {
      "character": "narrator",
      "text": "I’m not sure what I expect to get out of this exactly, but I do know that at least one of my students is a member of the soccer team, so I'm {i}really{/i} hoping she’s there."
    },
    {
      "character": "narrator",
      "text": "Otherwise, I’ll just wind up looking like some creepy older guy wandering around the premises."
    },
    {
      "character": "narrator",
      "text": "Which, in all fairness I kind of am. "
    },
    {
      "character": "narrator",
      "text": "It’s just significantly {i}less{/i} creepy if I know someone and can fall back on them."
    },
    {
      "character": "narrator",
      "text": "Even if...the person I’d be falling on is a foot shorter than me and would likely snap in half from the pressure."
    },
    {
      "character": "narrator",
      "text": "I manage to spot Miku gathering up some rogue soccer balls and shouting things to a group of girls who appear to be heading back to the gym."
    },
    {
      "character": "narrator",
      "text": "Not knowing what else to do and still mildly worried about appearing as a stalker, I make my way over to her."
    },
    {
      "character": "Sensei",
      "text": "Hey, Miku. Good morning."
    },
    {
      "character": "Miku",
      "text": "Heya! Mornin’, Sensei!"
    },
    {
      "character": "Miku",
      "text": "Wait, Sensei?! What are you doin’ over here?! You some kinda stalker now or somethin’?"
    },
    {
      "character": "narrator",
      "text": "Damn it."
    },
    {
      "character": "Sensei",
      "text": "No. In fact, I only approached you so I {i}wouldn’t{/i} look like some kind of stalker."
    },
    {
      "character": "Miku",
      "text": "So...you’re stalkin’ me to...{i}not{/i} look like a stalker? I don’t get it."
    },
    {
      "character": "Sensei",
      "text": "I’m not stalking anyone. I just happened to be in the area and thought I’d come say hi or something."
    },
    {
      "character": "Miku",
      "text": "Works for me! I hereby grant you one Miku Maruyama “Daytime Stalking Pass!”"
    },
    {
      "character": "Miku",
      "text": "In fact, take a whole box of ‘em! I give you permission to show up whenever ya want from this point on!"
    },
    {
      "character": "Miku",
      "text": "How come ya gotta be at school on the weekend, though? Thought all you teachers were out doin’ math problems with each other or somethin’ on those days."
    },
    {
      "character": "Sensei",
      "text": "Teachers have lives too, you know. "
    },
    {
      "character": "Miku",
      "text": "Sure don’t look like it if you’re-"
    },
    {
      "character": "Sensei",
      "text": "I’m just very good at my job. Can we stop talking about teaching now?"
    },
    {
      "character": "Miku",
      "text": "Heck yeah we can! That kinda stuff always puts me to sleep anyway."
    },
    {
      "character": "Miku",
      "text": "So, you lookin’ to learn about soccer or somethin’? Haven’t really seen ya drop by the field at all and I ain’t buyin’ that you’re just here to say hi."
    },
    {
      "character": "Miku",
      "text": "Wait a sec! You ain’t here to become the new coach, are you?!"
    },
    {
      "character": "Sensei",
      "text": "Coach? Absolutely not. I have zero interest in soccer and I {i}really{/i} am only here to say hi."
    },
    {
      "character": "Miku",
      "text": "Guh."
    },
    {
      "character": "Sensei",
      "text": "Guh?"
    },
    {
      "character": "Miku",
      "text": "God! Can’t a girl say “Guh” around here without a teacher jumpin’ down her pants?!"
    },
    {
      "character": "Sensei",
      "text": "I think you mean “throat” but please proceed."
    },
    {
      "character": "Miku",
      "text": "Sorry for snappin’ at ya, Sensei. It’s just been all downhill since our last coach got knocked up and had to get put on baby-watch or whatever they call it."
    },
    {
      "character": "Sensei",
      "text": "I believe that would be “maternity leave.”"
    },
    {
      "character": "Miku",
      "text": "I don’t care what it’s called. All I know is that we’re startin’ to fall behind and we were {i}already{/i} havin’ a tough time trainin’ for nationals."
    },
    {
      "character": "Sensei",
      "text": "Nationals? Are you guys really that good?"
    },
    {
      "character": "Miku",
      "text": "Good? No way. "
    },
    {
      "character": "Miku",
      "text": "A few of us are pretty awesome- me being one of ‘em of course. But a lot of the girls are like headless chickens out there, Sensei. It’s pure chaos."
    },
    {
      "character": "Miku",
      "text": "I was kinda hopin’ this was gonna be like a sports anime and you were gonna show up and be all like “I used to play soccer before I stepped on a landmine” and then drop knowledge bombs on us."
    },
    {
      "character": "Miku",
      "text": "Oh, crud! Sorry for wordin’ it like that. I’m sure it ain’t easy hearin’ the word “bomb” used so casually after the whole thing with your leg."
    },
    {
      "character": "Sensei",
      "text": "Again, I know absolutely nothing about soccer and I am mostly confident that I have never stepped on a landmine."
    },
    {
      "character": "Miku",
      "text": "Today just keeps gettin’ worse..."
    },
    {
      "character": "Miku",
      "text": "Guess it wouldn’t change much even if I did get my sports anime wish, though. "
    },
    {
      "character": "Miku",
      "text": "With the whole space war thing goin’ on, none of us are allowed outside of the barrier anyway."
    },
    {
      "character": "Miku",
      "text": "With no teams from other prefectures to play, it’s kinda like the entire soccer team is just one giant, headless chicken."
    },
    {
      "character": "Sensei",
      "text": "Do you know any other analogies or is that the only one?"
    },
    {
      "character": "Miku",
      "text": "I don’t even know what an “analogy” is so that’s probably the only one."
    },
    {
      "character": "narrator",
      "text": "I guess the journal thing in my room was right about Miku not being the brightest girl out there."
    },
    {
      "character": "narrator",
      "text": "It wouldn’t be fair if she was gifted in both sports {i}and{/i} studies, though. It’s normally just one or the other for people."
    },
    {
      "character": "narrator",
      "text": "Or neither, if you’re really unlucky."
    },
    {
      "character": "narrator",
      "text": "But hey, at least Miku’s got {i}something.{/i}"
    },
    {
      "character": "Sensei",
      "text": "I guess definitions aren’t really important as long as you’re not failing all of your tests. "
    },
    {
      "character": "Miku",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You’re failing all of your tests, aren’t you?"
    },
    {
      "character": "Miku",
      "text": "You’re my teacher! Shouldn’t you know?! "
    },
    {
      "character": "Miku",
      "text": "Makoto’s doin’ all she can to help me, but there’s only so much room in my brain for all that smart person stuff!"
    },
    {
      "character": "Miku",
      "text": "I swear, I really don’t get why she wants to stay friends with me sometimes when I’ve got pretty much nothin’ I can do for her."
    },
    {
      "character": "Sensei",
      "text": "You and Makoto are friends?"
    },
    {
      "character": "Miku",
      "text": "Best friends, actually! Roommates too. We’re like two peas in a pod if the...pod only had two peas in it? How many peas are normally in a pod? "
    },
    {
      "character": "Sensei",
      "text": "I have no idea, Miku."
    },
    {
      "character": "Miku",
      "text": "Some kinda teacher you are. Not knowin’ about peas and showin’ up to soccer practice to stalk the star player."
    },
    {
      "character": "Sensei",
      "text": "Hey, I have unlimited daytime stalking passes. I am allowed to be here."
    },
    {
      "character": "Miku",
      "text": "Didn’t say ya weren’t. I think it’s great that ya wanna spend so much time around young girls. Means you’re still in touch with your youthful side."
    },
    {
      "character": "Sensei",
      "text": "Yup. That is exactly what that means."
    },
    {
      "character": "Miku",
      "text": "You like any kinda sports at all, Sensei? Baseball? Tennis? Hermit crab racing?"
    },
    {
      "character": "Sensei",
      "text": "Not really. I’ve always- wait, what was that last one?"
    },
    {
      "character": "Miku",
      "text": "Hm? Tennis?"
    },
    {
      "character": "Sensei",
      "text": "No, the...actually, forget it. I don’t like any sports. "
    },
    {
      "character": "Sensei",
      "text": "In fact...I don’t really like anything now that I actually think about it."
    },
    {
      "character": "Miku",
      "text": "Well then how the heck do ya look all muscley and stuff? If ya didn’t just tell me you’re some kinda couch potato, I’d think you were workin’ out all day every day!"
    },
    {
      "character": "Sensei",
      "text": "This is just how I am, I guess. I’m sure your looks wouldn’t change much either if you just...dropped out of the team or something."
    },
    {
      "character": "Miku",
      "text": "Miku Maruyama droppin’ out of the soccer team? No way. There’s a better chance of you findin’ the guy responsible for blowin’ off your leg."
    },
    {
      "character": "Miku",
      "text": "I love soccer. I love the rush. Runnin’ around with my friends...goin’ out to family restaurants after practice..."
    },
    {
      "character": "Miku",
      "text": "Even cleanin’ up all the balls is kinda fun when ya get to do it with people ya like bein’ around."
    },
    {
      "character": "Sensei",
      "text": "Well, I am very sorry for standing between you and your affinity for balls."
    },
    {
      "character": "Miku",
      "text": "You ain’t standin’ between anythin’, Sensei! I like bein’ around you too!"
    },
    {
      "character": "Miku",
      "text": "If I didn’t, I woulda asked you to leave a while ago."
    },
    {
      "character": "Miku",
      "text": "Besides, the fact that you’re still here makes me confident that I can get ya to agree to bein’ our new coach!"
    },
    {
      "character": "Sensei",
      "text": "No."
    },
    {
      "character": "Miku",
      "text": "At least think about it, would ya?! If we don’t get a new coach by the end of the season, the school is gonna disband us!"
    },
    {
      "character": "Sensei",
      "text": "Are they really?"
    },
    {
      "character": "Miku",
      "text": "Well...they haven’t come out and said that! But that’s what would happen if this was a sports anime!"
    },
    {
      "character": "Sensei",
      "text": "You really need to stop equating your real life sports club to the clubs in cartoons, Miku."
    },
    {
      "character": "Sensei",
      "text": "Though...I definitely wouldn’t be surprised if your club {i}was{/i} disbanded for the reasons you mentioned."
    },
    {
      "character": "Sensei",
      "text": "I’m sure there are like...health hazards or something if all of you are here over the weekend unsupervised."
    },
    {
      "character": "Miku",
      "text": "It ain’t like we need supervision. Heck, it ain’t even like we need {i}coaching{/i} on account of the lack of teams for us to play against. "
    },
    {
      "character": "Miku",
      "text": "We just need somebody who doesn’t mind occasionally bein’ around a bunch of girls in tight shorts to sign their name on a sheet of paper so we can keep doin’ what we love doin’."
    },
    {
      "character": "Sensei",
      "text": "That really should have been your pitch from the get go. That sounds a lot more enticing."
    },
    {
      "character": "Miku",
      "text": "Just wait ‘til ya see my vice captain. She’s got thighs so crazy they’ll give ya nightmares. Abs so hard they’ll...give ya nightmares too!"
    },
    {
      "character": "Miku",
      "text": "What I’m gettin’ at is that you’re gonna have a bunch of nightmares, Sensei! So you better be prepared!"
    },
    {
      "character": "narrator",
      "text": "As much as I like the idea of surrounding myself with other versions of Miku...I really don’t know if I’ll have the time to do this whole coaching thing."
    },
    {
      "character": "narrator",
      "text": "There’s no way it will be as easy as just signing my name on a sheet of paper and staring at thighs."
    },
    {
      "character": "narrator",
      "text": "Especially not when even keeping up with this conversation has been harder than normal for me."
    },
    {
      "character": "Sensei",
      "text": "I...don’t know, Miku."
    },
    {
      "character": "Miku",
      "text": "Then I’ll just have to keep botherin’ ya!"
    },
    {
      "character": "Miku",
      "text": "You do plan on comin’ back, right? I’m sure I ain’t alone in thinkin’ that a boy bein’ around might help some of the girls kick it into overdrive, if you know what I’m sayin’."
    },
    {
      "character": "Sensei",
      "text": "I want that to be a compliment, but I’m pretty sure it’s because almost all of the other men around here are gone."
    },
    {
      "character": "Miku",
      "text": "That just means you’ve got more options to choose from! Tons of young, spunky soccer players- ripe for the pickin’!"
    },
    {
      "character": "Sensei",
      "text": "For someone who loves being around her friends so much, you sure don’t seem to have a problem with handing them off to someone twice their age."
    },
    {
      "character": "Miku",
      "text": "Think of ‘em as bargaining chips, Sensei. If you start dependin’ on ‘em and then I cut off your supply...you’ll {i}have{/i} to be our coach."
    },
    {
      "character": "Miku",
      "text": "And that’s the bottom line, cause Miku Maruyama said so."
    },
    {
      "character": "Sensei",
      "text": "Miku."
    },
    {
      "character": "Miku",
      "text": "Guh. Don’t say it. It’s hard enough to stay motivated when all ya can do is run around in circles like some kinda-"
    },
    {
      "character": "Sensei",
      "text": "If you mention headless chickens again, I am going to deflate every soccer ball on this field."
    },
    {
      "character": "Miku",
      "text": "Hold on there, Bill Belichick! You think you can just walk onto {i}my{/i} soccer field and start touchin’ {i}my{/i} balls?! You ain’t earned the right!"
    },
    {
      "character": "Sensei",
      "text": "That’s fine, because hearing you word it that way killed any desire I would have possibly had to do it anyway."
    },
    {
      "character": "Miku",
      "text": "Mwahahah! Miku Maruyama wins again! A true champion of justice and soccer!"
    },
    {
      "character": "Sensei",
      "text": "But not Nationals."
    },
    {
      "character": "Miku",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You know. Since you’ll never be able to make it, I mean."
    },
    {
      "character": "Miku",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Gimme back that friggin’ day pass."
    },
    {
      "character": "narrator",
      "text": "Miku revokes my box of imaginary day passes, but that’s okay."
    },
    {
      "character": "narrator",
      "text": "Because even if I have no intention of becoming the coach of this team, I still plan on showing up again."
    },
    {
      "character": "narrator",
      "text": "Just like how I plan to learn more about Miku and ultimately use that as leverage to find my way into her extremely tight shorts."
    },
    {
      "character": "narrator",
      "text": "That still seems miles away at this point, of course."
    },
    {
      "character": "narrator",
      "text": "But something about seeing her sprint toward her goals makes me want to sprint toward mine..."
    },
    {
      "character": "narrator",
      "text": "Even if they’re on the opposite side of the world."
    },
    {
      "character": "narrator",
      "text": "As I turn around to leave the field, a ball crashes into my back with so much force that it almost knocks me over."
    },
    {
      "character": "narrator",
      "text": "I think about glancing behind me to see whether or not this was intentional-"
    },
    {
      "character": "narrator",
      "text": "But the sudden addition of Miku’s childish laughter blending in with the pre-existing medley of vigorous youth answers that question better than any glance possibly could."
    },
    {
      "character": "narrator",
      "text": "{i}Miku’s affection has increased to [miku_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "miku_love +": {
      "from": null,
      "to": 1
    },
    "firsttimesoccerfield": {
      "from": null,
      "to": true
    }
  }
}