{
  "event_id": 21,
  "event_label": "firsttimecafe",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I decide to stop by the cafe after refusing breakfast from Ami a good four or five times."
    },
    {
      "character": "narrator",
      "text": "It's nothing against her cooking. In fact, it kind of feels like Ami's carefully tailored her abilities to the best of my liking."
    },
    {
      "character": "narrator",
      "text": "I just feel compelled to get out and actually do things every once in a while."
    },
    {
      "character": "narrator",
      "text": "Or at least trick myself into thinking that I'm doing things when, in all actuality, I'm just roaming around in hopes of more easily bridging the first half of the day to the second."
    },
    {
      "character": "narrator",
      "text": "Regardless, I am at the cafe now. And so I must do what is customary for any cafe-goer-"
    },
    {
      "character": "narrator",
      "text": "Hit on the barista."
    },
    {
      "character": "???",
      "text": "Next customer!"
    },
    {
      "character": "Rin",
      "text": "What can I get y-"
    },
    {
      "character": "Rin",
      "text": "Wait, Sensei? I almost didn’t recognize you on account of the normal clothes and slightly threatening aura."
    },
    {
      "character": "Sensei",
      "text": "Threatening aura?"
    },
    {
      "character": "Rin",
      "text": "Slightly threatening. Like a bear, but if the bear was asleep or missing both of its hind legs."
    },
    {
      "character": "Sensei",
      "text": "Good. That's pretty close to what I was going for so I'm glad the change of clothes helped."
    },
    {
      "character": "Rin",
      "text": "Weird seeing you drop by, though. Didn't take you for much of a coffee drinker."
    },
    {
      "character": "Rin",
      "text": "So, what can I get you?"
    },
    {
      "character": "Sensei",
      "text": "I'll take, uhh..."
    },
    {
      "character": "Sensei",
      "text": "Just a large coffee please."
    },
    {
      "character": "Sensei",
      "text": "Unless you're going to force me to use whatever the Italian word for large is."
    },
    {
      "character": "Sensei",
      "text": "If that's the case, I'll just leave with nothing."
    },
    {
      "character": "Rin",
      "text": "No one actually {i}forces{/i} anyone to use those sizes, dude. They're more of a quirky suggestion than a flat out rule."
    },
    {
      "character": "Rin",
      "text": "Forcing people to say {i}Venti{/i} and {i}Grande{/i} and stuff is more like a...fun little movie thingy."
    },
    {
      "character": "Rin",
      "text": "But anyway, what do you take in your coffee? Milk? Sugar?"
    },
    {
      "character": "Sensei",
      "text": "Just black, please."
    },
    {
      "character": "Rin",
      "text": "Woah, really? You're not just trying to upgrade your slightly threatening aura to full on threatening, are you? Cause I wasn't trying to wake the bear."
    },
    {
      "character": "Sensei",
      "text": "Nope. That's just how I drink coffee."
    },
    {
      "character": "Rin",
      "text": "And you're not just trying to make things easy for me either?"
    },
    {
      "character": "Rin",
      "text": "Because I’ll have you know I’m pretty great when it comes to this barista stuff."
    },
    {
      "character": "Rin",
      "text": "Humble brag, but I can kind of run circles around the rest of the staff here."
    },
    {
      "character": "Sensei",
      "text": "Impressive, but no. I really do just drink my coffee black."
    },
    {
      "character": "Rin",
      "text": "If you say so. At least it’ll be easy to remember your order."
    },
    {
      "character": "Sensei",
      "text": "Who says I’m coming back? You still have a chance to blow this."
    },
    {
      "character": "Rin",
      "text": "How could anyone mess up a black coffee? You just...pour it into a cup."
    },
    {
      "character": "Sensei",
      "text": "Honestly, you would be surprised."
    },
    {
      "character": "Rin",
      "text": "Guess I'll just have to take your word for it."
    },
    {
      "character": "Rin",
      "text": "Total's 200 yen, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Is that before or after my teacher discount?"
    },
    {
      "character": "Rin",
      "text": "Oh, sorry. My b."
    },
    {
      "character": "Rin",
      "text": "New total is 500 yen, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Wait, why did the total go up?"
    },
    {
      "character": "Rin",
      "text": "Probs cause I used my employee discount on you. But hey, if you want to feel cool and use the teacher one instead, be my guest."
    },
    {
      "character": "Sensei",
      "text": "No, I think I'm fine with being an employee for the length of this transaction. Thanks, Rin."
    },
    {
      "character": "Rin",
      "text": "I gotchoo, pal."
    },
    {
      "character": "Rin",
      "text": "Now go grab a seat and I'll bring your coffee right over."
    }
  ],
  "state_changes": {}
}