{
  "event_id": 37,
  "event_label": "mollycafe1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I decide to check out the cafe at night for once."
    },
    {
      "character": "narrator",
      "text": "I’ve known that they’re open later than just mornings for quite a while, but I guess I really haven’t had any reason to go knowing that Rin wouldn't be working."
    },
    {
      "character": "narrator",
      "text": "But hey, this is a cafe."
    },
    {
      "character": "narrator",
      "text": "I’m sure there’s bound to be another overly-perky, slightly-weird girl behind the counter no matter what."
    },
    {
      "character": "Molly",
      "text": "Greeting and salutations, Supreme Overlord!"
    },
    {
      "character": "Sensei",
      "text": "Oh, right. You work here."
    },
    {
      "character": "Molly",
      "text": "I do! Though, some of my co-workers may disagree with that statement!"
    },
    {
      "character": "Molly",
      "text": "What can I get for you today, Sir? A cappuccino? Double espresso? Or perhaps..."
    },
    {
      "character": "Molly",
      "text": "DESTRUCTION?!"
    },
    {
      "character": "Sensei",
      "text": "Yes, Molly. One order of destruction."
    },
    {
      "character": "Molly",
      "text": "Small, medium, or THE GATES OF HELL?"
    },
    {
      "character": "Sensei",
      "text": "How much coffee have you had to drink tonight?"
    },
    {
      "character": "Molly",
      "text": "I CAN’T EVEN FEEL MY HANDS ANYMORE!"
    },
    {
      "character": "narrator",
      "text": "I guess it’s not surprising that Molly works here..."
    },
    {
      "character": "narrator",
      "text": "Her and Rin seem like pretty good friends, so I’m sure that them being together all the time has something to do with that."
    },
    {
      "character": "narrator",
      "text": "Still, though...why did Haruka hire {i}Molly{/i} of all people? Isn’t she a little too...{i}everything{/i} for this place?"
    },
    {
      "character": "Sensei",
      "text": "Molly, just out of curiosity, how do you still have a job?"
    },
    {
      "character": "Molly",
      "text": "That question would be better answered by the Magistrate of Mammaries, Sir. Though, I'm sure Rin has something to do with it."
    },
    {
      "character": "Molly",
      "text": "I'm sure it helps that I only work nights now and no one has to deal with me directly anymore."
    },
    {
      "character": "Molly",
      "text": "I'm surprised to see you here so late, though. I was under the impression you only showed up in the mornings- and quite often at that!"
    },
    {
      "character": "Sensei",
      "text": "How exactly do you know about how often I come here if you don't directly work with Haruka or Rin anymore?"
    },
    {
      "character": "Molly",
      "text": "I may have mentioned something along the lines of a...contract with a new master in our group chat. Which then evolved into a conversation about you. "
    },
    {
      "character": "narrator",
      "text": "Oh, good. A private group chat where three girls I see on a near daily basis are free to gossip about me. That is exactly what I needed."
    },
    {
      "character": "Sensei",
      "text": "I'm guessing that means Haruka knows you're in my class now?"
    },
    {
      "character": "Molly",
      "text": "Well, I didn’t exactly word it like that, but yes. I believe that is the impression she got."
    },
    {
      "character": "Molly",
      "text": "Can I take this visit as an omen that you will be visiting me at night more often, Sir? "
    },
    {
      "character": "Molly",
      "text": "Not that...you can visit me in the mornings on account of the whole {i}how hard I am to handle{/i} thing."
    },
    {
      "character": "Sensei",
      "text": "To be completely honest, you don’t seem any easier to handle at night."
    },
    {
      "character": "Molly",
      "text": "You’re just not a high enough level yet, Sir."
    },
    {
      "character": "Molly",
      "text": "I can't be equipped until much later into the game."
    },
    {
      "character": "Sensei",
      "text": "Stop hinting at a future for us. I am your teacher and that is disgusting."
    },
    {
      "character": "Molly",
      "text": "I will make you mine through methods unknown to mere mortals."
    },
    {
      "character": "Sensei",
      "text": "And how do you plan on doing that, exactly?"
    },
    {
      "character": "Molly",
      "text": "Mind control, perhaps? "
    },
    {
      "character": "Molly",
      "text": "Or maybe I’ll just win you over with my feminine wiles?"
    },
    {
      "character": "Sensei",
      "text": "What wiles? You haven’t done a single {i}feminine{/i} thing since I’ve met you."
    },
    {
      "character": "Molly",
      "text": "I don’t know! Foreigners are appealing to men, aren’t they?"
    },
    {
      "character": "Molly",
      "text": "And now that we’re alone, I bet you’re thinking something like, “WOW, WHAT A CUTE GIRL” or whatever it is h-game protagonists think."
    },
    {
      "character": "Sensei",
      "text": "Not really. I'm still stuck on trying to figure out why you haven't been fired yet."
    },
    {
      "character": "Molly",
      "text": "I’m plenty good at my job!"
    },
    {
      "character": "Sensei",
      "text": "We've been talking for five minutes and you haven't even finished taking my order yet."
    },
    {
      "character": "Molly",
      "text": "I just like talking and I’m excited to see my teacher after school!"
    },
    {
      "character": "Molly",
      "text": "Ms. Watabe never came to the cafe! She always talked about how tea was better and that coffee was just hot bean water!"
    },
    {
      "character": "Molly",
      "text": "And any time I tried to tell her we had tea as well, she told me to leave her alone and that she just wanted to die!"
    },
    {
      "character": "Sensei",
      "text": "Huh. Coffee really is just hot bean water, isn't it?"
    },
    {
      "character": "Molly",
      "text": "Well...yes. I believe it is. But it’s good for other stuff too. Like when you need to stay up late....{i}studying{/i} and stuff."
    },
    {
      "character": "Sensei",
      "text": "Molly, please don’t feel the need to pretend you study around me. I might be your teacher, but it’s not like I have any intention of-"
    },
    {
      "character": "Sensei",
      "text": "Well, teaching."
    },
    {
      "character": "Molly",
      "text": "Fuck yeah!"
    },
    {
      "character": "Molly",
      "text": "Ami was right when she said you were the best [uncle] in the world!"
    },
    {
      "character": "Molly",
      "text": "Will you be my [uncle] too, Sir?"
    },
    {
      "character": "Sensei",
      "text": "I don’t think that’s possible."
    },
    {
      "character": "Molly",
      "text": "Then will you adopt me and become my new father?!"
    },
    {
      "character": "Molly",
      "text": "I’m not good at cooking or cleaning, but I’m certain I would make decent company on a rainy day!"
    },
    {
      "character": "Sensei",
      "text": "I'm not really looking to adopt right now. Nor do I think Ami would be okay with it."
    },
    {
      "character": "Sensei",
      "text": "I know you guys are in the manga club together, but she hasn’t ever really talked about you before and I doubt she views you as a sister."
    },
    {
      "character": "Molly",
      "text": "Ami hasn't talked about me before?!"
    },
    {
      "character": "Sensei",
      "text": "Is that really something to yell about?"
    },
    {
      "character": "Molly",
      "text": "Of course! Ami is a loyal member of the Cult of Molly! "
    },
    {
      "character": "Molly",
      "text": "We have plans to conquer the demon king and restore order to the forest one day!"
    },
    {
      "character": "Sensei",
      "text": "You’re really going to need to learn to talk about things I actually understand if this relationship is ever going to work out."
    },
    {
      "character": "Molly",
      "text": "Oh ho ho ho~ So you accept my contract after all?"
    },
    {
      "character": "Sensei",
      "text": "Contract? What contract?"
    },
    {
      "character": "Molly",
      "text": "You just said we’re in a relationship. "
    },
    {
      "character": "Molly",
      "text": "And even if it were a slip of the tongue, these are words that will greatly shape the rest of our time together, Supreme Overlord."
    },
    {
      "character": "Molly",
      "text": "If Molly MacCormack is to become the lead heroine of this visual novel, hearing things like “relationship” only allude to its truth!"
    },
    {
      "character": "Sensei",
      "text": "Just out of curiosity, you haven't heard anything about how much time I’ve spent with the other students, right?"
    },
    {
      "character": "Sensei",
      "text": "Because you seem pretty dead-set on this whole heroine thing and I’m not quite sure if you fully understand what you're getting yourself into."
    },
    {
      "character": "Molly",
      "text": "Oh ho ho~ You underestimate me, Sir."
    },
    {
      "character": "Molly",
      "text": "I just so happen to be an expert in the world of dating sims. "
    },
    {
      "character": "Sensei",
      "text": "But not...actual dating? Why choose to live a life like that when real humans exist?"
    },
    {
      "character": "Molly",
      "text": "You don’t choose 2D, Sir. 2D chooses you."
    },
    {
      "character": "Molly",
      "text": "But even if it didn’t, I would have wound up here eventually!"
    },
    {
      "character": "Molly",
      "text": "There’s nothing quite like watching romance flourish from textbox to textbox. H-Scene to H-Scene!"
    },
    {
      "character": "Sensei",
      "text": "Would you mind explaining to me what some of those things mean? Because I feel like I need to understand what an “H-Scene” is if I'm ever going to catch up with this conversation."
    },
    {
      "character": "Molly",
      "text": "The “H-Scene” is the holy grail of dating sims, Sir!"
    },
    {
      "character": "Molly",
      "text": "The moment where two characters consummate their love for another in the form of...{i}you know what{/i}."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You mean by throwing peanuts at each other and pretending it was an accident?"
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "Yup!"
    },
    {
      "character": "Sensei",
      "text": "So, let me get this straight-"
    },
    {
      "character": "Sensei",
      "text": "You would willingly choose a life where the only physical contact you have with anyone is done through a computer screen with a fictional character?"
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "You don’t get it at all."
    },
    {
      "character": "Molly",
      "text": "It’s not just about the physical part, Sir. "
    },
    {
      "character": "Molly",
      "text": "It’s about the emotions leading up to it! The build-up! The will-they, won’t-they!"
    },
    {
      "character": "Sensei",
      "text": "That exists in real life too, though."
    },
    {
      "character": "Molly",
      "text": "REAL LIFE IS STUPID! THERE’S NO BACKGROUND MUSIC OR TSUNDERE CHARACTERS! JUST NTR AND PREGNANCY!"
    },
    {
      "character": "Sensei",
      "text": "And what is NTR exactly?..."
    },
    {
      "character": "Molly",
      "text": "HORRIBLE! THAT’S WHAT!"
    },
    {
      "character": "narrator",
      "text": "I can feel passion and anger beginning to exude from Molly’s being, turning the cafe roughly three degrees hotter."
    },
    {
      "character": "narrator",
      "text": "And in other news, we are now roughly ten minutes into this and I still do not have a drink in my hands."
    },
    {
      "character": "Sensei",
      "text": "Uhh, Molly."
    },
    {
      "character": "Molly",
      "text": "What do you want?! I’m having a crisis and remembering a thing that happened in a game I played!"
    },
    {
      "character": "Molly",
      "text": "NTR warnings should be mandatory! Not everyone is into that! It genuinely hurts some people!"
    },
    {
      "character": "Sensei",
      "text": "Molly, I would like to order a drink now."
    },
    {
      "character": "Molly",
      "text": "Oh, right. I’m at work. "
    },
    {
      "character": "Molly",
      "text": "What would you like? It’s on me today."
    },
    {
      "character": "Sensei",
      "text": "Woah, really? Rin never offers to give me anything for free and I’ve been ordering from her for months."
    },
    {
      "character": "Molly",
      "text": "Rin is much better at her job than I am."
    },
    {
      "character": "Molly",
      "text": "It is not often I form connections with live males, so I must do everything in my power to keep this one going strong."
    },
    {
      "character": "Sensei",
      "text": "The best course of action would be for me to meet your father and inform him that my intentions are nothing but pure."
    },
    {
      "character": "Molly",
      "text": "That is fine with me, Sir!"
    },
    {
      "character": "Molly",
      "text": "I believe it is customary for me to meet {i}your{/i} parents, though."
    },
    {
      "character": "Molly",
      "text": "It would make for a heartwarming scene where I bond with your mother and cook dinner with her."
    },
    {
      "character": "Sensei",
      "text": "That sounds...great. But I honestly don’t even know if my parents are still alive."
    },
    {
      "character": "Molly",
      "text": "Oh! Shoot. I’m sorry, Sir. I didn’t mean anything by it. I just got swept up in my-"
    },
    {
      "character": "Sensei",
      "text": "It’s fine, Molly. Don’t beat yourself up over it. I really couldn’t care less, to be honest."
    },
    {
      "character": "Molly",
      "text": "But that’s so sad..."
    },
    {
      "character": "Sensei",
      "text": "Yeah, that's life for you."
    },
    {
      "character": "Sensei",
      "text": "We’re all going to die someday, so we might as well live it up while we can, right?"
    },
    {
      "character": "Molly",
      "text": "Master!"
    },
    {
      "character": "Sensei",
      "text": "...What?"
    },
    {
      "character": "Molly",
      "text": "Thank you!"
    },
    {
      "character": "Sensei",
      "text": "What’s going on? Why are you thanking me?"
    },
    {
      "character": "Molly",
      "text": "That was just the inspiration I needed to convince myself to level-cap my druid tonight!"
    },
    {
      "character": "Sensei",
      "text": "Your...what?"
    },
    {
      "character": "Molly",
      "text": "That doesn’t matter!"
    },
    {
      "character": "Molly",
      "text": "Just know that I greatly appreciate it!"
    },
    {
      "character": "Sensei",
      "text": "Okay, but can I-"
    },
    {
      "character": "Molly",
      "text": "Coffee! Yes! I will infuse it with a special buff just for you as well!"
    },
    {
      "character": "Sensei",
      "text": "I’m not really a fan of sugar-"
    },
    {
      "character": "Molly",
      "text": "ONE MOLLY-SPECIAL, COMING RIGHT UP!"
    },
    {
      "character": "narrator",
      "text": "As it turns out, it isn’t just Rin who vehemently refuses to make anything that is actually on the menu here."
    },
    {
      "character": "narrator",
      "text": "The only difference is that Rin’s custom drinks are actually fit for human consumption."
    },
    {
      "character": "narrator",
      "text": "And I’m pretty sure that whatever Molly winds up making for me contains cocaine, because I wind up walking home with my hands shaking uncontrollably after just one sip..."
    },
    {
      "character": "narrator",
      "text": "{i}Molly’s affection has increased to [molly_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "... "
    }
  ],
  "state_changes": {
    "mollycafe1": {
      "from": null,
      "to": true
    },
    "molly_love +": {
      "from": null,
      "to": 1
    }
  }
}