{
  "event_id": 50,
  "event_label": "dormwar17",
  "dialogue": [
    {
      "character": "Uta",
      "text": "Rise and shine, maggots! We might not have[school] today, and the war might be over, but don’t think for a second that means you can rest!"
    },
    {
      "character": "Makoto",
      "text": "You can rest. And you’re all free to leave as soon as our announcement is over."
    },
    {
      "character": "Makoto",
      "text": "In fact, I should probably take roll call since it looks like we’re missing a few of..."
    },
    {
      "character": "Makoto",
      "text": "Wait, why are the only girls missing from my floor?"
    },
    {
      "character": "Makoto",
      "text": "Where is Ayane? And Maya? And Yu-"
    },
    {
      "character": "Makoto",
      "text": "Well, I understand why Yumi is missing, so disregard that part please."
    },
    {
      "character": "Ami",
      "text": "Maya’s still recovering from the test of courage and Ayane wasn’t feeling well this morning."
    },
    {
      "character": "Ami",
      "text": "But I can probably get them to watch on Facetime if-"
    },
    {
      "character": "Uta",
      "text": "Facetime?! More like {i}no{/i} time! We’ve gotta get this show on the road, Ami!"
    },
    {
      "character": "Ami",
      "text": "Well...yes. I understand that. But they’re members of our team and-"
    },
    {
      "character": "Makoto",
      "text": "Just...recap them after the announcements are over, Ami. It appears that {i}certain{/i} people would like to make the most of their day off from[school]..."
    },
    {
      "character": "Uta",
      "text": "You talkin’ about me, Makoto?"
    },
    {
      "character": "Makoto",
      "text": "{i}You?{/i} Noooo. Why ever would I do that?"
    },
    {
      "character": "Uta",
      "text": "You wanna throw hands? Cause I’m ready to go right now."
    },
    {
      "character": "Makoto",
      "text": "Throw...what?"
    },
    {
      "character": "Makoto",
      "text": "Did you even sleep last night? You seem incredibly hyper for even your standards."
    },
    {
      "character": "Uta",
      "text": "Not even a little! I’m gonna spend the whole day under the covers and there ain’t anything you can do to stop me!"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "So, the results."
    },
    {
      "character": "Uta",
      "text": "Right! Results!"
    },
    {
      "character": "Uta",
      "text": "So, we had a pretty standard ten match brawl. No bonus points awarded. No secret contests. Nothing like that."
    },
    {
      "character": "Uta",
      "text": "Just good ole’ fashioned one-on-one fights for our teacher’s body!"
    },
    {
      "character": "Makoto",
      "text": "Yes, how incredibly “ole’ fashioned.”"
    },
    {
      "character": "Uta",
      "text": "Ladies and gentlemen...the results of the first ever Super Mega Ultimate Dorm War are in."
    },
    {
      "character": "Uta",
      "text": "And the winners of the event are..."
    },
    {
      "character": "Makoto",
      "text": "Wait."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "What am I waitin’ for, Makoto?"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Can I do it?"
    },
    {
      "character": "Uta",
      "text": "Forreal? We really doin’ this right now?"
    },
    {
      "character": "Nodoka",
      "text": "Perhaps just let the captain of the winning team announce the results?"
    },
    {
      "character": "Noriko",
      "text": "Yeah, that seems fair to me."
    },
    {
      "character": "Miku",
      "text": "Agreed! Let the winning team do the talkin’! They worked for it!"
    },
    {
      "character": "Uta",
      "text": "Then..."
    },
    {
      "character": "Makoto",
      "text": "In that case..."
    },
    {
      "character": "Uta",
      "text": "Floor two wins!"
    },
    {
      "character": "Uta",
      "text": "Woohoo! Good job, girls!"
    },
    {
      "character": "Makoto",
      "text": "Hah..."
    },
    {
      "character": "Makoto",
      "text": "We really should have vetted the competitions a bit better. There were several that clearly favored your floor and-"
    },
    {
      "character": "Uta",
      "text": "Yeah, yeah. Excuses, excuses. Just accept that my girls are better than your girls and call it a day, prez."
    },
    {
      "character": "Uta",
      "text": "Everybody! Y’all worked your friggin’ butts off and deserve this more than anybody I’ve ever met!"
    },
    {
      "character": "Uta",
      "text": "I am glad to be called your leader! And I, Uta Ushibori, hereby solemnly swear to be the captain for the second dorm war as well when the time comes!"
    },
    {
      "character": "Makoto",
      "text": "Wait, we’re doing this again?"
    },
    {
      "character": "Uta",
      "text": "Heck yeah we are."
    },
    {
      "character": "Uta",
      "text": "Even if we all wind up in different classes or get our rooms switched or whatever else happens in this[school], we should all agree to meet here this time next year!"
    },
    {
      "character": "Uta",
      "text": "Same teams! Same captains!"
    },
    {
      "character": "Uta",
      "text": "And probably the same champions because we’re the best and you’re stupid!"
    },
    {
      "character": "Makoto",
      "text": "There’s no need to get hostile over it."
    },
    {
      "character": "Ami",
      "text": "AAAAAAAAAAAHHHH!!!!!!!!!!!"
    },
    {
      "character": "Uta",
      "text": "You see, Makoto...we all know the dangers of letting Sensei stay in the room with us. And yet we fought for him anyway."
    },
    {
      "character": "Uta",
      "text": "Why do you think that is?"
    },
    {
      "character": "Makoto",
      "text": "Because you’re a bunch of impure lunatics?"
    },
    {
      "character": "Uta",
      "text": "Because {i}we{/i} like him more than you guys. So ha."
    },
    {
      "character": "Makoto",
      "text": "I can guarantee you that is absolutely not the-"
    },
    {
      "character": "Uta",
      "text": "Results beg to differ, Makoto. So why don’t you go take a hike or start practicin’ for next year or something?"
    },
    {
      "character": "Uta",
      "text": "You're obviously gonna need it."
    },
    {
      "character": "Makoto",
      "text": "You’ll regret this, {i}Uta...{/i}"
    },
    {
      "character": "Uta",
      "text": "We’ll see about that, {i}Makoto...{/i}"
    },
    {
      "character": "Uta & Makoto",
      "text": "Both teams win!"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "So..."
    },
    {
      "character": "Noriko",
      "text": "What now?"
    },
    {
      "character": "Miku",
      "text": "The heck are we gonna do to solve this?!"
    },
    {
      "character": "Miku",
      "text": "You sayin' we have to do the whole dorm war over?!"
    },
    {
      "character": "Kirin",
      "text": "Are we...all sleeping in the same room now?"
    },
    {
      "character": "Tsuneyo",
      "text": "Twenty girls and one man in the same room seems-"
    },
    {
      "character": "Kirin",
      "text": "Fun? Agreed."
    },
    {
      "character": "Uta",
      "text": "Makoto and I will both admit that we never saw this coming!"
    },
    {
      "character": "Makoto",
      "text": "I mean, it was an obvious possibility given that we had ten separate contests...so I wouldn’t say that I believed it was {i}impossible.{/i}"
    },
    {
      "character": "Uta",
      "text": "Blah blah blah math stuff."
    },
    {
      "character": "Uta",
      "text": "Point is, we’re gonna have to have some sort of tiebreaker."
    },
    {
      "character": "Uta",
      "text": "So Makoto and I are gonna arm wrestle and-"
    },
    {
      "character": "Makoto",
      "text": "We are not."
    },
    {
      "character": "Makoto",
      "text": "We’re probably just going to have Sensei personally choose the team that he believed performed the best overall."
    },
    {
      "character": "Uta",
      "text": "You sure? Cause I think the arm wrestling thing is a lot more exciting."
    },
    {
      "character": "Makoto",
      "text": "I mean...what else would you suggest we do? Have another competition that would only exist as the result of a tie?"
    },
    {
      "character": "Molly",
      "text": "Absolutely not!"
    },
    {
      "character": "Molly",
      "text": "If you lock an entirely new event behind such a specific set of circumstances, there are going to be thousands of entitled players who will complain about it!"
    },
    {
      "character": "Molly",
      "text": "It is our job as visual novel heroines to prevent this from happening at all costs because God forbid anyone misses one friggin’ scene in a game longer than life itself!"
    },
    {
      "character": "Nodoka",
      "text": "But Molly, by that logic, wouldn’t even this outburst of yours constitute such a thing?"
    },
    {
      "character": "Nodoka",
      "text": "Surely there are dimensions out there where we didn’t tie and this conversation never even happened."
    },
    {
      "character": "Molly",
      "text": "Of course! And there are hundreds of other examples of our dialogue changing as a result of our actions as well, and no one complains about them because they feel natural and are not advertised!"
    },
    {
      "character": "Molly",
      "text": "It’s almost like some developers factor in replayability or player influence into their products when what we {i}really{/i} want is a streamlined experience that feels bland, impersonal, and fragmented!"
    },
    {
      "character": "Sana",
      "text": "Um...may I...weigh in?"
    },
    {
      "character": "Nodoka",
      "text": "Of course, Sana. Feel free. This is an open forum after all."
    },
    {
      "character": "Sana",
      "text": "I...I think that...players should just accept that...visual novels are meant to be...personal experiences where...where decisions feel important..."
    },
    {
      "character": "Sana",
      "text": "And...and I wouldn’t really care about...things happening differently because...because it just means I made them that way..."
    },
    {
      "character": "Molly",
      "text": "But, Sana! What about the {i}completionists?!{/i}"
    },
    {
      "character": "Molly",
      "text": "Are you suggesting that we upset a very small demographic of overly vocal players because we want things to make {i}sense?{/i} That is absurd!"
    },
    {
      "character": "Uta",
      "text": "How about we just all agree that anyone immature enough to complain about such a thing should be focusing on improving themselves rather than crying about a video game?"
    },
    {
      "character": "Makoto",
      "text": "Well said, Uta. It’s not like the majority of those players are contributing to the game’s development anyway."
    },
    {
      "character": "Uta",
      "text": "Right! So they should just trust in the creator! Because if anyone knows what a game is supposed to be, it’s the person making it."
    },
    {
      "character": "Makoto",
      "text": "Agreed on all counts."
    },
    {
      "character": "Uta",
      "text": "So fuck you if you are that person!"
    },
    {
      "character": "Makoto",
      "text": "Yeah. Now go get a real girlfriend or something and stop getting so offended when cartoon girls don’t do exactly what you want them to do."
    },
    {
      "character": "Uta",
      "text": "Yeah, nerd!"
    },
    {
      "character": "Makoto",
      "text": "Uta, do you know what I just realized?"
    },
    {
      "character": "Uta",
      "text": "What’s that, Makoto?"
    },
    {
      "character": "Makoto",
      "text": "That somewhere out there, there’s going to be someone who has no idea what we’re talking about feeling very confused right now."
    },
    {
      "character": "Uta",
      "text": "Oh, jeez. You’re right. They’re probably just tryin’ to get on with their day and choose a winner or something and we’re gettin’ all preachy!"
    },
    {
      "character": "Makoto",
      "text": "True. But chances are they pirated the game anyway so they can fuck right off."
    },
    {
      "character": "Tsuneyo",
      "text": "Did someone say pirate?"
    },
    {
      "character": "Makoto",
      "text": "Oh well. It is what it is, I suppose."
    },
    {
      "character": "Makoto",
      "text": "The fact is that it’s never possible to please everyone, so you should follow your heart and do what you think is best, even if you know it’s going to make some people mad."
    },
    {
      "character": "Uta",
      "text": "Unless that decision involves literally hurting people, which is something you should never do!"
    },
    {
      "character": "Makoto",
      "text": "That’s right."
    },
    {
      "character": "Makoto",
      "text": "Be kind, drive responsibly, stay hydrated, and all of that other positive advice people normally give out to rid themselves of responsibility for the actions of those who can not think for themselves."
    },
    {
      "character": "Uta",
      "text": "Amen!"
    },
    {
      "character": "Makoto",
      "text": "Amen."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Okay, but...who wins?"
    },
    {
      "character": "Uta",
      "text": "I guess we’ll find out when the time comes to sleep over at the beach!"
    },
    {
      "character": "Makoto",
      "text": "For now, though...let’s just all be happy that we’re together. And that we’re all winners in at least that respect."
    },
    {
      "character": "Uta",
      "text": "Right!"
    },
    {
      "character": "Uta",
      "text": "Except for Molly!"
    },
    {
      "character": "Molly",
      "text": "STOP DOING THAT, DAMN IT!"
    },
    {
      "character": "narrator",
      "text": "I catch up with the girls shortly after the winning floor is announced and breathe a sigh of relief knowing that this has finally come to an end."
    },
    {
      "character": "narrator",
      "text": "Don’t get me wrong, it’s great watching a bunch of cute girls fight over you, but it’s {i}not{/i} great not having any time to myself to actually...act as I please and whatnot."
    },
    {
      "character": "narrator",
      "text": "I suppose that doesn’t matter right now, though."
    },
    {
      "character": "narrator",
      "text": "I still have the rest of Monday off to do whatever I want and..."
    },
    {
      "character": "narrator",
      "text": "And I guess that means I’ll just...kick things off with more of the same."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Morning, Io."
    },
    {
      "character": "Io",
      "text": "Morning, Sensei."
    },
    {
      "character": "Io",
      "text": "My team won, in case you were wondering."
    },
    {
      "character": "Io",
      "text": "No thanks to me, obviously."
    },
    {
      "character": "Sensei",
      "text": "Doesn’t really matter if you were involved as long as you won."
    },
    {
      "character": "Sensei",
      "text": "Looks like we’ll be staying in the same room for the beach trip, I guess."
    },
    {
      "character": "Io",
      "text": "I’m probably not going to go. It doesn’t really sound like my sort of thing."
    },
    {
      "character": "Sensei",
      "text": "Oh."
    },
    {
      "character": "Sensei",
      "text": "Well, yeah. I guess that makes sense, then."
    },
    {
      "character": "Sensei",
      "text": "Maybe we can do something on our own soon, then?"
    },
    {
      "character": "Io",
      "text": "Just us? You’re not inviting your girlfriend?"
    },
    {
      "character": "Sensei",
      "text": "Io-"
    },
    {
      "character": "Io",
      "text": "I’m joking, sorry."
    },
    {
      "character": "Io",
      "text": "Yeah...I’d be really happy to see you more, if that’s okay with you."
    },
    {
      "character": "Io",
      "text": "And...sorry for sneaking in again. I wasn’t really thinking of how much trouble that could cause you when I did it."
    },
    {
      "character": "Io",
      "text": "I swear to never tell another hotel employee that you’re my father ever again."
    },
    {
      "character": "Sensei",
      "text": "Thank you for making such a strange and specific promise to me. I really appreciate it."
    },
    {
      "character": "Io",
      "text": "My floor lost, in case you were wondering."
    },
    {
      "character": "Io",
      "text": "Also, looks like Yuki’s daughter was able to “cooperate” before I was."
    },
    {
      "character": "Io",
      "text": "No surprise there, of course."
    },
    {
      "character": "Sensei",
      "text": "You should have come to the bar last night. It was..."
    },
    {
      "character": "Sensei",
      "text": "Well, I don’t want to say {i}fun.{/i} But it was certainly interesting."
    },
    {
      "character": "Io",
      "text": "I can’t even function around girls in[school]. You really think I’d be better in a party setting where they’re all trying to talk to me and get me to “come out of my shell?”"
    },
    {
      "character": "Sensei",
      "text": "No. But I would have accepted if you wanted to follow me around and cling to my sleeve or something."
    },
    {
      "character": "Io",
      "text": "Yeah, I’m sure your “girlfriend” would have loved that."
    },
    {
      "character": "Sensei",
      "text": "Io-"
    },
    {
      "character": "Io",
      "text": "A joke, obviously."
    },
    {
      "character": "Io",
      "text": "Though, I do think you should probably hurry up and toss her aside or she’ll just wind up going crazy and stalking you when you finally {i}do{/i} break up."
    },
    {
      "character": "Sensei",
      "text": "She’s actually a really nice girl, Io."
    },
    {
      "character": "Io",
      "text": "And I’m not?"
    },
    {
      "character": "Sensei",
      "text": "Sure. You’re nice too."
    },
    {
      "character": "Io",
      "text": "Well now you’re just lying to me. We all know that isn’t true."
    },
    {
      "character": "Sensei",
      "text": "Okay, fine. You’re not nice to other girls. But you’re nice to me and that’s pretty much all that matters in my book."
    },
    {
      "character": "Io",
      "text": "Unless I start belittling them and you have to scold me for it."
    },
    {
      "character": "Io",
      "text": "You’re really striking out this morning, Sensei."
    },
    {
      "character": "Uta",
      "text": "Io! Are you finally going to stop avoiding me now that the dorm war is over?!"
    },
    {
      "character": "Io",
      "text": "Yes. I am finally going to stop avoiding you now that the dorm war is over."
    },
    {
      "character": "Io",
      "text": "Did you have fun?"
    },
    {
      "character": "Uta",
      "text": "I had a lot of fun! But I would have had {i}more{/i} fun if you were there!"
    },
    {
      "character": "Io",
      "text": "I {i}was{/i} there. I just wasn’t really doing anything."
    },
    {
      "character": "Uta",
      "text": "That’s exactly the problem..."
    },
    {
      "character": "Uta",
      "text": "I wanted to do something fun with you..."
    },
    {
      "character": "Io",
      "text": "Then let’s do something fun now."
    },
    {
      "character": "Io",
      "text": "My aunt is working today, so I don’t have to hang out at the bathhouse."
    },
    {
      "character": "Io",
      "text": "I’m also really hungry, soooooo..."
    },
    {
      "character": "Io",
      "text": "Maybe Sensei might want to come with us and finally get breakfast with me?"
    },
    {
      "character": "Sensei",
      "text": "You’re not going to drag me to an amusement park afterward, are you?"
    },
    {
      "character": "Uta",
      "text": "I’m not tall enough to ride most of the rides, but I can hold your stuff and watch if you guys want to go on the adult ones."
    },
    {
      "character": "Sensei",
      "text": "We’re not going to the amusement park, Uta."
    },
    {
      "character": "Io",
      "text": "Sensei hates rollercoasters."
    },
    {
      "character": "Sensei",
      "text": "I like food, though. So, sure. I’ll come get breakfast with you."
    },
    {
      "character": "Sensei",
      "text": "After that, I’m going back home to take a nap, though."
    },
    {
      "character": "Sensei",
      "text": "It’s surprisingly draining having to judge a series of strange [high_school] competitions."
    },
    {
      "character": "Io",
      "text": "You’re really starting to sound old, Sensei."
    },
    {
      "character": "Uta",
      "text": "Come on, grandpa. It’s time for your chemo."
    },
    {
      "character": "Sensei",
      "text": "Uta, please stop saying things like that..."
    },
    {
      "character": "narrator",
      "text": "We manage to slip away from the gathering without anyone else seeing us and head over to some random diner none of us had been to before."
    },
    {
      "character": "narrator",
      "text": "Everything there was exceedingly average, but it was still an enjoyable outing regardless."
    },
    {
      "character": "narrator",
      "text": "Sure, Uta talked way more than anyone should ever talk...but it complemented the type of person both Io and myself are."
    },
    {
      "character": "narrator",
      "text": "And weirdly enough, all of it felt completely natural."
    },
    {
      "character": "narrator",
      "text": "The two of them make a strange combo, but the fact that they’re able to get over things like Io constantly disappearing and avoiding Uta as if it’s routine really shows a lot about their friendship."
    },
    {
      "character": "narrator",
      "text": "Or what I imagine their friendship to be."
    },
    {
      "character": "narrator",
      "text": "I’m sure things are a lot more complicated than that."
    },
    {
      "character": "narrator",
      "text": "But I guess that’s something I’ll learn in time."
    },
    {
      "character": "narrator",
      "text": "For now-"
    },
    {
      "character": "narrator",
      "text": "I’m just glad I can finally relax."
    },
    {
      "character": "narrator",
      "text": "I walk into the bedroom and instinctively search for the air conditioner I’d grown used to over the last two nights."
    },
    {
      "character": "narrator",
      "text": "It’s not there."
    },
    {
      "character": "narrator",
      "text": "I go to sleep warm."
    },
    {
      "character": "narrator",
      "text": "{i}Congratulations on completing the first ever Super Mega Ultimate Dorm War!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}As soon as you wake up, everything will go back to normal and you’ll be able to act on your own again.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Thank you for surrendering two days of your seemingly infinite time in Kumon-mi.{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I wake up just as the sun begins to set."
    },
    {
      "character": "narrator",
      "text": "What do I want to do with the rest of my day?"
    }
  ],
  "state_changes": {
    "dormwarfloor2win": {
      "from": null,
      "to": true
    },
    "dormwartie": {
      "from": null,
      "to": true
    },
    "dormwar17": {
      "from": null,
      "to": true
    }
  }
}