{
  "event_id": 76,
  "event_label": "utafirsthall",
  "dialogue": [
    {
      "character": "Uta",
      "text": "Hey! What are you up to, Sensei?"
    },
    {
      "character": "Uta",
      "text": "Come to hang out with one of your six million girlfriends?"
    },
    {
      "character": "Sensei",
      "text": "All of them at once, actually. And what better place to do that than the dorms?"
    },
    {
      "character": "Uta",
      "text": "Hmmm...School, if you can be sneaky enough."
    },
    {
      "character": "Uta",
      "text": "That way, you could even rope some of the other classes into it. You can thank me later for the brilliant idea."
    },
    {
      "character": "Sensei",
      "text": "I might just have to do that."
    },
    {
      "character": "Sensei",
      "text": "What are {i}you{/i} up to, Uta?"
    },
    {
      "character": "Uta",
      "text": "Me? Was just stopping for a quick drink of water on my way out to do some exploring."
    },
    {
      "character": "Sensei",
      "text": "Right. You’re still getting acquainted with the area, aren’t you?"
    },
    {
      "character": "Uta",
      "text": "Slowly but surely. It’s not as confusing as the area I was living in before this."
    },
    {
      "character": "Uta",
      "text": "Over there, since the[school] was {i}in{/i} the actual city part, we didn’t get those cool stretches of nothingness like you have over here."
    },
    {
      "character": "Uta",
      "text": "Reminds me a lot of Nara but with less wildlife and more...tamed life."
    },
    {
      "character": "Sensei",
      "text": "Is that a good or bad thing? I don’t think I’ve really asked you how you feel about this place other than the class itself."
    },
    {
      "character": "Uta",
      "text": "It’s not...bad?"
    },
    {
      "character": "Uta",
      "text": "Like yeah the class is awesome and I’m glad to finally have a teacher who doesn’t creep me out-"
    },
    {
      "character": "Sensei",
      "text": "Wait, what? Your other teachers creeped you out but I somehow don’t?"
    },
    {
      "character": "Uta",
      "text": "Oh, totally. They kept trying to steal my stuff when I wasn't looking."
    },
    {
      "character": "Sensei",
      "text": "You should report that to the principal."
    },
    {
      "character": "Uta",
      "text": "Probably. You’ve been fun so far, though. "
    },
    {
      "character": "Uta",
      "text": "As far as Kumon-mi itself goes, it’s not what I’d call my ideal place to live...but it’s not like I’m dying to get out just yet."
    },
    {
      "character": "Sensei",
      "text": "What would your ideal place to live be, then?"
    },
    {
      "character": "Uta",
      "text": "Well, even though it can get kind of boring over there at times, I think I {i}do{/i} prefer the country overall."
    },
    {
      "character": "Uta",
      "text": "Places like this kinda lose their luster once you realize you can just do anything you want whenever you want."
    },
    {
      "character": "Uta",
      "text": "It turns stuff I always viewed as super-special outings into another way of life. "
    },
    {
      "character": "Uta",
      "text": "But, it’s definitely easier finding work over here. Not a lot of maid cafes where I’m from."
    },
    {
      "character": "Uta",
      "text": "And also not a lot of teachers willing to just let us girls teach ourselves. So, thanks!"
    },
    {
      "character": "narrator",
      "text": "Interesting."
    },
    {
      "character": "narrator",
      "text": "I don’t think I’d particularly enjoy living in the country."
    },
    {
      "character": "narrator",
      "text": "But it’s not like Uta and I need to agree on everything in order to become better acquainted."
    },
    {
      "character": "narrator",
      "text": "I understand why she’d want to be somewhere closer to what she’s grown used to over the course of her life."
    },
    {
      "character": "narrator",
      "text": "Thankfully, I have the advantage (Or disadvantage, depending on how you look at it) of not remembering anything about my childhood-"
    },
    {
      "character": "narrator",
      "text": "So somewhere like Kumon-mi is perfect for me."
    },
    {
      "character": "Sensei",
      "text": "No need to thank me for being bad at my job. I do that willingly."
    },
    {
      "character": "Uta",
      "text": "Hey! Don’t call yourself bad!"
    },
    {
      "character": "Uta",
      "text": "I’m tryin’ to be serious here, Sensei. I think you’re great."
    },
    {
      "character": "Uta",
      "text": "Even Io has started feeling at home here and I don’t think she even looks at the bathhouse that way."
    },
    {
      "character": "Uta",
      "text": "Plus, I think it’s cool that you’re allowed to come to the dorms and talk to us. "
    },
    {
      "character": "Uta",
      "text": "I feel more inclined to learn if I’m closer to whoever’s teaching me."
    },
    {
      "character": "Sensei",
      "text": "Is that code for “Let’s get even closer, Sensei?”"
    },
    {
      "character": "Uta",
      "text": "Ohohoh~ It's starting to sound like {i}somebody{/i} wants to hug."
    },
    {
      "character": "Sensei",
      "text": "That person is me. But I think it still might be too soon."
    },
    {
      "character": "Uta",
      "text": "I shall pay closer attention to how much I am supposed to dislike you and will ignore the wonderful chemistry we have begun to form with each other."
    },
    {
      "character": "Sensei",
      "text": "I am sorry things had to end like this."
    },
    {
      "character": "Uta",
      "text": "I understand, Sensei. Things {i}needed{/i} to happen this way before they became too serious and one of us wound up with a broken heart."
    },
    {
      "character": "Uta",
      "text": "Probably me because I get attached too easily and would never leave you since I’m so nice."
    },
    {
      "character": "Sensei",
      "text": "I’ve changed my mind. I love you."
    },
    {
      "character": "Uta",
      "text": "I remember...when I loved you..."
    },
    {
      "character": "Uta",
      "text": "It feels so long ago now..."
    },
    {
      "character": "Uta",
      "text": "Goodbye...Sensei..."
    },
    {
      "character": "narrator",
      "text": "Uta smiles and walks right past me, closing her eyes and sighing to herself as she forever disappears from my life."
    },
    {
      "character": "narrator",
      "text": "The days we shared with one another were brief, but they will echo in the back of my mind for as long as I live."
    },
    {
      "character": "narrator",
      "text": "I will never forget you, Uta Ushibori."
    },
    {
      "character": "narrator",
      "text": "May you find happiness wherever the cold wind takes you."
    },
    {
      "character": "narrator",
      "text": "{i}Uta’s affection has increased to [uta_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "uta_love +": {
      "from": null,
      "to": 1
    },
    "utafirsthall": {
      "from": null,
      "to": true
    }
  }
}