{
  "event_id": 82,
  "event_label": "toukafirsthall",
  "dialogue": [
    {
      "character": "Touka",
      "text": "Good evening, Sensei. Do you have some sort of business in the girls’ dorm?"
    },
    {
      "character": "Sensei",
      "text": "Hey. Nope. I’m just here to hang out."
    },
    {
      "character": "Touka",
      "text": "Hang out? Forgive me if I’m misunderstanding the full meaning of this popular common phrase, but wouldn’t that imply you are here for the express purpose of being around [young_girls]?"
    },
    {
      "character": "Sensei",
      "text": "Yes. It would."
    },
    {
      "character": "Touka",
      "text": "I see."
    },
    {
      "character": "Touka",
      "text": "And forgive me if I am misunderstanding even more, but wouldn’t that imply that you have some rather unfavorable affinities for a man of your age?"
    },
    {
      "character": "Sensei",
      "text": "No. I just like hugs."
    },
    {
      "character": "Touka",
      "text": "I see."
    },
    {
      "character": "Sensei",
      "text": "You’ll get used to it. I'm sure it will feel totally normal in no time at all."
    },
    {
      "character": "Touka",
      "text": "I..."
    },
    {
      "character": "Touka",
      "text": "I don’t think that it will."
    },
    {
      "character": "Sensei",
      "text": "Either way, what are you up to tonight?"
    },
    {
      "character": "Touka",
      "text": "Well, I suppose I’m trying to understand exactly what I’m supposed to be doing here."
    },
    {
      "character": "Touka",
      "text": "It isn’t often that I have entire nights to myself and, somehow or another, I found myself feeling compelled to stand out in the hallway."
    },
    {
      "character": "Touka",
      "text": "Part of me wants to try greeting the dejected looking girl slouched up against the wall, but she does not seem to want to be bothered."
    },
    {
      "character": "Sensei",
      "text": "I can tell you with absolute certainty that she definitely does not."
    },
    {
      "character": "Sensei",
      "text": "But on the bright side, you have me now. And I am extremely exciting and only mildly suspicious."
    },
    {
      "character": "Touka",
      "text": "That sounds a lot like something a suspicious person would say."
    },
    {
      "character": "Sensei",
      "text": "I don’t think so. A really suspicious person probably wouldn’t say anything. "
    },
    {
      "character": "Sensei",
      "text": "They’d just stand there and stare at you, probably from around a corner or something."
    },
    {
      "character": "Touka",
      "text": "How bold of you to not utilize a corner at all and instead approach me with your suspicious behavior directly!"
    },
    {
      "character": "Touka",
      "text": "You are truly a man to be feared!"
    },
    {
      "character": "Sensei",
      "text": "Again, you’ll get used to it and it will feel totally normal in no time at all."
    },
    {
      "character": "Touka",
      "text": "I somehow find the second utterance of that sentence even more disturbing than the first."
    },
    {
      "character": "Touka",
      "text": "So...go on. Out with it. What do you want or need from me tonight?"
    },
    {
      "character": "Sensei",
      "text": "I already told you, I’m just here to hang out. I’m going to do that from time to time now that you live here."
    },
    {
      "character": "Touka",
      "text": "I understand that, but isn’t there some sort of objective you have in mind?"
    },
    {
      "character": "Sensei",
      "text": "I mean, absolutely. But there is no way you are anywhere near ready for what that objective is."
    },
    {
      "character": "Touka",
      "text": "Well, now I’m rather curious. Can you not explain it?"
    },
    {
      "character": "Sensei",
      "text": "Not without putting our future relationship in jeopardy. "
    },
    {
      "character": "Touka",
      "text": "I understand. If it will have some sort of effect on my time in both the dorms and [kumon_mi_high], I’d rather keep it at bay for the time being."
    },
    {
      "character": "Touka",
      "text": "It’s hard enough getting adjusted to life in a place like this."
    },
    {
      "character": "Sensei",
      "text": "Yeah, I imagine this is basically the exact opposite of what you’re used to."
    },
    {
      "character": "Touka",
      "text": "I actually find it both endearing and mildly upsetting how so many girls are able to fit under one roof."
    },
    {
      "character": "Touka",
      "text": "I’ve yet to see the inside of anyone else’s room, but mine seems rather...small for two people."
    },
    {
      "character": "Sensei",
      "text": "They’re all the same size. "
    },
    {
      "character": "Touka",
      "text": "And they expect us to live happily under these excruciatingly packed conditions?"
    },
    {
      "character": "Sensei",
      "text": "Well, I don’t know if I’d say {i}happily,{/i} but yeah. "
    },
    {
      "character": "Sensei",
      "text": "I guess it’s a lot easier if you don’t already have a bedroom that’s the size of this entire floor."
    },
    {
      "character": "Touka",
      "text": "Yes, I do suppose that having exactly that may be skewing my judgement in some way."
    },
    {
      "character": "Sensei",
      "text": "Hold on a second...I was being sarcastic."
    },
    {
      "character": "Sensei",
      "text": "You mean to tell me your bedroom is the size of this entire floor?"
    },
    {
      "character": "Touka",
      "text": "My first bedroom, absolutely. But my second and third are probably around the size of about...half?"
    },
    {
      "character": "Sensei",
      "text": "What use could you have for three bedrooms?"
    },
    {
      "character": "Touka",
      "text": "Well, my first bedroom is where I keep all of my clothes and my...personal belongings. And the other two-"
    },
    {
      "character": "Sensei",
      "text": "Why would you say “personal belongings” after a pause like that? That just makes it sound like you’re hiding something inappropriate."
    },
    {
      "character": "Touka",
      "text": "Th-That’s not what I meant at all! I just have several things that you would likely make fun of me for owning, so I would rather not disclose them at this point in time!"
    },
    {
      "character": "Sensei",
      "text": "That’s fine. I’m sure I’ll see whatever it is you’re hiding when I come over for that tea you promised me before."
    },
    {
      "character": "Touka",
      "text": "Absolutely not! As if I’d let {i}you{/i} of all people into my first bedroom!"
    },
    {
      "character": "Sensei",
      "text": "That’s fine. It will just make finding out what you’re hiding from me all the more exciting when I finally get to see your “manor.”"
    },
    {
      "character": "Touka",
      "text": "You will do nothing of the sort! My first bedroom is still years and years away from accepting someone of the likes of you!"
    },
    {
      "character": "Sensei",
      "text": "What about the second and third bedrooms, then?"
    },
    {
      "character": "Touka",
      "text": "Well...those are certainly closer to being within your reach than the first. But it would still be remarkably strange."
    },
    {
      "character": "Touka",
      "text": "I don’t think we’ve ever allowed anyone like you into the manor before, so we’d likely need to make special preparations of some sort."
    },
    {
      "character": "Sensei",
      "text": "What sort of special preparations do you think “someone like me” would need, exactly?"
    },
    {
      "character": "Touka",
      "text": "Well, it’s...easy to get lost if you don’t understand where you’re going. So you would likely need a tour guide and-"
    },
    {
      "character": "Sensei",
      "text": "You realize you could just show me around yourself, right?"
    },
    {
      "character": "Touka",
      "text": "Well...I would not mind that at all. But I feel as if my father and the house staff would be quite disappointed if they found me doing a job like that."
    },
    {
      "character": "Sensei",
      "text": "Doing a job like that as opposed to?..."
    },
    {
      "character": "Touka",
      "text": "Studying to perfect both my academic and social skills."
    },
    {
      "character": "Touka",
      "text": "You know, those things I relocated to this side of the city to pursue only to be derailed by a rogue teacher."
    },
    {
      "character": "Sensei",
      "text": "Hey, that’s me. I’m the rogue teacher."
    },
    {
      "character": "Touka",
      "text": "Yes. Yes you are."
    },
    {
      "character": "Touka",
      "text": "I do hope you’re proud of yourself, as you have somehow managed to make my otherwise simple and peaceful life into something out of a Saturday morning cartoon. "
    },
    {
      "character": "Sensei",
      "text": "I’m surprised a girl of your “status” even knows what Saturday morning cartoons are."
    },
    {
      "character": "Touka",
      "text": "Did I say...cartoon?! I meant Saturday morning...golf program! "
    },
    {
      "character": "Touka",
      "text": "Those morning golfers...always causing a commotion for the...afternoon ones..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Touka",
      "text": "..."
    },
    {
      "character": "Touka",
      "text": "OKAY! GOODNIGHT!"
    },
    {
      "character": "Sensei",
      "text": "Oh, come on. There’s no need to be embarrassed about not being seen as a proper lady for a minute or two."
    },
    {
      "character": "Touka",
      "text": "What in Heaven’s name are you saying, Sensei? Do you not realize who I am?"
    },
    {
      "character": "Sensei",
      "text": "Of course I do, Tadako."
    },
    {
      "character": "Touka",
      "text": "Touka! Heir to the Tsukioka family’s fortune!"
    },
    {
      "character": "Touka",
      "text": "I can not risk losing yet another teacher due to my inability to maintain my composure and-"
    },
    {
      "character": "Sensei",
      "text": "Yet another?"
    },
    {
      "character": "Touka",
      "text": "I...uhh..."
    },
    {
      "character": "Touka",
      "text": "{i}Hah...{/i}"
    },
    {
      "character": "Touka",
      "text": "How is it that you’re able to set me off so easily with nothing more than immature teasing?"
    },
    {
      "character": "Sensei",
      "text": "Hold on, I’m curious about this apparent history of “losing teachers.”"
    },
    {
      "character": "Touka",
      "text": "Improper phrasing and spontaneous sentimentality. Please do not think much of it."
    },
    {
      "character": "Touka",
      "text": "I apologize for my sudden departure, but I just realized that I still have matters to attend to tonight."
    },
    {
      "character": "Touka",
      "text": "But...if you’d still like to show me a little more about how things work on the outside world as we suggested before, you can always find me out and about early on the weekends."
    },
    {
      "character": "Sensei",
      "text": "Sudden matters like what, exactly?"
    },
    {
      "character": "Touka",
      "text": "Matters you need not concern yourself with as they do not have anything to do with you, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Hold on, I-"
    },
    {
      "character": "Touka",
      "text": "I sincerely apologize, but I really can not talk any longer. "
    },
    {
      "character": "Touka",
      "text": "Goodnight, Sensei. Please do be careful on the way home. It is rather dark outside right now."
    },
    {
      "character": "narrator",
      "text": "Touka disappears into her room and I’m left scratching my head in the hallway."
    },
    {
      "character": "narrator",
      "text": "Io looks up at me from her spot on the floor and, without saying much of anything, exchanges a glance that essentially asks, “Why are you talking to {i}her{/i} of all people?”"
    },
    {
      "character": "narrator",
      "text": "I shrug it off and ultimately hang out with Io instead for the next few minutes before finally deciding to head home."
    },
    {
      "character": "narrator",
      "text": "I wonder what it is, if anything, that Touka so urgently needed to do tonight?"
    },
    {
      "character": "narrator",
      "text": "{i}Touka’s affection has increased to [touka_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "toukafirsthall": {
      "from": null,
      "to": true
    }
  }
}