{
  "event_id": 88,
  "event_label": "yumifirsthall",
  "dialogue": [
    {
      "character": "Sensei",
      "text": "Hey Yumi. What are you up to?"
    },
    {
      "character": "Yumi",
      "text": "Oh, fuck no. Don't just walk up to me in the hall of the {i}girls'{/i} dorm and act like you fuckin' own the place."
    },
    {
      "character": "Sensei",
      "text": "All I did was say hi."
    },
    {
      "character": "Yumi",
      "text": "Which is a billion times more than you're allowed to say, douchenozzle."
    },
    {
      "character": "Yumi",
      "text": "There is absolutely no fucking way you are allowed over here. I don't believe it for even a second."
    },
    {
      "character": "Yumi",
      "text": "Who's on the hit list today? Class prez? Fat-aba?"
    },
    {
      "character": "Sensei",
      "text": "I was actually kind of hoping the two of us could hang out."
    },
    {
      "character": "Yumi",
      "text": "And I was actually kind of hoping I'd be able to stand in the hall of the building I fucking {i}live{/i} in without worrying about some predator trying to sneak into my room."
    },
    {
      "character": "Yumi",
      "text": "Get the fuck out of here. Now."
    },
    {
      "character": "Sensei",
      "text": "I'm starting to think you don't want to be around me tonight."
    },
    {
      "character": "Yumi",
      "text": "Oh my fucking God. It's like talking to a brick wall- just the brick wall has a micropenis that gets hard every time it sees a pair of tits."
    },
    {
      "character": "Sensei",
      "text": "Your analogy game needs some work, Yumi."
    },
    {
      "character": "Yumi",
      "text": "My {i}what?{/i} This that new teaching strategy I've been hearin' about?"
    },
    {
      "character": "Yumi",
      "text": "You coming to our rooms to lecture us now since you're too busy sniffing our fucking gym clothes in the locker room during school hours."
    },
    {
      "character": "Sensei",
      "text": "To my dismay and your fortune, I can assure you here and now that I don't have access to that room."
    },
    {
      "character": "Yumi",
      "text": "Finally, some good fucking news."
    },
    {
      "character": "Sensei",
      "text": "So, what do you want to do? Go for a walk? Give me a tour of your dorm room?"
    },
    {
      "character": "Yumi",
      "text": "You mean right now? I don't know. Blowin' my brains out sounds pretty fuckin' appealing."
    },
    {
      "character": "Sensei",
      "text": "We're not hanging out tonight, are we?"
    },
    {
      "character": "Yumi",
      "text": "Of fucking course not! Now get the hell out of here and never come back!"
    },
    {
      "character": "narrator",
      "text": "Yumi disappears into her dorm room, which I don't really blame her for since I definitely {i}shouldn't{/i} be here."
    },
    {
      "character": "narrator",
      "text": "But hey, if no one is going to stop me, I'm going to keep on coming."
    },
    {
      "character": "narrator",
      "text": "It's not like there's much else to do at night anyway."
    },
    {
      "character": "narrator",
      "text": "For now, though, I guess I'll head back home."
    },
    {
      "character": "narrator",
      "text": "Yumi can only avoid me for so long..."
    },
    {
      "character": "narrator",
      "text": "{i}Yumi’s affection has somehow increased to [yumi_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "yumifirsthall": {
      "from": null,
      "to": true
    }
  }
}