{
  "event_id": 94,
  "event_label": "mikufirsthall",
  "dialogue": [
    {
      "character": "Miku",
      "text": "Sensei?! The heck are you doin' over here? You get a day pass to come hang out with us girls in the dorm or somethin'?"
    },
    {
      "character": "Sensei",
      "text": "Nope. Just abusing my power as the lone male authority figure at school and hanging out in places I probably shouldn't be allowed in."
    },
    {
      "character": "Miku",
      "text": "Well, as long as ya don't start sneakin' into the locker room, you're still A-Okay in my book!"
    },
    {
      "character": "Miku",
      "text": "Not sure what kinda fun you're expectin' to have in a place like this, though. All the {i}real{/i} action is goin' on behind closed doors."
    },
    {
      "character": "Sensei",
      "text": "I kind of need to go through the halls in order to get into any of the rooms, but I'll keep your advice in mind, Miku."
    },
    {
      "character": "Miku",
      "text": "Wait, how come you're talkin' to me, though? The girl with the biggest knockers in school is right behind ya. Probably knows more about {i}action{/i} than me, too."
    },
    {
      "character": "Sensei",
      "text": "Who knows? Maybe I just have a thing for tomboys."
    },
    {
      "character": "Miku",
      "text": "It ain't nice playin' with a girl's heart like that, Sensei. Don't gotta pity me just cause I can't compete with the rest of the girls in looks."
    },
    {
      "character": "Miku",
      "text": "Likin' tomboys is one thing, but I ain't really got any other good qualities at all when ya start gettin' down to it. Just soccer and..."
    },
    {
      "character": "Miku",
      "text": "See, I got nothin'. It's literally just soccer."
    },
    {
      "character": "Sensei",
      "text": "I'm sure you have tons of other good qualities. I just can't imagine I'll be learning about them in the hallway when, as you said, all the real action is behind closed doors."
    },
    {
      "character": "Miku",
      "text": "Hey, that woulda made a great segue thingy if you were tryin' to get into my room right now!"
    },
    {
      "character": "Sensei",
      "text": "That...is exactly what I was doing, Miku."
    },
    {
      "character": "Miku",
      "text": "Wait, for real?! Why?!"
    },
    {
      "character": "Sensei",
      "text": "Maybe I just {i}really{/i} have a thing for tomboys?"
    },
    {
      "character": "Miku",
      "text": "Must be a pretty huge thing if you're gonna start tryin' to pick me up in the hallway!"
    },
    {
      "character": "Sensei",
      "text": "It's pretty big, yeah."
    },
    {
      "character": "Miku",
      "text": "Umm....well I don't really know what to say, Sensei."
    },
    {
      "character": "Miku",
      "text": "I like ya and all, but...I don't know if I'm really ready to take whatever steps you're tryin' to make here."
    },
    {
      "character": "Miku",
      "text": "B-Besides! I'm already way behind schedule for my nightly run and...I've gotta get started on that as soon as we're done talkin'."
    },
    {
      "character": "Sensei",
      "text": "You're planning on going out this late at night? Isn't that dangerous?"
    },
    {
      "character": "Miku",
      "text": "Dangerous? Nah. I can outrun any criminal who tries to start somethin' with me."
    },
    {
      "character": "Miku",
      "text": "Chances are nobody will do that, though, since most people just confuse me for a boy on account of my...uhh...everything."
    },
    {
      "character": "Sensei",
      "text": "I am both glad to hear that you'll be safe and saddened to hear about the whole {i}mistaken for a boy{/i} thing."
    },
    {
      "character": "Miku",
      "text": "I ain't too beat up about it. Been dealin' with it forever, pretty much."
    },
    {
      "character": "Sensei",
      "text": "If it's any consolation, you'll always be a girl to me."
    },
    {
      "character": "Miku",
      "text": "Man, where's all this comin' from, Sensei?! You been readin' one of those books about flirtin' or something lately?"
    },
    {
      "character": "Sensei",
      "text": "I don't know if I'd consider calling you a girl {i}flirting...{/i}"
    },
    {
      "character": "Miku",
      "text": "You would if you were me! I never hear that kinda stuff from anybody other than Makoto and-"
    },
    {
      "character": "Miku",
      "text": "Wait a sec! Makoto didn't put ya up to this, did she?!"
    },
    {
      "character": "Miku",
      "text": "She's yelled at me three times this month for leavin' on my runs without pepper spray and she hired {i}you{/i} as an agent to come stop me with your sudden tomboy fetish!"
    },
    {
      "character": "Sensei",
      "text": "That's-"
    },
    {
      "character": "Miku",
      "text": "Darn it, Makoto! I already told ya that the pepper spray doesn't fit into my stupid, undersized pockets!"
    },
    {
      "character": "Miku",
      "text": "Why even put pockets on girl pants in the first place if ya can't friggin' fit anything in 'em?!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "You got a problem, Sensei?"
    },
    {
      "character": "Sensei",
      "text": "Nope. Just admiring your abundance of energy even as the day comes to an end."
    },
    {
      "character": "Miku",
      "text": "Why just admire when you can see it first hand? Come runnin' with me!"
    },
    {
      "character": "Miku",
      "text": "I'll show ya my route and we can even stop by Makoto's place so I can yell at her for hirin' an assassin."
    },
    {
      "character": "Sensei",
      "text": "As fun as it sounds to watch you yell at Makoto, I think I'm going to pass."
    },
    {
      "character": "Sensei",
      "text": "Running's not really my thing."
    },
    {
      "character": "Sensei",
      "text": "Nor is...any athletic activity, now that I think about it."
    },
    {
      "character": "Miku",
      "text": "Well, suit yourself! But I can't really hang around here much longer."
    },
    {
      "character": "Miku",
      "text": "Feel free to drop by again, though! Some of the other girls might be opposed to you hangin' out around here, but I think it's pretty great!"
    },
    {
      "character": "Miku",
      "text": "Just make sure ya barricade whatever doors ya wind up behind if you're lookin' for privacy since Makoto's got a key to all of 'em."
    },
    {
      "character": "Miku",
      "text": "Later, Sensei! Nice talkin' to you!"
    },
    {
      "character": "narrator",
      "text": "Miku gets off the ground and sprints down the hall, jumping down a flight of stairs and landing on a small platform before the next."
    },
    {
      "character": "narrator",
      "text": "The sound echoes throughout the dorm and seems to startle even her as she needs to take a moment to collect herself after landing."
    },
    {
      "character": "narrator",
      "text": "I turn around to see if Futaba is still here as well but, after realizing she must have gone back into her room, I decide it's probably best to just head home for the night."
    },
    {
      "character": "narrator",
      "text": "At least I got to talk to Miku for a bit, though..."
    },
    {
      "character": "narrator",
      "text": "{i}Miku’s affection has increased to [miku_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "mikufirsthall": {
      "from": null,
      "to": true
    }
  }
}