{
  "event_id": 109,
  "event_label": "makotofirsthall",
  "dialogue": [
    {
      "character": "Sensei",
      "text": "Hey Makoto. What are you up to?"
    },
    {
      "character": "Makoto",
      "text": "Hey, Sensei...I was actually just about to go meet up with my mom for dinner, but..."
    },
    {
      "character": "Makoto",
      "text": "Now I'm curious as to what exactly you're doing here."
    },
    {
      "character": "Makoto",
      "text": "You do realize there doesn't have to be a rule specifically advising that males are not allowed in the girls' dorm to just...{i}know{/i} you shouldn't enter, correct?"
    },
    {
      "character": "Sensei",
      "text": "And yet here I am."
    },
    {
      "character": "Makoto",
      "text": "Though...it is rather strange that there {i}isn't{/i} a rule barring males from entry given that there are so many other strangely specific rules in the student handbook."
    },
    {
      "character": "Sensei",
      "text": "Am I allowed to talk now or do you want to think about rules for a little while longer?"
    },
    {
      "character": "Makoto",
      "text": "Apologies. Did you maybe...need something from me?"
    },
    {
      "character": "Sensei",
      "text": "All I need from you is a good conversation, Makoto."
    },
    {
      "character": "Makoto",
      "text": "...I beg your pardon?"
    },
    {
      "character": "Sensei",
      "text": "A conversation. It's the formal word for when two normal people talk to one another."
    },
    {
      "character": "Makoto",
      "text": "I'm so confused. Are you implying that you came all this way, breaking several unwritten rules in the process, to do something as simple as {i}talking?{/i}"
    },
    {
      "character": "Sensei",
      "text": "There is no such thing as an unwritten rule. If it's not written down, it may as well not exist."
    },
    {
      "character": "Makoto",
      "text": "I have many issues with that statement, but for the sake of our {i}conversation{/i}, I will attempt to look past them."
    },
    {
      "character": "Makoto",
      "text": "So, what would you like to talk about? I'm all ears for the next several minutes."
    },
    {
      "character": "Sensei",
      "text": "Anything really. I kind of just wanted to hang out with you and kill some time before heading home."
    },
    {
      "character": "Makoto",
      "text": "Hang out? Like...right now?"
    },
    {
      "character": "Sensei",
      "text": "Is that a problem? We've hung out before, haven't we?"
    },
    {
      "character": "Makoto",
      "text": "Yes, it's just..."
    },
    {
      "character": "Makoto",
      "text": "I wish I knew you were planning on hanging out with me before I made plans with my mom."
    },
    {
      "character": "Sensei",
      "text": "I can always come back some other time if you're busy. It's no big deal."
    },
    {
      "character": "Makoto",
      "text": "Hmm...Well, I suppose it wouldn't hurt to spare a few minutes."
    },
    {
      "character": "Sensei",
      "text": "Is your mom going to be okay with you being late?"
    },
    {
      "character": "Makoto",
      "text": "Honestly, I doubt she would have shown up on time anyway...so it's not really a big deal."
    },
    {
      "character": "Makoto",
      "text": "And, in the event that she's actually on time for once, I can just tell her I was helping out the teacher."
    },
    {
      "character": "Sensei",
      "text": "Great idea. Feel free to use me as an excuse whenever you want, Makoto."
    },
    {
      "character": "Makoto",
      "text": "To be perfectly honest, Sensei, I have been doing that all year. But I'm glad to know that my occasional tardiness is now teacher-approved."
    },
    {
      "character": "Makoto",
      "text": "Oh, speaking of which...I don't think I've ever asked you why you decided to teach at a high school instead of a college or...night school or something."
    },
    {
      "character": "Makoto",
      "text": "Was there any reason behind that choice? How different is the salary of a high school teacher compared to that of a college professor?"
    },
    {
      "character": "Makoto",
      "text": "What sort of benefits are offered? And, in terms of job security-"
    },
    {
      "character": "Sensei",
      "text": "Makoto, chill. That's way too many questions at once."
    },
    {
      "character": "Makoto",
      "text": "Sorry...it's just-"
    },
    {
      "character": "Makoto",
      "text": "Well, you know how badly I want to be a teacher one day."
    },
    {
      "character": "narrator",
      "text": "I guess I do now."
    },
    {
      "character": "Makoto",
      "text": "And I'm sure it might be premature to begin thinking about it now, but I've yet to decide on which level I want to teach at."
    },
    {
      "character": "Makoto",
      "text": "I think I'd be best off with college students, but...I also lack a formal college education right now, so I could be very, very wrong about that."
    },
    {
      "character": "Sensei",
      "text": "Well, unfortunately, I don't think I'll be of much help to you right now."
    },
    {
      "character": "Sensei",
      "text": "I have literally no idea how I wound up where I am and...honestly? I'm not sure if I ever will."
    },
    {
      "character": "Makoto",
      "text": "What do you mean by that, exactly?"
    },
    {
      "character": "Makoto",
      "text": "Are you saying that...life is so unpredictable that even the most focused individuals can get hurled down an unexpected path entirely at random?"
    },
    {
      "character": "Sensei",
      "text": "Sure, let's go with that."
    },
    {
      "character": "Makoto",
      "text": "Hmm...I see."
    },
    {
      "character": "Makoto",
      "text": "I guess I never thought of it that way."
    },
    {
      "character": "Makoto",
      "text": "I suppose it would be best to just...not focus on that for now then."
    },
    {
      "character": "Makoto",
      "text": "At the very least, it will give me a bit more time to focus on keeping a certain {i}someone{/i} in check."
    },
    {
      "character": "Sensei",
      "text": "Good idea, Makoto. Miku needs all the help she can get."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "I..."
    },
    {
      "character": "Makoto",
      "text": "I was talking about you, Sensei..."
    },
    {
      "character": "narrator",
      "text": "Makoto and I talk for another few minutes before she decides it’s best to start heading over to wherever she's meeting her mom."
    },
    {
      "character": "narrator",
      "text": "I think for a moment about what she would be like as a teacher, but ultimately get sucked into a fantasy I would prefer to not tell you about."
    },
    {
      "character": "narrator",
      "text": "Either way, the night comes to an end. But not before the two of us manage to get a little bit closer..."
    },
    {
      "character": "narrator",
      "text": "{i}Makoto’s affection has increased to [makoto_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "makotofirsthall": {
      "from": null,
      "to": true
    }
  }
}