{
  "event_id": 118,
  "event_label": "mayadate45",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I tap on Maya’s name in my phone and think about how many other versions of me have been able to narrate that."
    },
    {
      "character": "narrator",
      "text": "Sure, it may have taken the end of several worlds (Or several ends of one world) for me to {i}be able{/i} to share something like this with you, but...I’m here."
    },
    {
      "character": "narrator",
      "text": "And hopefully soon, she will be as well."
    },
    {
      "character": "narrator",
      "text": "As I stare down at a name that is perhaps the most important to me (Barring the recent intrusion of another girl I’ve known for far too long), I think about what I’m going to say when she picks up."
    },
    {
      "character": "narrator",
      "text": "But then she picks up."
    },
    {
      "character": "narrator",
      "text": "And I still have absolutely nothing."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Uhh..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "You realize you’re suppose to say words after you call someone, correct?"
    },
    {
      "character": "Sensei",
      "text": "Yeah...what are you doing right now?"
    },
    {
      "character": "Maya",
      "text": "I..."
    },
    {
      "character": "Maya",
      "text": "I don’t want to answer that question."
    },
    {
      "character": "Sensei",
      "text": "Why not?"
    },
    {
      "character": "Maya",
      "text": "Because it will be succeeded by an invitation to wherever you are right now."
    },
    {
      "character": "Sensei",
      "text": "And?"
    },
    {
      "character": "Maya",
      "text": "And..."
    },
    {
      "character": "Maya",
      "text": "I, depressingly, don’t think I’d be able to say no."
    },
    {
      "character": "Sensei",
      "text": "Let’s meet at my apartment, then."
    },
    {
      "character": "Maya",
      "text": "You-"
    },
    {
      "character": "Sensei",
      "text": "We still haven’t talked and I don’t want to just pretend that what happened on the beach was some spur of the moment mistake."
    },
    {
      "character": "Sensei",
      "text": "I’m tired of collecting dust. And you said it yourself that you also hate how stagnant things have become. "
    },
    {
      "character": "Maya",
      "text": "I don’t-"
    },
    {
      "character": "Sensei",
      "text": "I get that it’s probably terrifying having to confront your feelings after all of this time. It’s terrifying for {i}me{/i} and I’ve only been doing this for what equates to, like...two or three years."
    },
    {
      "character": "Sensei",
      "text": "But is there really any point in {i}anything{/i} you’ve done if neither one of us ever gets what we want?"
    },
    {
      "character": "Maya",
      "text": "{i}I don’t know.{/i} That’s the whole problem and it’s exactly what I’ve been trying to tell you this whole time."
    },
    {
      "character": "Sensei",
      "text": "Then tell me in a way that’s easier to understand."
    },
    {
      "character": "Maya",
      "text": "I’m...{i}bad{/i} at that. I don’t like talking. Especially about sappy, childish stuff like {i}romance{/i}."
    },
    {
      "character": "Sensei",
      "text": "You can carry on a conversation about time or the stars for days. "
    },
    {
      "character": "Maya",
      "text": "Talking about those things has never broken the world. "
    },
    {
      "character": "Sensei",
      "text": "And talking about us has?"
    },
    {
      "character": "Maya",
      "text": "Have you not been paying attention to literally anything I’ve been telling you over the last “two or three years?” {i}Yes.{/i} Things have spiraled into chaos {i}every other time{/i} I have done that."
    },
    {
      "character": "Sensei",
      "text": "This time is different and you know it."
    },
    {
      "character": "Maya",
      "text": "I know..."
    },
    {
      "character": "Maya",
      "text": "That’s why I’m so careful."
    },
    {
      "character": "Sensei",
      "text": "Just come over. And don’t bring Ayane this time, even if she's still glued to you."
    },
    {
      "character": "Maya",
      "text": "Good idea. Wouldn’t want you getting distracted and having sex with her while we’re trying to talk."
    },
    {
      "character": "Sensei",
      "text": "Maya-"
    },
    {
      "character": "Maya",
      "text": "I’ll stop at the convenience store. Is there anything you want?"
    },
    {
      "character": "Sensei",
      "text": "When? Now?"
    },
    {
      "character": "Maya",
      "text": "Yeah. I’m on my way over so we can {i}talk{/i} if that will get you to stop bothering me about this every time we communicate. "
    },
    {
      "character": "Maya",
      "text": "But Sensei-"
    },
    {
      "character": "Sensei",
      "text": "Call me by my real name."
    },
    {
      "character": "narrator",
      "text": "There’s a silence at the other end of the phone."
    },
    {
      "character": "narrator",
      "text": "Then a beep."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "One hour later, she shows up at my apartment with plastic bags clasped in each of her hands."
    },
    {
      "character": "narrator",
      "text": "She takes her shoes off at the entrance and I meet her at the door."
    },
    {
      "character": "narrator",
      "text": "When she steps toward me, she feels shorter than normal."
    },
    {
      "character": "narrator",
      "text": "I don’t know if it’s the lack of shoes or the mutual desire to hold one another that’s making her feel so much more fragile than normal but, unlike the others, I have no intention of breaking this one."
    },
    {
      "character": "Sensei",
      "text": "You hung up on me."
    },
    {
      "character": "Maya",
      "text": "I did not. You dropped a bomb on me and I died."
    },
    {
      "character": "Sensei",
      "text": "You’re pretty attractive for a dead girl, you know."
    },
    {
      "character": "Maya",
      "text": "Great. One more disgusting fetish to add to the list. Thank you for complicating things within seconds of my arrival. I expected nothing less."
    },
    {
      "character": "Sensei",
      "text": "Maya-"
    },
    {
      "character": "Maya",
      "text": "When?"
    },
    {
      "character": "Sensei",
      "text": "Huh? When what?"
    },
    {
      "character": "Maya",
      "text": "When did you remember?"
    },
    {
      "character": "Sensei",
      "text": "Ah..."
    },
    {
      "character": "Sensei",
      "text": "I didn’t."
    },
    {
      "character": "Sensei",
      "text": "Niki told me."
    },
    {
      "character": "Maya",
      "text": "Those {i}fucking{/i} Nakayamas will never stop being problematic. It’s an actual miracle you’re still here to talk about this when you could have been wiped right then and there."
    },
    {
      "character": "Sensei",
      "text": "There seem to be a lot of miracles lately. And you can add to that list by joining those {i}fucking Nakayamas{/i} in calling me by my actual name."
    },
    {
      "character": "Maya",
      "text": "I mean...it’s...it’s not as if I don’t {i}want{/i} to call you by your actual name...it just feels...wrong after all this time. And I’ve already gotten used to “Sensei,” so..."
    },
    {
      "character": "Sensei",
      "text": "You’re embarrassed, aren’t you?"
    },
    {
      "character": "Maya",
      "text": "Possibly. But I’m also taking into consideration the fact that you short-circuited from just touching me a while ago."
    },
    {
      "character": "Maya",
      "text": "And also how hearing something as important as your name from the girl more suited to you than {i}anyone{/i} might be a little more intense than hearing it from some shitty idol and her sister."
    },
    {
      "character": "Sensei",
      "text": "Niki’s a good person, Maya. "
    },
    {
      "character": "Maya",
      "text": "I don’t care. Things would be easier if she didn’t exist, so I will continue to want her to...not exist."
    },
    {
      "character": "Maya",
      "text": "Anyway, I’m hungry and I’m going to be eating now. I got you something too. Eat it or don’t. I don’t care."
    },
    {
      "character": "Sensei",
      "text": "You know, I {i}knew{/i} you were tsundere this whole time but you kept denying it."
    },
    {
      "character": "Maya",
      "text": "You don’t know anything! I’m the one who knows stuff! Now shut up and leave me alone!"
    },
    {
      "character": "narrator",
      "text": "Maya storms right past me like she owns the place and empties one of her bags out onto the dining room table."
    },
    {
      "character": "narrator",
      "text": "I follow behind her and join her as she sits down, taking note of the first of what I imagine will be the several thousand bento boxes required to fill her up."
    },
    {
      "character": "narrator",
      "text": "But as she picks up her chopsticks, her newfound fragility somehow becomes {i}more{/i} apparent in the fact that she refrains from eating."
    },
    {
      "character": "narrator",
      "text": "I remember her saying something along the lines of how she doesn’t like to be watched, but I can’t help but feel like this is more than that."
    },
    {
      "character": "narrator",
      "text": "And call me self-centered, but I can’t help but feel like it is my fault."
    },
    {
      "character": "Sensei",
      "text": "Something wrong?"
    },
    {
      "character": "Maya",
      "text": "Yes. Your ability to annoy me has become so strong that it is now capable of ruining my appetite. I hope you’re proud of yourself."
    },
    {
      "character": "Sensei",
      "text": "Good. That just gives us more time to talk."
    },
    {
      "character": "Maya",
      "text": "Nevermind. I’m hungry again. Please hold your words until...tomorrow. When I am gone."
    },
    {
      "character": "Sensei",
      "text": "I’ll pass. It’s better we tackle this now before we have to-"
    },
    {
      "character": "Maya",
      "text": "Why did you tell me that...thing you told me on the beach?! And why did you almost kiss me?!"
    },
    {
      "character": "Sensei",
      "text": "What thing? That I’m in love with you?"
    },
    {
      "character": "Maya",
      "text": "Yes! How can you say that with such a straight face?"
    },
    {
      "character": "Sensei",
      "text": "What’s with the sudden change in reaction? You seemed pretty thrilled to hear that back then. And, if I remember correctly, you were the one who moved in for a kiss first."
    },
    {
      "character": "Maya",
      "text": "You remember incorrectly. That doesn’t sound like a thing I would do. I’m much more reserved than that."
    },
    {
      "character": "Sensei",
      "text": "{i}Were{/i} much more reserved than that. You seem a {i}bit{/i} less reserved than normal tonight for some totally strange reason that I have no idea of."
    },
    {
      "character": "Maya",
      "text": "Yeah, because you had to go and completely change our dynamic with a few words I didn’t think I’d ever hear again. "
    },
    {
      "character": "Maya",
      "text": "Do you have any idea how hard it is to keep my head on straight now? I’m supposed to be the one making us...conquer time or whatever and now all I can think about is...fireflies. And stuff."
    },
    {
      "character": "Sensei",
      "text": "There are three of us now, Maya. You don’t have to be the ringleader anymore. We keep trying to tell you that."
    },
    {
      "character": "Maya",
      "text": "Yeah, and I keep trying to tell you guys that’s just who I am. But I’m apparently as bad at explaining myself as I am at theorizing, I guess."
    },
    {
      "character": "Maya",
      "text": "Damn it. Why did you have to invite me here? Why couldn’t we just be adults and mutually pretend that was some meaningless, fleeting moment between...acquaintances?"
    },
    {
      "character": "Sensei",
      "text": "Because I want more of those moments."
    },
    {
      "character": "Sensei",
      "text": "I want {i}you.{/i}"
    },
    {
      "character": "Maya",
      "text": "Well...stop! "
    },
    {
      "character": "Sensei",
      "text": "Do you remember what you said to me right before we almost kissed?"
    },
    {
      "character": "Maya",
      "text": "Yes but I don’t want you to repeat it because it directly contradicts basically everything I’ve said tonight."
    },
    {
      "character": "Sensei",
      "text": "You said that if the world were to end right then, you wouldn’t care."
    },
    {
      "character": "Maya",
      "text": "I literally {i}just{/i} told you I remembered. You didn’t have to say it again."
    },
    {
      "character": "Sensei",
      "text": "Do you care now?"
    },
    {
      "character": "Maya",
      "text": "Do you {i}not?{/i}"
    },
    {
      "character": "Maya",
      "text": "{i}You{/i} might be able to say cute things now and...remember your name and...talk about stuff involving us like it’s no big deal, but one wrong move on {i}my{/i} end and this could all be over."
    },
    {
      "character": "Maya",
      "text": "Back on the beach...I lost sight of that for a second. That’s why I said what I said. "
    },
    {
      "character": "Maya",
      "text": "But when you left...I started thinking more and more about what might have happened if we followed through and..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "And the fear of losing you {i}again{/i} outweighs anything and everything."
    },
    {
      "character": "Maya",
      "text": "That’s what’s been pushing me forward this whole time. Everything I’ve done and everything I do is to protect {i}you.{/i} And...obviously myself as well. But you’re a really huge part of that."
    },
    {
      "character": "Maya",
      "text": "I might be a selfish, controlling know-it-all bitch, but I’m not so bad that I’d put your life at risk just because I want to kiss you. Which I obviously do because- "
    },
    {
      "character": "Maya",
      "text": "Nope! See?! I almost said it again! Look what you’re doing to me!"
    },
    {
      "character": "Sensei",
      "text": "When will you let yourself be happy?"
    },
    {
      "character": "Maya",
      "text": "I should be asking {i}you{/i} when you decided to stop fighting the same fight as me."
    },
    {
      "character": "Maya",
      "text": "You might now be at the forefront of an inexplicable apocalyptic event, but the Sensei I know wasn’t this...{i}proactive.{/i}"
    },
    {
      "character": "Sensei",
      "text": "He grew...and so should you."
    },
    {
      "character": "Maya",
      "text": "Even if that means putting both myself and {i}you{/i} at risk? And everyone else? Are you really willing to risk all of that for {i}me?{/i} Why? "
    },
    {
      "character": "Maya",
      "text": "There are nineteen other girls in class who apparently can’t cause your mind to shut down. Just choose one of them. It’s safer."
    },
    {
      "character": "Sensei",
      "text": "How can you even say something like that when it’s so clear now how you feel about me?"
    },
    {
      "character": "Maya",
      "text": "Oh, it fucking {i}sucks.{/i} It’s {i}so{/i} hard to say that...but I have to."
    },
    {
      "character": "Maya",
      "text": "It’s literally torture having to hear about how far you’ve gone with all of my friends while I’m stuck in the background pretending to not care. But honestly, I’ve gotten used to it."
    },
    {
      "character": "Maya",
      "text": "Even when it {i}wasn’t{/i} you it sucked, because it still kind of {i}was{/i} you in a really roundabout...physical-only sort of way."
    },
    {
      "character": "Maya",
      "text": "You should have been mine...like you were {i}before{/i} all of this started happening."
    },
    {
      "character": "Maya",
      "text": "And you’ll probably think this is pathetic but, after several lapses in judgement and an earth-shattering amount of desperation, I...may have caved into some of my carnal desires and...broken several Senseis. "
    },
    {
      "character": "Maya",
      "text": "But that’s exactly why I’m so scared of what will happen if we {i}do{/i} get closer. I’ve seen it firsthand."
    },
    {
      "character": "Maya",
      "text": "I can’t imagine how breaking the {i}real{/i} you would feel after how much it hurt to break all of those {i}fake{/i} ones just because I felt alone."
    },
    {
      "character": "Sensei",
      "text": "Maya..."
    },
    {
      "character": "Maya",
      "text": "It’s okay...I’ll go back to normal tomorrow and you can keep screwing the rest of my classmates without having to worry about hurting my feelings. It’s fine. I get that you...like them too or whatever."
    },
    {
      "character": "Maya",
      "text": "I’m only like this tonight because {i}you{/i} wanted to talk and if I didn’t get all of this shit out of my head, I would have gone insane."
    },
    {
      "character": "Maya",
      "text": "But you {i}can’t{/i} love me. "
    },
    {
      "character": "Maya",
      "text": "The world won’t allow it."
    },
    {
      "character": "Sensei",
      "text": "Fuck the world."
    },
    {
      "character": "Maya",
      "text": "Fuck the world, indeed."
    },
    {
      "character": "Maya",
      "text": "I have no idea what either one of us did to deserve this, but it’s clear from our respective positions that some higher power has it out for us."
    },
    {
      "character": "Maya",
      "text": "And until we’re confident that we’re actually {i}free{/i} from this weird fucking chronoprison...we have to pretend we don’t feel the way we feel because that’s what keeps us safe."
    },
    {
      "character": "Sensei",
      "text": "I see..."
    },
    {
      "character": "Maya",
      "text": "I knew you would. Even you’re not stupid enough to completely disregard your own life for one girl. "
    },
    {
      "character": "Sensei",
      "text": "Oh, no. I have no intentions of giving up just yet. I’m going to keep doing what I’ve been doing all along in trying to win you over because I think it’s worth it."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You may have retracted what you said about not caring if the world were to end right now, but I think I may have inherited that thought."
    },
    {
      "character": "Sensei",
      "text": "I’ll admit that I’m worried about hurting you, but I don’t care at all about what happens to me. "
    },
    {
      "character": "Sensei",
      "text": "And, as much as I’d love to say I’m happy just being near you and that it’s fine if we stay like this...it won’t be enough. You’re way stronger than I am for being able to do something like that for so long."
    },
    {
      "character": "Sensei",
      "text": "And you can be strong all the way up ‘til the end if you want. You can keep pretending you don’t want me while I continue to-"
    },
    {
      "character": "Maya",
      "text": "Can we go outside? "
    },
    {
      "character": "Sensei",
      "text": "Now? Why? We’re in the middle of a discussion."
    },
    {
      "character": "Maya",
      "text": "Because if I have to sit here for one more minute and listen to you talk about how much you want me, I’m going to break you again."
    },
    {
      "character": "Sensei",
      "text": "Then break me."
    },
    {
      "character": "Maya",
      "text": "I’ll be on the balcony if you need me. We shouldn’t be inside right now. It’s not safe."
    },
    {
      "character": "Sensei",
      "text": "Maya, come on-"
    },
    {
      "character": "narrator",
      "text": "Maya heads out onto the balcony and-"
    },
    {
      "character": "narrator",
      "text": "And I follow her out there, because it’s not safe {i}anywhere.{/i}"
    },
    {
      "character": "narrator",
      "text": "She rests her arms on the railing and I do the same, peering out at a landscape I’ve yet to observe in my short time here."
    },
    {
      "character": "narrator",
      "text": "Powerlines cut through the night sky and decorate the colossal walls that keep us trapped, becoming less and less metaphorical by the day."
    },
    {
      "character": "narrator",
      "text": "Despite how much I may want to, I don’t touch Maya."
    },
    {
      "character": "narrator",
      "text": "If I did, I’m sure she’d be mine in a matter of seconds."
    },
    {
      "character": "narrator",
      "text": "I’m also sure it would be worth whatever apocalyptic fallout results from it because who even {i}knows{/i} when the last time she layed with me was."
    },
    {
      "character": "narrator",
      "text": "There’s no telling when it will happen next, nor if it ever {i}will{/i} if she has things her way...but, for the first time in quite a while, I actually have some hope."
    },
    {
      "character": "narrator",
      "text": "Life is turning around for me."
    },
    {
      "character": "narrator",
      "text": "{b}AND THERE IS NOTHING THAT COULD HAPPEN TO RUIN THAT.{/b}"
    },
    {
      "character": "Maya",
      "text": "So..."
    },
    {
      "character": "Sensei",
      "text": "So."
    },
    {
      "character": "Maya",
      "text": "That was almost bad."
    },
    {
      "character": "Sensei",
      "text": "Was it?"
    },
    {
      "character": "Maya",
      "text": "If there was any room for memories of {i}me{/i} in your head next to all of the space reserved for the Nakayamas, you’d know {i}exactly{/i} how bad that could have been."
    },
    {
      "character": "Sensei",
      "text": "I suddenly wish there was more room in my head..."
    },
    {
      "character": "Maya",
      "text": "I’m skeptical as always, but...maybe there {i}will{/i} be if we keep on waiting. "
    },
    {
      "character": "Maya",
      "text": "If you remember your {i}name{/i}, there’s no telling what will come next. "
    },
    {
      "character": "Maya",
      "text": "And once it becomes a little clearer that your past with me is capable of being restored {i}and{/i} won’t destroy you in the process-"
    },
    {
      "character": "Sensei",
      "text": "We can have hardcore sex on Ami’s bed?"
    },
    {
      "character": "Maya",
      "text": "We can have hardcore sex on {i}your{/i} bed. Ami’s bed is too loud."
    },
    {
      "character": "Sensei",
      "text": "I’ll take it. Thank you for giving me something to look forward to."
    },
    {
      "character": "Maya",
      "text": "Are you sure that’s what you want, though? "
    },
    {
      "character": "Sensei",
      "text": "To have hardcore sex with you? Yeah. I’m sure."
    },
    {
      "character": "Maya",
      "text": "To...{i}pursue{/i} me in general. It doesn’t scare you knowing that everything you’ve come to love could be stripped away?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Sensei?"
    },
    {
      "character": "Sensei",
      "text": "The most scared I’ve been in recent memory was when I made it to the rooftop two resets ago and you weren’t there."
    },
    {
      "character": "Sensei",
      "text": "I think I’m more worried about something like that happening again than whatever will come from the two of us touching."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Are you afraid of that too?"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "I don’t want to die..."
    },
    {
      "character": "Sensei",
      "text": "It’s not {i}dying.{/i} And I’ve already decided I’ll wait for you if something like that ever happens, so..."
    },
    {
      "character": "Maya",
      "text": "I wouldn’t wish that suffering on anyone. {i}Especially{/i} you."
    },
    {
      "character": "Sensei",
      "text": "Can I have permission to fuck the other Mayas while I wait for you, though?"
    },
    {
      "character": "Maya",
      "text": "I take it back. You can suffer."
    },
    {
      "character": "Sensei",
      "text": "It’s no fair that you got to have sex with some of my clones but I can’t have sex with yours."
    },
    {
      "character": "Maya",
      "text": "Can we not talk about the mistakes I made when I was sex-deprived and desperately missing you? I deserve at least a free pass or two for all the time I’ve spent here."
    },
    {
      "character": "Sensei",
      "text": "Can we at least {i}kiss?{/i}"
    },
    {
      "character": "Maya",
      "text": "You and me? Or you and my clones?"
    },
    {
      "character": "Sensei",
      "text": "You and me. I’m kissing your clones no matter what."
    },
    {
      "character": "Maya",
      "text": "I have no idea. "
    },
    {
      "character": "Maya",
      "text": "It would be nice if there was some sort of rulebook or instruction manual for this. "
    },
    {
      "character": "Sensei",
      "text": "I {i}guess{/i} I can hold back until you’re okay with it then. Even if doing so infuriates me beyond belief."
    },
    {
      "character": "Maya",
      "text": "Oh, I believe it. And I’m sure there will be many moments in the future where I begin to question my own judgement as well. "
    },
    {
      "character": "Sensei",
      "text": "Please inform me of them the moment they spring up."
    },
    {
      "character": "Maya",
      "text": "As if I’d just tell you when it is and isn’t okay to make a move on me."
    },
    {
      "character": "Sensei",
      "text": "From what I’m gathering here, it’s basically just “not okay” for the indefinite future."
    },
    {
      "character": "Maya",
      "text": "That’s correct."
    },
    {
      "character": "Maya",
      "text": "{i}But...{/i}"
    },
    {
      "character": "Sensei",
      "text": "But?"
    },
    {
      "character": "Maya",
      "text": "It {i}might{/i} be okay if you were to accidentally touch your lips to mine or something while I’m not paying attention."
    },
    {
      "character": "Sensei",
      "text": "Woah, what’s that over there? Way off in the distance?"
    },
    {
      "character": "Maya",
      "text": "I am so guarded right now that you wouldn’t even be able to touch my hand if you tried."
    },
    {
      "character": "Sensei",
      "text": "Damn. I thought I had you with that."
    },
    {
      "character": "Maya",
      "text": "Not even close."
    },
    {
      "character": "Maya",
      "text": "You have me in a number of other ways, though."
    },
    {
      "character": "Maya",
      "text": "You always have."
    },
    {
      "character": "Sensei",
      "text": "How’d you wind up getting so attached to a guy like me anyway?"
    },
    {
      "character": "Maya",
      "text": "The same reason you wound up getting attached to me."
    },
    {
      "character": "Sensei",
      "text": "That’s no fair. You know I can’t remember that."
    },
    {
      "character": "Maya",
      "text": "I know. That's why I said it."
    },
    {
      "character": "Sensei",
      "text": "Maya-"
    },
    {
      "character": "Maya",
      "text": "Let’s just say we’re both pretty fucked up."
    },
    {
      "character": "Sensei",
      "text": "I believe it. "
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Woah, what’s that over there?"
    },
    {
      "character": "Maya",
      "text": "It’s not happening. Give up."
    },
    {
      "character": "Sensei",
      "text": "I’ll get you soon enough. Mark my words."
    },
    {
      "character": "Maya",
      "text": "They’re marked. Thank you for the advance notice."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Hey..."
    },
    {
      "character": "Sensei",
      "text": "Is it just me, or does the moon look...bigger than normal tonight?"
    },
    {
      "character": "Maya",
      "text": "Hm?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Huh..."
    },
    {
      "character": "Maya",
      "text": "It looks the same as always to me."
    },
    {
      "character": "narrator",
      "text": "When we head back inside, Maya regains her appetite."
    },
    {
      "character": "narrator",
      "text": "But I’m asked to sit halfway across the room while she demolishes both her bentos {i}and{/i} mine."
    },
    {
      "character": "narrator",
      "text": "Nothing else happens and she leaves shortly after that."
    },
    {
      "character": "narrator",
      "text": "I watch her as she puts her shoes back on...and as she turns to me to say goodbye, I take notice of a smile she forces away."
    },
    {
      "character": "narrator",
      "text": "She pauses for a moment- and instead of telling me she loves me, she says this..."
    },
    {
      "character": "Maya",
      "text": "I don’t...not...feel the same way you said you did before or..."
    },
    {
      "character": "Maya",
      "text": "Yeah."
    },
    {
      "character": "Maya",
      "text": "Goodnight."
    },
    {
      "character": "narrator",
      "text": "I go to sleep with a rare smile on my face."
    },
    {
      "character": "narrator",
      "text": "It’s one I’ll never show you."
    },
    {
      "character": "narrator",
      "text": "But she can see it whenever she wants."
    },
    {
      "character": "narrator",
      "text": "{i}Maya’s affection has increased by 100!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "A new day begins..."
    },
    {
      "character": "narrator",
      "text": "What do I want to do with it?"
    }
  ],
  "state_changes": {
    "maya_love +": {
      "from": 1,
      "to": 100
    },
    "mayadate45": {
      "from": null,
      "to": true
    }
  }
}