{
  "event_id": 125,
  "event_label": "chikalust20intro",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I follow Chika into the woods."
    },
    {
      "character": "narrator",
      "text": "The sound of small sticks and branches cracking underneath her feet gets lost in a cacophony of various insect noises, and I wonder to myself why it is they’re so rowdy in the midst of winter."
    },
    {
      "character": "narrator",
      "text": "Or at least what I imagine is the midst of winter."
    },
    {
      "character": "narrator",
      "text": "All things considered, it could very well be the tail end as it’s certainly a little warmer now than it was when I woke up this morning."
    },
    {
      "character": "narrator",
      "text": "That’s not saying much, though, given that it was still snowing when I left home with the girls."
    },
    {
      "character": "Chika",
      "text": "Hmm hmm hmm~"
    },
    {
      "character": "Chika",
      "text": "Hm hm hm hm hmmm~"
    },
    {
      "character": "Sensei",
      "text": "Someone’s in a good mood."
    },
    {
      "character": "Chika",
      "text": "Of course I’m in a good mood. "
    },
    {
      "character": "Chika",
      "text": "It’s exhausting watching you run around with a bunch of other girls when I’m the only one with the privilege of seeing the...more {i}interesting{/i} side of you."
    },
    {
      "character": "narrator",
      "text": "Chika goes right back to humming, leading me further and further into the forest as if she knows exactly where she’s heading."
    },
    {
      "character": "narrator",
      "text": "We’re far enough in at this point, though, that I begin feeling a bit uneasy."
    },
    {
      "character": "narrator",
      "text": "And even the moonlight crawling in through the trees isn’t enough to really push away the overwhelming darkness surrounding the two of us."
    },
    {
      "character": "Chika",
      "text": "Hmm hmm hm~"
    },
    {
      "character": "Sensei",
      "text": "Chika?"
    },
    {
      "character": "Chika",
      "text": "Yeah?"
    },
    {
      "character": "Sensei",
      "text": "Would you mind telling me where we’re going?"
    },
    {
      "character": "Chika",
      "text": "Why do you wanna know?"
    },
    {
      "character": "Sensei",
      "text": "Because we’ve been walking for a while now and I’m not really in the mood to get lost."
    },
    {
      "character": "Chika",
      "text": "Heheh~"
    },
    {
      "character": "Chika",
      "text": "We need to go far enough that no one will be able to hear you scream."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Chika",
      "text": "Because I’m going to kill you."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Please don’t."
    },
    {
      "character": "Chika",
      "text": "Don’t kill you?"
    },
    {
      "character": "Sensei",
      "text": "Correct. Don’t do that."
    },
    {
      "character": "Chika",
      "text": "Why not?"
    },
    {
      "character": "Sensei",
      "text": "The fact that I need to give you a reason is somehow scarier than the prospect of you killing me itself."
    },
    {
      "character": "Chika",
      "text": "Don’t worry. I wouldn’t actually kill you."
    },
    {
      "character": "Sensei",
      "text": "I appreciate that."
    },
    {
      "character": "Chika",
      "text": "I just wanted to go somewhere private for a little while. "
    },
    {
      "character": "Chika",
      "text": "But I guess we {i}are{/i} getting a little too far in, aren’t we?"
    },
    {
      "character": "Sensei",
      "text": "I’m honestly surprised there’s a forest this size right off of the beach to begin with."
    },
    {
      "character": "Chika",
      "text": "Really?"
    },
    {
      "character": "Chika",
      "text": "Cause I think I heard something once about how there wasn’t a beach here at all back in the day."
    },
    {
      "character": "Chika",
      "text": "It used to be just trees and trees and trees as far as anyone could see."
    },
    {
      "character": "Chika",
      "text": "It wasn’t until later on when tourism started going up that they decided to tear a lot of them down and build the beach we’ve been staying on."
    },
    {
      "character": "Sensei",
      "text": "It hasn’t always been there?"
    },
    {
      "character": "Chika",
      "text": "I mean, it’s not like I was alive back then to confirm anything. I just remember hearing something about it."
    },
    {
      "character": "Chika",
      "text": "I’m pretty sure everything down to the sand itself was purchased and brought here."
    },
    {
      "character": "Chika",
      "text": "Well, everything except the water of course. That was always there."
    },
    {
      "character": "Chika",
      "text": "It’s just the surrounding areas that weren’t as...beachy as they are now."
    },
    {
      "character": "Sensei",
      "text": "Interesting."
    },
    {
      "character": "Chika",
      "text": "Heheh~ Bet you didn’t think you were going to be getting a history lesson out here, did you?"
    },
    {
      "character": "Sensei",
      "text": "I had a feeling we were about to hug."
    },
    {
      "character": "Chika",
      "text": "With all of these bugs all over the place? Ew."
    },
    {
      "character": "Sensei",
      "text": "There are some risks worth taking, Chika."
    },
    {
      "character": "Chika",
      "text": "Just...not while we’re surrounded by creepy, crawly stuff."
    },
    {
      "character": "narrator",
      "text": "Chika and I turn around and head back toward the shore. "
    },
    {
      "character": "narrator",
      "text": "Once we get to more familiar territory, we decide to split up before heading back to the inn so people don’t get suspicious of the two of us showing up together."
    },
    {
      "character": "narrator",
      "text": "I allow Chika to go back first and spend the next ten minutes or so kicking sand into the water- drawing pictures with the tips of my shoes and letting the tide overtake them."
    },
    {
      "character": "narrator",
      "text": "I’ve never been much of an artist, though...so it’s like my hideous creations are simply being put out of their misery."
    },
    {
      "character": "narrator",
      "text": "Once a fair amount of time goes by, I decide it’s my turn to head over to the inn as well."
    },
    {
      "character": "narrator",
      "text": "I’ll be cashing in on the dorm war sleepover tonight, so I’m hoping that whatever happens next doesn’t really get {i}too{/i} out of hand."
    },
    {
      "character": "narrator",
      "text": "But, then again, I’ll be inside a room full of girls who [[mostly] want to win my love, so I highly doubt it will be all that easy."
    },
    {
      "character": "narrator",
      "text": "Either way, I draw one last picture that turns into one last sacrifice before making my way into the inn..."
    }
  ],
  "state_changes": {
    "chikalust20skip": {
      "from": null,
      "to": true
    }
  }
}