{
  "event_id": 127,
  "event_label": "dormwartwo11",
  "dialogue": [
    {
      "character": "Imani",
      "text": "Goooooood morning Vietnaaaaaam! And by Vietnam, I mean Kumon-mi because I’m realizing now that none of you understood that reference."
    },
    {
      "character": "Imani",
      "text": "But that’s fine because you’ll only be paying minimal attention to me while two of our most antisocial students duke it out to see which one of them is best at being the complete opposite of themselves!"
    },
    {
      "character": "Imani",
      "text": "Special thanks once again to the Produce Delivery Administration and the Tsukioka Foundation for sponsoring the event, as well as...whatever the name of Uta’s maid cafe is!"
    },
    {
      "character": "Uta",
      "text": "There is no need for a name when we exist in the shadows."
    },
    {
      "character": "Imani",
      "text": "You say, despite the giant sign out front advertising that there is a maid cafe here!"
    },
    {
      "character": "Uta",
      "text": "A sign is but a symbol of what can never be."
    },
    {
      "character": "Imani",
      "text": "The things you’re saying make less and less sense as the days go by so either you’re running out of steam or have suddenly become the world’s worst method actor."
    },
    {
      "character": "Molly",
      "text": "Ahh, yes. Spoken like someone who has never seen Suicide Squad."
    },
    {
      "character": "Imani",
      "text": "Well, apologies for having {i}taste,{/i} Molly! But before this devolves into a debate about movies, let’s get back to the method acting thing!"
    },
    {
      "character": "Imani",
      "text": "Folks, being a maid is more than just ketchup and cumshots-"
    },
    {
      "character": "Uta",
      "text": "Not that type of cafe."
    },
    {
      "character": "Imani",
      "text": "It’s about embodying the role of someone who lives for the sole purpose of someone else!"
    },
    {
      "character": "Imani",
      "text": "And while it has become eerily apparent to me that that combination of words already describes a good half of you in regard to my Senpai, it’s not enough! For maids have an element of cuteness as well!"
    },
    {
      "character": "Chika",
      "text": "Imani, are you saying some of us aren’t cute?"
    },
    {
      "character": "Imani",
      "text": "I’m saying some of you have evolved {i}past{/i} cuteness and are now extremely sexualized, anthropomorphized animals! "
    },
    {
      "character": "Chika",
      "text": "Aww! Come over here and let me lick you."
    },
    {
      "character": "Imani",
      "text": "Do not tempt me with a good time!"
    },
    {
      "character": "Imani",
      "text": "Like, seriously. These last two days have been rough."
    },
    {
      "character": "Imani",
      "text": "But that’s enough of me since I’m sure you’re all raring to go!"
    },
    {
      "character": "Imani",
      "text": "In just a few short minutes, both of our competitors should be ready and we can kick things off. "
    },
    {
      "character": "Imani",
      "text": "So for now...sit back, relax, and enjoy the complimentary tea and breakfast!"
    },
    {
      "character": "narrator",
      "text": "Imani’s speech comes to an end and I lean back in my chair, awaiting a day I didn’t think would ever come- seeing Maya in a maid costume."
    },
    {
      "character": "narrator",
      "text": "Of course I’m excited to be waited on by Io as well but, apparently, she’s going to stay in her butler costume and play {i}that{/i} role instead of the traditional maid."
    },
    {
      "character": "narrator",
      "text": "Either way, I have entrusted my wallet to Futaba for the rest of the morning so as to not tempt me into immediately emptying its contents in front of whoever goes first."
    },
    {
      "character": "narrator",
      "text": "Which, if we’re deciding based on whoever the first one out of the locker room is, will be Io."
    },
    {
      "character": "Io",
      "text": "Morning. "
    },
    {
      "character": "Io",
      "text": "Sorry for not wearing a dress. Dresses look stupid on me and make me remember that I have a vagina. Which is a thing I probably shouldn’t be saying out loud, but...anyway, hi. Io here."
    },
    {
      "character": "Sensei",
      "text": "You seem nervous?"
    },
    {
      "character": "Io",
      "text": "Yeah. I’ve got pills that are supposed to take care of that, but Uta said I’ve been taking too many lately and that they might affect my, uhh...{i}performance.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Was that supposed to sound sexual in nature or no?"
    },
    {
      "character": "Io",
      "text": "No. It wasn’t. But if thinking it was brings me closer to winning, that’s fine. "
    },
    {
      "character": "Io",
      "text": "Because, even if I can’t stand the vast majority of my floor, having you with me, uhh...wherever it is you wind up being forced to sleep...will sort of counteract that."
    },
    {
      "character": "Io",
      "text": "Should I have sucked it up and worn the dress after all? I feel like that’s a thing I should have done. Just tell me to go get changed and I’ll do it."
    },
    {
      "character": "Sensei",
      "text": "You’re fine the way you are. Don’t worry about it."
    },
    {
      "character": "Io",
      "text": "We both know that’s a lie, but thank you anyway."
    },
    {
      "character": "Uta",
      "text": "Psst...the wind blows...in this general direction..."
    },
    {
      "character": "Io",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I think Uta wants you."
    },
    {
      "character": "Io",
      "text": "Just ignore her. She’ll go away."
    },
    {
      "character": "Uta",
      "text": "PSSSSST!!!"
    },
    {
      "character": "Io",
      "text": "Ugh! What do you want?!"
    },
    {
      "character": "narrator",
      "text": "Uta pulls Io aside to, most likely, give her some form of pep talk before the competition begins."
    },
    {
      "character": "narrator",
      "text": "Either that or the two of them have a secret, lesbian relationship with one another and Uta simply couldn’t wait to get her hands on her best friend anymore."
    },
    {
      "character": "narrator",
      "text": "Which is fair and better than the first thing I imagined, so that’s what I’m going to go with instead."
    },
    {
      "character": "Maya",
      "text": "Oh, good. You’re already thinking of something disgusting and you haven’t even seen me yet. Wonderful."
    },
    {
      "character": "Sensei",
      "text": "Stop reading my- oh boy."
    },
    {
      "character": "Maya",
      "text": "Yes. I am adorable. Thank you for noticing."
    },
    {
      "character": "Sensei",
      "text": "I think you were born to wear that outfit."
    },
    {
      "character": "Maya",
      "text": "That’s actually very funny since wearing it makes me wish I was never born at all."
    },
    {
      "character": "Sensei",
      "text": "I’m surprised you even agreed to this. I figured you’d just take the loss if it meant embarrassing yourself in front of me."
    },
    {
      "character": "Maya",
      "text": "I am not {i}embarrassing{/i} myself. Something like this is well within my capabilities. "
    },
    {
      "character": "Maya",
      "text": "What irritates me is the fact that I must do it for {i}you{/i} and the inevitable plethora of jokes you will make about it in the future."
    },
    {
      "character": "Sensei",
      "text": "If I’m not too busy masturbating, you mean."
    },
    {
      "character": "Maya",
      "text": "You’re disgusting. But I don’t blame you. This is a once in a lifetime opportunity and I was aware of the consequences when I signed on."
    },
    {
      "character": "Maya",
      "text": "Fortunately for you, my victory will be ensured by the month worth of buffet tickets Ayane has promised me in exchange for it. "
    },
    {
      "character": "Sensei",
      "text": "Just make sure you’re extra nice to me. I don’t like tsundere maids."
    },
    {
      "character": "Maya",
      "text": "You will like whatever I tell you to like and that’s final."
    },
    {
      "character": "Sensei",
      "text": "Have you met Niki yet? Because I think you two might have more in common than you think."
    },
    {
      "character": "Maya",
      "text": "Yeah. Me too."
    },
    {
      "character": "Imani",
      "text": "Maya! Io! Gather round because shit’s about to take off!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "The rules are plain and simple. Whoever is a better maid...or butler...wins."
    },
    {
      "character": "Imani",
      "text": "We’re going to set this up in a sort of...wheel around the service worker system. So you two will take turns getting short bursts of service in before swapping places."
    },
    {
      "character": "Imani",
      "text": "We’ll be using the order you two came out of the locker room in to determine who goes first, so...Io. You’re up."
    },
    {
      "character": "Io",
      "text": "Shit. What if I went back in there and then came out again? Would that put me at the back of the order?"
    },
    {
      "character": "Uta",
      "text": "Go, you must. And butler, you shall."
    },
    {
      "character": "Imani",
      "text": "There are no strict rules determining what is and isn’t good maid-slash-butlering, so use your knowledge of Sensei to better suit his exact needs and desires."
    },
    {
      "character": "Maya",
      "text": "Right. But what are we supposed to do if we want to keep our clothes {i}on?{/i}"
    },
    {
      "character": "Imani",
      "text": "Accept defeat, I guess? Beats me. But I ain’t judging this one! So, without further ado..."
    },
    {
      "character": "Imani",
      "text": "Io...attack!"
    },
    {
      "character": "narrator",
      "text": "Io steels herself and tries to calm her nerves. "
    },
    {
      "character": "narrator",
      "text": "Of course, she fails miserably. But Uta is there to give her yet another pep talk (Without any secret lesbian contact, as far as I can tell) before she sighs heavily and makes her way over to my table..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Welcome back to...Unnamed Cafe, Young Master. "
    },
    {
      "character": "Io",
      "text": "It will be my pleasure to...assist you with all of your...clothed desires this fine after...morning. Not afternoon. It’s morning now."
    },
    {
      "character": "Sensei",
      "text": "It certainly is."
    },
    {
      "character": "Io",
      "text": "Could I perhaps interest you in a spot of...omelet? Or tea? Which is what I probably should have brought over here, but..."
    },
    {
      "character": "Io",
      "text": "Omelet?"
    },
    {
      "character": "Sensei",
      "text": "Sure. I was just about to order that anyway. Great predictive thinking, Io."
    },
    {
      "character": "Io",
      "text": "O...Of course, Young Master! It is my greatest pleasure to always be of clothed service to you."
    },
    {
      "character": "Io",
      "text": "So if there is anything else I can do to-"
    },
    {
      "character": "Imani",
      "text": "Time! Maya, go!"
    },
    {
      "character": "Sensei",
      "text": "What? Already?"
    },
    {
      "character": "Io",
      "text": "Oh, thank god. Are we done? Is that it?"
    },
    {
      "character": "Maya",
      "text": "Does my presence disturb you, {i}Master?{/i} Would you like me to retrieve your previous servant?"
    },
    {
      "character": "Maya",
      "text": "Or are you going to shut up and let me win my buffet tickets?"
    },
    {
      "character": "Sensei",
      "text": "I want Io back. Bring me the butler."
    },
    {
      "character": "Imani",
      "text": "Maya, out! Io in!"
    },
    {
      "character": "Io",
      "text": "What?! Again?! And where did I get this second omelet?!"
    },
    {
      "character": "Uta",
      "text": "Never question the mystery omelet."
    },
    {
      "character": "Io",
      "text": "Uhh...hi! I guess things didn’t work out with Maya or something, so...here I am! Your...maid...ler."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Uhh..."
    },
    {
      "character": "Io",
      "text": "Io out. Maya in?"
    },
    {
      "character": "Maya",
      "text": "Hah..."
    },
    {
      "character": "Io",
      "text": "Woah, it actually worked."
    },
    {
      "character": "Sensei",
      "text": "Not to be rude, but you two are pretty fucking bad at this."
    },
    {
      "character": "Maya",
      "text": "Maybe you’re just a bad customer? Constantly swapping out maids and butlers like they’re socks...who exactly do you think you are?"
    },
    {
      "character": "Sensei",
      "text": "I specifically told you I didn’t want a tsundere maid."
    },
    {
      "character": "Maya",
      "text": "You did? Oh my gosh, I’m so sorry. I was just so blinded by how happy I was to see you that I must have completely forgotten."
    },
    {
      "character": "Sensei",
      "text": "Go on..."
    },
    {
      "character": "Maya",
      "text": "With what? You already have your entree. My job here is done. "
    },
    {
      "character": "Sensei",
      "text": "I mean...you could always get me a drink?"
    },
    {
      "character": "Maya",
      "text": "Maya out. Io in."
    },
    {
      "character": "Io",
      "text": "Hi! Io again! And I brought a drink this time! Look!"
    },
    {
      "character": "Io",
      "text": "That makes the score two points for Io and zero points for Maya. Do I win yet?"
    },
    {
      "character": "Sensei",
      "text": "Go back to talking like a butler. You’re just talking like Io right now."
    },
    {
      "character": "Io",
      "text": "Understood, Young Master. Of course Io would not be good enough for you. You deserve only the most attentive of servants, and I am but a lowly peon meant to do your bidding."
    },
    {
      "character": "Io",
      "text": "Again, clothed."
    },
    {
      "character": "Sensei",
      "text": "Io out. Uta-chan in."
    },
    {
      "character": "Uta",
      "text": "Yes, Master?"
    },
    {
      "character": "Uta",
      "text": "Wait, you tricked me! I’m not supposed to be up here!"
    },
    {
      "character": "Sensei",
      "text": "Don’t leave. I need you."
    },
    {
      "character": "Uta",
      "text": "Uta-chan out! Maya in!"
    },
    {
      "character": "Maya",
      "text": "Hi."
    },
    {
      "character": "Sensei",
      "text": "This is the worst contest yet."
    },
    {
      "character": "Maya",
      "text": "I actually quite like this format. It means I never have to see you for more than several seconds at a time."
    },
    {
      "character": "Maya",
      "text": "It’s extremely ideal for me."
    },
    {
      "character": "Sensei",
      "text": "Would it kill you to at least {i}try{/i} and be nice?"
    },
    {
      "character": "Maya",
      "text": "Probably. Maya out again. Io in."
    },
    {
      "character": "Io",
      "text": "Are you also starting to get dizzy?"
    },
    {
      "character": "Sensei",
      "text": "A little. But maybe if you have a sip of the drink I didn’t order and the omelet I haven’t been able to touch yet, some of that nausea will go away?"
    },
    {
      "character": "Io",
      "text": "Do you have any idea how long this has to go on for? I kind of want to sit down."
    },
    {
      "character": "Sensei",
      "text": "Just sit here. It’s not like there’s any actual format to this contest at this point and I doubt anyone will care."
    },
    {
      "character": "Io",
      "text": "Sure. That sounds good."
    },
    {
      "character": "Io",
      "text": "Io sit. Maya in."
    },
    {
      "character": "Maya",
      "text": "You traitor."
    },
    {
      "character": "Io",
      "text": "Can I get an omelet as well? And maybe some coffee?"
    },
    {
      "character": "Maya",
      "text": "I am not here to serve you."
    },
    {
      "character": "Sensei",
      "text": "You’re not here to serve me either. "
    },
    {
      "character": "Sensei",
      "text": "In fact, Io is already two points ahead of you and it’s starting to look like those buffet tickets of yours are just a pipe dream."
    },
    {
      "character": "Maya",
      "text": "You’ll regret saying those words to me."
    },
    {
      "character": "Sensei",
      "text": "Will I? Because it seems to me like you {i}have{/i} to do something to redeem yourself at this point or you’re basically screwed."
    },
    {
      "character": "Maya",
      "text": "I am warning you..."
    },
    {
      "character": "Io",
      "text": "Hey, maid girl? I still haven’t gotten my coffee and it’s been...almost fifteen seconds. So if you could hurry it up a little bit, that would be great. Thanks."
    },
    {
      "character": "Maya",
      "text": "Hah..."
    },
    {
      "character": "Maya",
      "text": "Please forget everything you are about to see."
    },
    {
      "character": "Sensei",
      "text": "What? What does-"
    },
    {
      "character": "Maya",
      "text": "Hiya, Master! Moe Moe Maya here!"
    },
    {
      "character": "Io",
      "text": "Oh no! Effort! My greatest weakness!"
    },
    {
      "character": "Maya",
      "text": "It looks to me like somebody is a little hungry! Is there anything I can whip up for ya that’ll bring a smile to that big ole’ handsome face of yours?"
    },
    {
      "character": "Sensei",
      "text": "As much as I...appreciate the sudden effort...I already have-"
    },
    {
      "character": "Maya",
      "text": "You mean you’re not gonna order something from me?...After I tried {i}sooooo{/i} hard to work up the courage to talk to you? You’re gonna bweak my widdle heart."
    },
    {
      "character": "Sensei",
      "text": "I’m sorry, Io...I can’t resist...much longer..."
    },
    {
      "character": "Io",
      "text": "Fight it! Fight it, Sensei! "
    },
    {
      "character": "Maya",
      "text": "Please, Master?...Can’t you do this one little thing for me?..."
    },
    {
      "character": "Maya",
      "text": "If you don’t buy any food from Moe Moe Maya, she’ll have to sleep on the streets. And she gets {i}so scared{/i} when she has to do that..."
    },
    {
      "character": "Maya",
      "text": "Oh! Here’s an idea! What if I throw in my biggest, most enthusiastic Moe Moe beam totally free of charge? Would {i}that{/i} make you happy?"
    },
    {
      "character": "Sensei",
      "text": "Yes. One of everything, please. And also...will you marry-"
    },
    {
      "character": "Maya",
      "text": "No. Maya out."
    },
    {
      "character": "Io",
      "text": "Uhh...uhh!"
    },
    {
      "character": "Io",
      "text": "Io in!"
    },
    {
      "character": "Io",
      "text": "How...How do I do the beam thing?!"
    },
    {
      "character": "Io",
      "text": "Io...beeeeaaaam?"
    },
    {
      "character": "Sensei",
      "text": "It’s no use...you haven’t trained enough, Io. You'll only hurt yourself."
    },
    {
      "character": "Io",
      "text": "But...I brought you things! And I didn’t flip you off! "
    },
    {
      "character": "Io",
      "text": "So what if I’m not as good of an actor as Maya?! Isn’t she only doing this for food anyway?! Shouldn’t what matters most be heart?!"
    },
    {
      "character": "Maya",
      "text": "Io out. Maya in."
    },
    {
      "character": "Io",
      "text": "No! It’s too soon!"
    },
    {
      "character": "Maya",
      "text": "I’m having a new, {i}special{/i} omelet prepared just for you, Master. But, in the meantime...how about I cast my beam on that sorry excuse for an omelet you already have in front of you and make it edible?"
    },
    {
      "character": "Io",
      "text": "Take that back! I’ll have you know that someone probably worked...moderately hard on that! But I’m not really sure as I just took it off the counter!"
    },
    {
      "character": "Sensei",
      "text": "Beam me up, Scotty."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I’m sorry."
    },
    {
      "character": "Maya",
      "text": "Oh, Master. You sure do say some funny things sometimes. But that’s just what Moe Moe Maya loves so much about you."
    },
    {
      "character": "Sensei",
      "text": "I don’t like how good you are at this."
    },
    {
      "character": "Maya",
      "text": "Just wait until you get a taste of how delicious {i}I{/i} am."
    },
    {
      "character": "Maya",
      "text": "Whoops! Did I say {i}me?{/i} Because what I really meant to say was my food. Teehee!"
    },
    {
      "character": "narrator",
      "text": "Somewhere deep inside of my chest, a heart grows back."
    },
    {
      "character": "Maya",
      "text": "Soft and sweet and full of cream! Happy hearts and hungry dreams! Cuteness turned up to extreme! Give this boy a MOE BEAM!!!"
    },
    {
      "character": "Maya",
      "text": "KYAAAAA!!!!!!!~~~~"
    },
    {
      "character": "Uta",
      "text": "Ahh! Her beam was fully capitalized! That means it’s a max level maid beam! It’s on par with mine!"
    },
    {
      "character": "Imani",
      "text": "And her focal lines are blocking us out! Who knew Maya possessed this much power?!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "Well...I think it’s safe to say that we all know who the winner of this competition is. "
    },
    {
      "character": "Io",
      "text": "I’m sorry, Uta...I let you down. We all knew it already, but it appears that I’m really not cut out to be a maid."
    },
    {
      "character": "Maya",
      "text": "And it appears that I will not be going hungry any time soon."
    },
    {
      "character": "Uta",
      "text": "The wind...wishes to know if you are looking for a part time job..."
    },
    {
      "character": "Io",
      "text": "I’m already in the guillotine. Just hurry up and chop my head off already so I can go home and take my pills."
    },
    {
      "character": "Imani",
      "text": "You heard her, Senpai! Say the words so we can get on with the last day of the Dorm Wars!"
    },
    {
      "character": "Sensei",
      "text": "Fine, fine..."
    },
    {
      "character": "Sensei",
      "text": "The winner is..."
    },
    {
      "character": "Sensei",
      "text": "...obviously Maya."
    },
    {
      "character": "Maya",
      "text": "Still got it."
    },
    {
      "character": "Sensei",
      "text": "Still? Have you done this-"
    },
    {
      "character": "Maya",
      "text": "No. Now, please excuse me as I put my actual costume back on and all of us forget this ever happened."
    },
    {
      "character": "Chika",
      "text": "Well, that...sure was something."
    },
    {
      "character": "Nodoka",
      "text": "Something wonderful."
    },
    {
      "character": "Tsuneyo",
      "text": "I feel as if we’ve been here before."
    },
    {
      "character": "Nodoka",
      "text": "It’s one thing to be stuck in a room full of girls in revealing clothing, but to watch as two of them desperately fight over a man as if it’s sport...my. What a beautiful start to the day."
    },
    {
      "character": "Chika",
      "text": "It won’t be beautiful for too long, you know. Your contest is up next."
    },
    {
      "character": "Nodoka",
      "text": "Is it? I haven’t been keeping much track of the schedule."
    },
    {
      "character": "Chika",
      "text": "I wouldn’t take things so lightly if I were you. Yumi’s not going to hold back."
    },
    {
      "character": "Nodoka",
      "text": "Oh, is she actually coming? That’s fantastic. I’m excited to see her so the two of us can put an end to this immature feud once and for all."
    },
    {
      "character": "Chika",
      "text": "Uhh...I don’t think that’s something she’s really interested in doing right now. I think she just wants to win the contest and go back home."
    },
    {
      "character": "Nodoka",
      "text": "If that’s what she wants, that’s what she’ll get. And I wish her the best of luck as very few people have defeated me in...well, anything."
    },
    {
      "character": "Chika",
      "text": "You sound pretty...cool with her coming back to participate despite her beating the living shit out of you the last time you saw her."
    },
    {
      "character": "Nodoka",
      "text": "I’m alive, aren’t I? And more content than ever, might I add."
    },
    {
      "character": "Chika",
      "text": "If you, uhh..."
    },
    {
      "character": "Chika",
      "text": "If you don’t mind me asking...do you think you might have, like...done something to piss her off? Because I’ve never seen Yumi do anything like that to anyone before and..."
    },
    {
      "character": "Chika",
      "text": "Not to suggest anything, but it’s hard for me to believe she’d do that without a reason."
    },
    {
      "character": "Nodoka",
      "text": "Me?"
    },
    {
      "character": "Nodoka",
      "text": "All {i}I{/i} did was steal her clothes and try to get her to masturbate in front of me. Is that really so bad?"
    },
    {
      "character": "Chika",
      "text": "Ugh. Do you always have to be that perverted? Because if you’re not going to tell me the truth, just forget I even asked."
    },
    {
      "character": "Futaba",
      "text": "Molly...are you sure you don’t want to invite Tsuneyo over here? She seems a little out of place with Chika and Nodoka, don’t you think?"
    },
    {
      "character": "Molly",
      "text": "I’m a bit...uhh...how should I say...at odds with the Kendo Princess following her...{i}performance{/i} from last night."
    },
    {
      "character": "Futaba",
      "text": "I agree that she took things way too far, but...I think she was trying her best."
    },
    {
      "character": "Futaba",
      "text": "Even if her best was...disgusting and used you as...the punchline to..."
    },
    {
      "character": "Futaba",
      "text": "Actually, on second thought, I can understand why you’re upset with her. I just...felt a little bad, I guess."
    },
    {
      "character": "Molly",
      "text": "As do I. And I will confront her about the situation shortly once I...uhh..."
    },
    {
      "character": "Molly",
      "text": "Find some sort of...charisma-increasing potion."
    },
    {
      "character": "Futaba",
      "text": "Please don’t get drunk at a third consecutive Halloween party. It’s my least favorite tradition."
    },
    {
      "character": "Molly",
      "text": "Oh, rest assured...I will not be drinking that much again any time soon..."
    },
    {
      "character": "narrator",
      "text": "{i}Maya’s affection has increased to [maya_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Io’s affection has increased to [io_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}First Floor: [dorm1war2points]\\nSecond Floor: [dorm2war2points]{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "maya_love +": {
      "from": 100,
      "to": 1
    },
    "dormwartwo11": {
      "from": null,
      "to": true
    },
    "maidwarmaya": {
      "from": null,
      "to": true
    },
    "dorm1war2points +": {
      "from": null,
      "to": 1
    }
  }
}