{
  "event_id": 128,
  "event_label": "dormwartwo12",
  "dialogue": [
    {
      "character": "narrator",
      "text": "The end of the maid war ushers in our next contest which, despite being less than an hour away at this point, is still unknown to me."
    },
    {
      "character": "narrator",
      "text": "But what I do know is that it will pit Yumi up against the girl who successfully tore down all that she built up over the last several cycles of life here."
    },
    {
      "character": "narrator",
      "text": "A great deal of that tower of hers was dilapidated and crumbling and held together by plaster mixed with unsuccessfully stifled tears, but you’d never be able to tell with just a quick glance at the fresh wreckage."
    },
    {
      "character": "narrator",
      "text": "Not every one of us is on this bus. "
    },
    {
      "character": "narrator",
      "text": "Several notable faces are still caught up in the old district, leaving those of us that remain to pretend we’re not just a fraction and that we can function as a whole even without some key components."
    },
    {
      "character": "narrator",
      "text": "But if that’s true, it doesn’t explain why everything is so quiet in here."
    },
    {
      "character": "narrator",
      "text": "I glance through the glass, listening to the sounds of the rotating tires and wondering how long they’ve been spinning for."
    },
    {
      "character": "narrator",
      "text": "Not just today, of course. But when they were lifted onto whatever it is that holds tires in place...and when they’re going to be changed again."
    },
    {
      "character": "narrator",
      "text": "It’s a metaphor."
    },
    {
      "character": "narrator",
      "text": "For what, I’m sure you already know."
    },
    {
      "character": "Touka",
      "text": "What a bother. I have no idea how I'm going to explain my appearance to the staff once we get to the manor."
    },
    {
      "character": "Sensei",
      "text": "Is that where we’re headed?"
    },
    {
      "character": "Touka",
      "text": "It’s the only place suitable for our next contest, as far as I’m aware. And it’s not as if it's normal for the family heir to wander around the grounds dressed as a horrific fable."
    },
    {
      "character": "Sensei",
      "text": "Is it even okay for so many of us {i}commoners{/i} to be storming your castle at once?"
    },
    {
      "character": "Touka",
      "text": "Shush. The manor will not be a {i}castle{/i} for at least another generation. And of course it’s fine. Field trips on our property are permitted so long as there is advance notice."
    },
    {
      "character": "Touka",
      "text": "What I’m most worried about is Yumi’s presence there...if she {i}does{/i} decide to show up, I mean."
    },
    {
      "character": "Sensei",
      "text": "Worried she’ll attack you?"
    },
    {
      "character": "Touka",
      "text": "That’s actually not it at all."
    },
    {
      "character": "Touka",
      "text": "My lack of understanding of the world outside of my walls is one that you’re all too familiar with by now."
    },
    {
      "character": "Touka",
      "text": "But, even though it’s been a long time since she has “roamed free” so to speak, my mother still knows a fair bit."
    },
    {
      "character": "Touka",
      "text": "And the look on her face when I mentioned Yumi’s family name was...rather shocked, to say the least."
    },
    {
      "character": "Touka",
      "text": "Of course, that momentary recoiling of hers, as quickly and easily hid as it was, was not lost on me...for there is not a soul in this world who has paid more attention to her than I have."
    },
    {
      "character": "Sensei",
      "text": "Figures the local aristocracy would have {i}some{/i} sort of ties to the Yakuza. "
    },
    {
      "character": "Touka",
      "text": "I’m not sure if I’d call them ties...as I believe it’s closer to an acknowledgment of power than anything."
    },
    {
      "character": "Touka",
      "text": "Yumi is, despite her inadequacies...a princess."
    },
    {
      "character": "Touka",
      "text": "She stands to inherit something the same way I do. But while I have accepted that role and welcomed it wholeheartedly, she has taken to running away instead."
    },
    {
      "character": "Touka",
      "text": "It’s curious...how great the difference between the ways we portray ourselves and who we {i}really{/i} are can be after peeling off a layer or two of formality and formula."
    },
    {
      "character": "Touka",
      "text": "And how it took the complete absence of light in all of its forms for me to see her in a different one."
    },
    {
      "character": "Sensei",
      "text": "You really are your mother’s daughter, aren’t you?"
    },
    {
      "character": "Touka",
      "text": "In what way?"
    },
    {
      "character": "Sensei",
      "text": "I’m just recalling a conversation I had with her recently. "
    },
    {
      "character": "Sensei",
      "text": "You two {i}think{/i} a lot more than you say. And when those thoughts spill out, it’s like you’re different people for a moment."
    },
    {
      "character": "Touka",
      "text": "Elegance is key."
    },
    {
      "character": "Touka",
      "text": "There are times where it is acceptable to speak one’s mind, but I’ve found that those times are few and far between...and that it’s usually better to just observe."
    },
    {
      "character": "Touka",
      "text": "I’m sure I don’t have to say that to {i}you,{/i} though."
    },
    {
      "character": "Sensei",
      "text": "That’s not an insult, is it?"
    },
    {
      "character": "Touka",
      "text": "Heavens, no. If anything, I’d call it a compliment."
    },
    {
      "character": "Touka",
      "text": "It means that you’d fit in well with the likes of us if you’d be willing to clean up a bit."
    },
    {
      "character": "Sensei",
      "text": "Ah, okay. So it’s not an insult — {i}it’s a proposal.{/i}"
    },
    {
      "character": "Touka",
      "text": "If it was, what would you say?"
    },
    {
      "character": "Sensei",
      "text": "That you’re choosing the wrong person."
    },
    {
      "character": "Touka",
      "text": "Do you believe me to be a woman who chooses poorly?"
    },
    {
      "character": "Sensei",
      "text": "I believe you to be a teenage girl who doesn’t understand what it even means to {i}choose{/i} yet."
    },
    {
      "character": "Touka",
      "text": "It is well within your rights to believe that."
    },
    {
      "character": "Touka",
      "text": "But know this-"
    },
    {
      "character": "Touka",
      "text": "My naiveté is great...and my compassion is both a wonderful asset and my greatest weakness."
    },
    {
      "character": "Touka",
      "text": "But when it comes to knowing the type of person I am and what it is I value, I am so far ahead of the competition that no one else on this bus will ever catch up."
    },
    {
      "character": "Touka",
      "text": "If you think that has nothing to do with the act of growing up, that is fine."
    },
    {
      "character": "Touka",
      "text": "But, as far as I’m concerned...I am more of a {i}woman{/i} than anyone else I know. "
    },
    {
      "character": "Touka",
      "text": "Well, with the exception of my mother, of course."
    },
    {
      "character": "Touka",
      "text": "But again, you are welcome to view me as whatever you like. A mere number means little to me."
    },
    {
      "character": "Sensei",
      "text": "This really is starting to sound like a proposal the longer you go on."
    },
    {
      "character": "Touka",
      "text": "Then, I ask you again."
    },
    {
      "character": "Touka",
      "text": "If it was...what would you say?"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "The houses over here...are crazy..."
    },
    {
      "character": "Sana",
      "text": "They’re even bigger than...the ones in Ayane’s neighborhood."
    },
    {
      "character": "Maya",
      "text": "To be fair, Ayane has the biggest house in her neighborhood. And I’d guess that most of these ones are empty in the first place."
    },
    {
      "character": "Sana",
      "text": "Yeah...I am seeing a...lot of “for sale” signs...but it’s still...really weird to be in a place like this..."
    },
    {
      "character": "Sana",
      "text": "Since I...grew up in an apartment with my mom...I never really got to...umm...experience...what it’s like to live in a residential neighborhood..."
    },
    {
      "character": "Maya",
      "text": "I’ve spent enough time at Ami’s house to know it’s not all it’s cracked up to be. "
    },
    {
      "character": "Maya",
      "text": "Apartments are normally in busier areas. Busier areas normally have more food. That’s more than enough of a selling point for me."
    },
    {
      "character": "Sana",
      "text": "Come to think of it...I...don’t really know much...about where you’re from, Maya..."
    },
    {
      "character": "Sana",
      "text": "Is it...okay for me to ask?...I know we...aren’t really friends, but..."
    },
    {
      "character": "Maya",
      "text": "How many times do I have to tell you that we {i}are{/i} friends before you believe me?"
    },
    {
      "character": "Sana",
      "text": "I...don’t know...it’s just...I think this is the first time we’ve ever...talked without anyone else...being around..."
    },
    {
      "character": "Maya",
      "text": "It might be the last, too. It isn’t often that Ami {i}and{/i} Ayane aren’t around. And I think we’re both more comfortable with them in the first place."
    },
    {
      "character": "Sana",
      "text": "Well...yeah...but..."
    },
    {
      "character": "Sana",
      "text": "I’d still...like to know more about you...even if...something like this...never happens again..."
    },
    {
      "character": "Maya",
      "text": "And if I can’t remember? Or if I don’t want to talk about it? Then what?"
    },
    {
      "character": "Sana",
      "text": "Then...I’d...apologize and...say we can talk about something else?..."
    },
    {
      "character": "Maya",
      "text": "I see."
    },
    {
      "character": "Maya",
      "text": "In that case, I don’t remember. "
    },
    {
      "character": "Sana",
      "text": "Oh...okay..."
    },
    {
      "character": "Maya",
      "text": "But..."
    },
    {
      "character": "Maya",
      "text": "It would be nice if it was somewhere far from here."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Futaba",
      "text": "I like you two a lot better when you’re like this...it suits you more than whatever was going on yesterday."
    },
    {
      "character": "Otoha",
      "text": "Agreed. And I’ll take the flack for that since I...wasn’t really feeling like myself back then. "
    },
    {
      "character": "Otoha",
      "text": "I just kind of suck at figuring out what’s going on in my head sometimes."
    },
    {
      "character": "Rin",
      "text": "Amen."
    },
    {
      "character": "Otoha",
      "text": "Not like that. That’s something I’m not even going to pretend to understand. "
    },
    {
      "character": "Otoha",
      "text": "It’s more like a...priority type of thing. Figuring out what’s important and sorting everything into a bunch of lines from “most” to “least.”"
    },
    {
      "character": "Otoha",
      "text": "If I ever hear something that makes me have to rearrange those lines, I get all pissy because I have to figure out which ones go where and...you know what? That doesn’t matter."
    },
    {
      "character": "Otoha",
      "text": "What {i}does{/i} matter is that it’s a new day and that I’m not gonna drag you guys down with any more of my confrontational bullshit."
    },
    {
      "character": "Rin",
      "text": "You should apologize to Sensei as well."
    },
    {
      "character": "Otoha",
      "text": "Yeah...I’m gonna. He drew the short end of the stick yesterday and I will definitely admit that."
    },
    {
      "character": "Futaba",
      "text": "Something happened with you and Sensei yesterday?"
    },
    {
      "character": "Otoha",
      "text": "Yeah...he fucked up the lines."
    },
    {
      "character": "Otoha",
      "text": "It’s not like it was personal or anything, though! Like...I still think he and I are on pretty good terms. And I {i}do{/i} like the guy. He just..."
    },
    {
      "character": "Otoha",
      "text": "He makes some...questionable decisions sometimes. Shit that makes me want to grab his shoulders and shake some sense into him, you know?"
    },
    {
      "character": "Rin",
      "text": "That’s my girlfriend for you. The brotherless brocon."
    },
    {
      "character": "Otoha",
      "text": "Shut it. At his age, he’s more like an uncle or something anyway."
    },
    {
      "character": "Rin",
      "text": "Just start calling him Dad like I have. Plus, he’s already Ami’s uncle and I’m pretty sure she’d kill any of us if we started calling him that."
    },
    {
      "character": "Otoha",
      "text": "I’ll just keep calling him Sensei. I’m not really sure how my {i}actual{/i} dad would feel if he found out I was calling my teacher Dad as well."
    },
    {
      "character": "Rin",
      "text": "Just don’t let him find out, then. It’s as simple as that."
    },
    {
      "character": "Otoha",
      "text": "Easy for you to say when you’re free to call him Dad as much as you want without the fear of replacing someone."
    },
    {
      "character": "Otoha",
      "text": "Oh! Speaking of which, is your mom still coming tonight? I wanted to apologize to her for being all awkward the last time I met her as well."
    },
    {
      "character": "Otoha",
      "text": "In fact, I’m pretty sure this is just going to be an “Otoha apologizes to everyone” night. So if you know anyone else I have wronged or inconvenienced, please add them to the list."
    },
    {
      "character": "Rin",
      "text": "I know one person. And she’s actually right here on the bus with us. "
    },
    {
      "character": "Rin",
      "text": "Her name begins with a C and ends with a...painful rejection on the beach that leaves you crying in your teacher-dad’s arms for the rest of the night."
    },
    {
      "character": "Otoha",
      "text": "I think that apology can wait. That one sounds awkward. "
    },
    {
      "character": "Otoha",
      "text": "I’ll just get the adults out of the way today. That’ll work."
    },
    {
      "character": "Rin",
      "text": "In that case, my mom {i}is{/i} still coming to Sakaki-bar-a later. But I have asked her to stay at least fifty feet away from me at all times so no one will know we are related."
    },
    {
      "character": "Otoha",
      "text": "You say that as if you’re not adopted and that standing next to her will somehow reveal that you’re the same person with slightly varying degrees of...lesbianness? "
    },
    {
      "character": "Otoha",
      "text": "Lesbianocity? Is that a word? That should be a word."
    },
    {
      "character": "Rin",
      "text": "Ooooh, Lesbianocity should be our band name."
    },
    {
      "character": "Otoha",
      "text": "I suddenly have no desire to pursue a musical career anymore."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Touka",
      "text": "Is something wrong, Yasu? You haven’t said a word since we’ve set foot on the bus."
    },
    {
      "character": "Yasu",
      "text": "My body feels strange...{i}wrong...{/i}"
    },
    {
      "character": "Touka",
      "text": "Already? You’re nearly two weeks early. Just grin and bear it until we arrive at the manor and-"
    },
    {
      "character": "Yasu",
      "text": "I’m not talking about the shedding of my uterine lining-"
    },
    {
      "character": "Sensei",
      "text": "Okay, I’m going to go sit somewhere else now. This must be my punishment for complimenting Haruka’s uterus yesterday."
    },
    {
      "character": "Touka",
      "text": "Why would you ever-"
    },
    {
      "character": "Yasu",
      "text": "I’m talking about the slow burn of the essence inside of me...dumping buckets full of barley tea onto the embers of the unholy in an effort to extinguish them."
    },
    {
      "character": "Yasu",
      "text": "The way this steel box moves is wrong. It’s as if it’s going backwards...inching closer and closer to what should not belong. To what should not {i}exist.{/i}"
    },
    {
      "character": "Sensei",
      "text": "I think this is Yasu’s way of telling you she has a major issue with the unequal distribution of wealth in Kumon-mi."
    },
    {
      "character": "Touka",
      "text": "Is that reason enough for my family to not {i}exist?{/i}"
    },
    {
      "character": "Yasu",
      "text": "Please listen to me..."
    },
    {
      "character": "Yasu",
      "text": "I don’t want to hurt her..."
    },
    {
      "character": "Touka",
      "text": "What? Hurt {i}who?{/i} Who are you referring to, Yasu?"
    },
    {
      "character": "Yasu",
      "text": "I don’t know. The vision is blurry...obscured behind the glass of 357 mirrors where all I can do is stare back at the melting visage of the loneliest girl. "
    },
    {
      "character": "Yasu",
      "text": "If the mirror will not shatter, what can I do?"
    },
    {
      "character": "Yasu",
      "text": "If the light will not scatter, will the pain just bleed through?"
    },
    {
      "character": "Touka",
      "text": "Oh, excellent rhyme, Yasu! Perhaps we should buy you a few children’s books to sharpen those skills?"
    },
    {
      "character": "Sensei",
      "text": "Doesn’t it always, though?"
    },
    {
      "character": "Touka",
      "text": "Sensei?"
    },
    {
      "character": "Sensei",
      "text": "The pain...doesn’t it always bleed through?"
    },
    {
      "character": "Sensei",
      "text": "You always ask why everything hurts so much...isn’t this just more of that?"
    },
    {
      "character": "Yasu",
      "text": "I..."
    },
    {
      "character": "Yasu",
      "text": "I don’t know..."
    },
    {
      "character": "Sensei",
      "text": "If you truly love your god...why do you doubt the way he makes you feel? Why do you doubt the thoughts he makes you think?"
    },
    {
      "character": "Yasu",
      "text": "Because it is not He who gives me these things. These {i}thoughts...{/i}"
    },
    {
      "character": "Yasu",
      "text": "It is an {i}interference.{/i}"
    },
    {
      "character": "Sensei",
      "text": "From...what? Or who?"
    },
    {
      "character": "Yasu",
      "text": "Again...I don’t know..."
    },
    {
      "character": "Yasu",
      "text": "But if I listen closely..."
    },
    {
      "character": "Touka",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "I can hear the ocean."
    },
    {
      "character": "narrator",
      "text": "Yasu doesn’t speak again for the rest of the ride to Tsukioka Manor."
    },
    {
      "character": "narrator",
      "text": "And Touka remains “elegant” the whole way there."
    },
    {
      "character": "narrator",
      "text": "Even when she falls asleep on my shoulder."
    },
    {
      "character": "narrator",
      "text": "{i}Touka’s affection has increased to [touka_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Yasu’s affection has increased to [yasu_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "dormwartwo12": {
      "from": null,
      "to": true
    }
  }
}