{
  "event_id": 129,
  "event_label": "dormwartwo13",
  "dialogue": [
    {
      "character": "narrator",
      "text": "Our arrival at Tsukioka manor is met with the level of fanfare you’d expect out of the wealthiest family in Kumon-mi — red carpet and all."
    },
    {
      "character": "narrator",
      "text": "But before I’m able to set foot on it, a team of guards escorts the girls who were able to come along off the bus and into a newly constructed viewing room so they can watch the contest without actually {i}being{/i} there."
    },
    {
      "character": "narrator",
      "text": "I am not so lucky."
    },
    {
      "character": "narrator",
      "text": "You see, instead of receiving the same red carpet treatment they do, I am blindfolded and thrown over the shoulder of a large man who I’m {i}pretty sure{/i} only speaks French."
    },
    {
      "character": "narrator",
      "text": "Either that or he just has no interest in talking to me. But at least I can take solace in the fact that Imani has been kidnapped as well."
    },
    {
      "character": "narrator",
      "text": "Or at least...I {i}would{/i} have been able to take solace in that if it were not for the fact that when I open my eyes, things are worse than I ever expected them to be..."
    },
    {
      "character": "narrator",
      "text": "Meet the sharks- a team of self-made millionaire investors who are also entrepreneurs. "
    },
    {
      "character": "Imani",
      "text": "I have not invested in a single thing. Nor do I have anywhere close to a million dollars."
    },
    {
      "character": "Sensei",
      "text": "Who is that holding the camera? And why was it necessary to blindfold us for this?"
    },
    {
      "character": "narrator",
      "text": "Tsukasa Tsukioka is a venture capitalist who turned a six million dollar loan into three billion dollars overnight by investing in Bed Bath & Beyond as part of a short squeeze play."
    },
    {
      "character": "narrator",
      "text": "She has since spent all of that money on a rogue crew of vandals who add new potholes to the streets of Kumon-mi in the middle of the night and she has no intention of ever fixing them."
    },
    {
      "character": "narrator",
      "text": "Tsubasa Tsukioka went from spending her free time reading advanced-level textbooks to organizing a series of for-profit organizations that have led many small businesses into violent bankruptcy."
    },
    {
      "character": "narrator",
      "text": "Her net worth is unable to be disclosed as it would not be able to fit on this screen."
    },
    {
      "character": "narrator",
      "text": "Imani Imai is the daughter of an immigrant family from Croatia who rose to fame after opening up the world’s first nude lemonade stand."
    },
    {
      "character": "Imani",
      "text": "That is not a thing that happened."
    },
    {
      "character": "narrator",
      "text": "She also started her own clothing line at just seven years old and is currently working on building the ninth tallest building in the entertainment district of Kumon-mi."
    },
    {
      "character": "Imani",
      "text": "Again, that is not true."
    },
    {
      "character": "narrator",
      "text": "Additionally, she holds a 40%% stake in Google’s parent company, Alphabet, and sits on not just one board of directors, but nineteen of them across a variety of different sectors."
    },
    {
      "character": "Imani",
      "text": "Why is this still going?"
    },
    {
      "character": "narrator",
      "text": "She’s here today with the hope of landing a major deal that will generate enough profit for her to open up a bakery where she will create exclusively bird-shaped cakes."
    },
    {
      "character": "Imani",
      "text": "Uhh-"
    },
    {
      "character": "narrator",
      "text": "And this is Sensei."
    },
    {
      "character": "Sensei",
      "text": "Hi."
    },
    {
      "character": "narrator",
      "text": "Together...{i}they{/i} are the sharks. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "On the bright side, at least we know where all of your screen time went."
    },
    {
      "character": "narrator",
      "text": "This is Nodoka Nagasawa, a budding entrepreneur from the border of Kumon-mi who is hoping to receive an investment from one of the sharks for her company, NODOKorp."
    },
    {
      "character": "narrator",
      "text": "Nodoka is seeking a $400,000 stake in exchange for 10%% of her company — valuing it at $4,000,000."
    },
    {
      "character": "Nodoka",
      "text": "I believe my ideas are worth a bit more than that. But I suppose I will leave it up to our judges to decide. "
    },
    {
      "character": "Imani",
      "text": "We don’t have to actually pay for this if we decide to go in, do we? Because I’m finna go out right now."
    },
    {
      "character": "Tsubasa",
      "text": "You don’t have to pay at all if you don’t decide to invest. Miss Nagasawa is simply looking for a platform to launch her company off of, and I would recommend only investing if you believe in the cause."
    },
    {
      "character": "Sensei",
      "text": "Not to be a downer, but her {i}cause{/i} looks a little...{i}off{/i} to me."
    },
    {
      "character": "Nodoka",
      "text": "Hiya, Sharks. My name is Nodoka Nagasawa...and I am here today with not just a business opportunity, but a chance for you to {i}change lives.{/i}"
    },
    {
      "character": "Nodoka",
      "text": "Sharks, did you know that over {i}six billion{/i} people in the world enjoy sex? That’s almost all of them."
    },
    {
      "character": "Nodoka",
      "text": "And if any of you are like me, I’m sure {i}you{/i} enjoy sex as well. But, let’s face it. Who doesn’t?"
    },
    {
      "character": "Nodoka",
      "text": "The thing is, it’s not enough to just have plain old sex anymore. "
    },
    {
      "character": "Nodoka",
      "text": "Japan’s reproductive rate is rapidly declining...and no one has been willing to step in and rekindle that flame."
    },
    {
      "character": "Nodoka",
      "text": "Until today."
    },
    {
      "character": "Nodoka",
      "text": "Sharks, I am seeking $400,000 in exchange for 10%% of my premiere dildo company, NODOKorp."
    },
    {
      "character": "Tsukasa",
      "text": "Mother, what is a dildo?"
    },
    {
      "character": "Tsubasa",
      "text": "It’s a toy designed for adults, dear."
    },
    {
      "character": "Tsukasa",
      "text": "If I be good, can I have one for Christmas?"
    },
    {
      "character": "Tsubasa",
      "text": "Ask Santa, dear. I will not speak about this any more."
    },
    {
      "character": "Imani",
      "text": "Uhh...okay. I guess I’ll open up the floor with questions. What exactly is it about NODOKorp that stands out against your competitors? "
    },
    {
      "character": "Imani",
      "text": "And how is a rubber dick going to make Japan’s reproductive rate go up?"
    },
    {
      "character": "Nodoka",
      "text": "Both excellent questions."
    },
    {
      "character": "Nodoka",
      "text": "You see, before attempting to solve a problem, you need to first understand where that problem comes from."
    },
    {
      "character": "Nodoka",
      "text": "Our declining birthrate isn’t due to an issue with infertility. And it’s not due to an issue concerning lack of knowledge either."
    },
    {
      "character": "Nodoka",
      "text": "The problem is that our people don’t {i}want{/i} to have sex. So the obvious course of action would be to {i}make{/i} them want to have sex, correct?"
    },
    {
      "character": "Imani",
      "text": "Uhh...sure. But how do {i}your{/i} products make {i}us{/i} want to bone?"
    },
    {
      "character": "Nodoka",
      "text": "By appealing to the one thing that gets {i}everyone{/i} horny-"
    },
    {
      "character": "Nodoka",
      "text": "Multiple women having sex at the same time."
    },
    {
      "character": "Imani",
      "text": "I’m out. Too sketchy. "
    },
    {
      "character": "Nodoka",
      "text": "Shame. I haven’t even handed out samples yet."
    },
    {
      "character": "Tsukasa",
      "text": "Forget about the samples, let’s talk numbers. How many units have you sold year to date? And how many do you expect to ship next year?"
    },
    {
      "character": "Tsubasa",
      "text": "Tsukasa, I forbid you to invest in an adult entertainment-"
    },
    {
      "character": "Tsukasa",
      "text": "Quiet. I’m talking business right now."
    },
    {
      "character": "Nodoka",
      "text": "Year to date, NODOKorp has sold and shipped roughly sixteen thousand units, with an estimated fifty-thousand expected to go out next year."
    },
    {
      "character": "Imani",
      "text": "Jesus fuck, how?"
    },
    {
      "character": "Tsukasa",
      "text": "That’s over a 300%% increase. Are you going to be able to keep up with that level of demand? Or will aiding production be what my $400,000 goes to?"
    },
    {
      "character": "Nodoka",
      "text": "That’s precisely what I will be using the money on. With $400,000, NODOKorp will be able to switch to an overseas manufacturer and cut our production costs by roughly 60%%. "
    },
    {
      "character": "Tsukasa",
      "text": "Why can’t you switch now? Do they require a minimum order? "
    },
    {
      "character": "Nodoka",
      "text": "They do. And for each individual design nonetheless. "
    },
    {
      "character": "Nodoka",
      "text": "Thankfully, NODOKorp is on the brink of launching our next product, the {i}quadrildo,{/i} which will revolutionize this industry and has the capability to ship over 200,000 units just three years from now."
    },
    {
      "character": "Tsubasa",
      "text": "Could you tell us a little more about this- dear God, what is that thing?"
    },
    {
      "character": "Nodoka",
      "text": "{i}This{/i} is the quadrildo or, as I like to call it, the next step in sex technology."
    },
    {
      "character": "Nodoka",
      "text": "It combines two double-sided dildos into one-"
    },
    {
      "character": "Imani",
      "text": "Yeah, we can see how it works."
    },
    {
      "character": "Tsukasa",
      "text": "Excuse me, but aren’t you out? Either come back in or keep your mouth shut."
    },
    {
      "character": "Imani",
      "text": "The fuck is up with kids nowadays?"
    },
    {
      "character": "Sensei",
      "text": "Nodoka, as excited as I am about the prospect of four women using that thing at the same time, I’m not really sure if it will address the reproduction issue like you said it would."
    },
    {
      "character": "Nodoka",
      "text": "Sensei, are you telling me that watching all of the women in this room indulge in the wonders of the quadrildo {i}wouldn’t{/i} make you want to impregnate one of us?"
    },
    {
      "character": "Sensei",
      "text": "I am. "
    },
    {
      "character": "Sensei",
      "text": "Combine that with the fact that it’s a product I’d have no personal use for and...I’m sorry to say it, but I’m out."
    },
    {
      "character": "Tsubasa",
      "text": "Miss Nagasawa, that is certainly an...interesting product you have there."
    },
    {
      "character": "Tsubasa",
      "text": "But unfortunately, I’m already invested in another company in this industry as of last night, which would make this a conflict of interest for me."
    },
    {
      "character": "Tsubasa",
      "text": "So, for that reason...I am out."
    },
    {
      "character": "Nodoka",
      "text": "I see."
    },
    {
      "character": "Nodoka",
      "text": "I suppose it comes down to this, then. "
    },
    {
      "character": "Nodoka",
      "text": "Do you have any more questions for me, little Miss Tsukioka? Or are you ready to pound your worries away with NODOkorp?"
    },
    {
      "character": "Tsukasa",
      "text": "That’s not your slogan, is it?"
    },
    {
      "character": "Nodoka",
      "text": "It is."
    },
    {
      "character": "Tsukasa",
      "text": "Terrible. That needs to change."
    },
    {
      "character": "Tsukasa",
      "text": "But...I’m going to make you an offer."
    },
    {
      "character": "Tsubasa",
      "text": "Tsukasa, please."
    },
    {
      "character": "Tsukasa",
      "text": "I’ll give you the $400,000 you’re asking for..."
    },
    {
      "character": "Tsukasa",
      "text": "But I want 40%% of the company."
    },
    {
      "character": "Nodoka",
      "text": "That cuts the valuation of my business to a mere one million dollars. And with a total addressable market of over six billion people, I believe it’s worth a great deal more than that."
    },
    {
      "character": "Tsukasa",
      "text": "As do I. Which is why I’m also willing to make a royalty deal."
    },
    {
      "character": "Tsukasa",
      "text": "I can cut my equity down to 20%% so long as I receive royalties on every product sold for the next five years at $5 a unit. "
    },
    {
      "character": "Tsukasa",
      "text": "That way, if you {i}do{/i} hit your projected goal of 50,000 units next year, I’ll already be close to recouping my initial investment...while you’ll be ramping up production."
    },
    {
      "character": "Nodoka",
      "text": "That still seems a bit too steep when you factor in the additional royalties you’ll be receiving for the subsequent four years."
    },
    {
      "character": "Tsukasa",
      "text": "It does, but you need me more than I need you. So my offer is firm and you can take it or leave it."
    },
    {
      "character": "Nodoka",
      "text": "Would you perhaps be willing to shorten that royalty deal to-"
    },
    {
      "character": "Tsukasa",
      "text": "I’m out."
    },
    {
      "character": "Nodoka",
      "text": "Very well."
    },
    {
      "character": "Nodoka",
      "text": "Thank you all for your time...and for your continued interest in NODOKorp."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Hey kids! Do you want a mobile game that rewards you every day for just logging on?!"
    },
    {
      "character": "narrator",
      "text": "One with graphics that’ll make your dick so hard it can cut diamonds and then grow a mouth to EAT those diamonds so it becomes a super strong DIAMOND DICK?"
    },
    {
      "character": "narrator",
      "text": "Then how about trying RAID SHADOW LEGENDS? The number one mobile game that’s sure to make girls like you and your parents proud of you again!"
    },
    {
      "character": "narrator",
      "text": "Here’s a real testimonial from a real mom whose real son started playing RAID SHADOW LEGENDS!"
    },
    {
      "character": "Totally Legitimate Mother (Mary)",
      "text": "Hi I am a totally legitimate mother whose son started playing RAID SHADOW LEGENDS recently"
    },
    {
      "character": "Totally Legitimate Mother (Mary)",
      "text": "Ever since little Jimmy started playing RAID SHADOW LEGENDS he has stopped eating dinner at the table and it is tearing our family apart"
    },
    {
      "character": "Totally Legitimate Mother (Mary)",
      "text": "All day long I hear the screams of dying orcs and all of the girls that he is having sex with and it is making me question my abilities as a mother"
    },
    {
      "character": "Totally Legitimate Mother (Mary)",
      "text": "Please Plarium Games make him stop I do not know how much more our family can take of this I just want my child back"
    },
    {
      "character": "narrator",
      "text": "Doesn’t that sound like an AWESOME FUCKING GAME? Or are you going to be a little bitch like Jimmy’s mom and just hold a soccer ball all day?!"
    },
    {
      "character": "narrator",
      "text": "Don’t be a CUCK! Play RAID SHADOW LEGENDS NOW!"
    },
    {
      "character": "narrator",
      "text": "Meet Yumi Yamaguchi — a struggling entrepreneur with an extensive background in business management and customer relations."
    },
    {
      "character": "Yumi",
      "text": "Who the fuck are you? Get that fucking camera out my face."
    },
    {
      "character": "narrator",
      "text": "Yumi Yamaguchi is looking for $100,000 in exchange for a 51%% controlling stake in her social networking company, Study Buddy."
    },
    {
      "character": "Yumi",
      "text": "Yo! I told you to get that fucking camera out of my face, asshole!"
    },
    {
      "character": "narrator",
      "text": "Starting at a very young age, Yumi faced a great deal of opposition in terms of-"
    },
    {
      "character": "Yumi",
      "text": "That’s it! You’re dead!"
    },
    {
      "character": "Yumi",
      "text": "Uhh...hi."
    },
    {
      "character": "Yumi",
      "text": "Anybody have any idea how much that camera I just broke costs? Because I think I’ve gotta add the price of that to the money I need from you guys."
    },
    {
      "character": "Tsubasa",
      "text": "Oh my...I believe it was somewhere in the realm of seven thousand dollars."
    },
    {
      "character": "Yumi",
      "text": "Then hi. I’m Yumi Yamaguchi and I’m here today looking for $107,000 in exchange for 51%% of my company, Study Buddy."
    },
    {
      "character": "Yumi",
      "text": "I’m sure that at least two of you are surprised to see me given uhh...recent circumstances and shit. But Nodoka is a fucking cunt and I want to beat her, so that’s why I’m here today."
    },
    {
      "character": "Imani",
      "text": "Luckily for you, I can’t imagine that will be very hard!"
    },
    {
      "character": "Tsubasa",
      "text": "Tell us a bit about your company, dear. What is it that “Study Buddy” does?"
    },
    {
      "character": "Yumi",
      "text": "Let me start by saying I had no idea I was supposed to make a logo or give out samples or anything like that."
    },
    {
      "character": "Tsukasa",
      "text": "Talk about unprepared."
    },
    {
      "character": "Yumi",
      "text": "Fuck off, brat."
    },
    {
      "character": "Yumi",
      "text": "So, uhh...right. Sales pitch. Let’s see here..."
    },
    {
      "character": "Yumi",
      "text": "S...Sharks, how many times has this happened to you?"
    },
    {
      "character": "Yumi",
      "text": "You’re sitting in your room...all alone and shit. And you’re a fucking idiot, so you’re just...kind of existing and being worthless and crap."
    },
    {
      "character": "Imani",
      "text": "Finally, a product I can relate to."
    },
    {
      "character": "Sensei",
      "text": "I’m pretty sure you could have figured out a way to relate to the four-sided dildo as well."
    },
    {
      "character": "Yumi",
      "text": "Well...Study Buddy aims to solve that problem by...giving even the most worthless of people a reason to both exist {i}and{/i} make money."
    },
    {
      "character": "Yumi",
      "text": "It’s no secret that dating apps and shit like that have become the way of the future."
    },
    {
      "character": "Yumi",
      "text": "And in a society that’s moving closer to no one ever having to leave their house again, an app needs to be at the...fuck, what was the word again?"
    },
    {
      "character": "Yumi",
      "text": "Oh, yeah. The {i}forefront{/i} of innovation in regard to its...respective sector?"
    },
    {
      "character": "Yumi",
      "text": "Study Buddy...uhh...aims to connect students of all ages with both tutors and friends and...babysitters or...whatever else a customer needs."
    },
    {
      "character": "Yumi",
      "text": "Like...I don’t know. Maybe if you want your house cleaned or some shit too? I ain’t really ironed out all the kinks yet."
    },
    {
      "character": "Tsubasa",
      "text": "Is Study Buddy partnered with licensed teachers, caretakers, tutors...etcetera? Or is this something that anyone can sign up for at their own leisure?"
    },
    {
      "character": "Yumi",
      "text": "Well, I ain’t sure I’d call it “leisure” since the whole object is to make money from people who need some kind of shit done for them."
    },
    {
      "character": "Yumi",
      "text": "So, that in mind, I guess anybody can sign up if they want. Just like, put your name down and say what you’re willing to do for how much and...hope somebody pays you."
    },
    {
      "character": "Tsubasa",
      "text": "What systems are in place to prevent users from utilizing Study Buddy for nefarious purposes like prostitution or drug sales?"
    },
    {
      "character": "Yumi",
      "text": "Oh, we tell you not to do that shit in the ToS. And no one has ever broken any rules in any ToS before so we’re good."
    },
    {
      "character": "Tsubasa",
      "text": "Excellent. I see you’ve done your research."
    },
    {
      "character": "Tsukasa",
      "text": "But why the name “Study Buddy” if the platform is not centered solely around studying?"
    },
    {
      "character": "Yumi",
      "text": "I figured a name that’s easy to remember and kid-friendly would be best since that’s the target demographic and shit."
    },
    {
      "character": "Imani",
      "text": "It’s an app to...extort children?"
    },
    {
      "character": "Yumi",
      "text": "It ain’t extortion if they’re gettin’ somethin’ outta the deal, right? And credit card info is needed in order to hire anybody, so it’d be the parent’s money and not the actual kids anyway."
    },
    {
      "character": "Tsubasa",
      "text": "Interesting. But why develop a product like this? What’s the story behind it?"
    },
    {
      "character": "Yumi",
      "text": "Story’s boring. Just wish I had something like this when I was a kid so I wouldn’t have had to teach myself how to read and all that."
    },
    {
      "character": "Yumi",
      "text": "If I could’ve just swiped my dad’s card and hired somebody to come hang out with me or teach me words and shit, I probably would have wound up a little less shitty."
    },
    {
      "character": "Imani",
      "text": "That’s a nice story and all, but the fact that you’re willing to give up 51%% of your company in exchange for just $100,000 tells me you might not {i}believe{/i} in the product."
    },
    {
      "character": "Sensei",
      "text": "Why are you suddenly so into this?"
    },
    {
      "character": "Imani",
      "text": "When in Rome, bruh."
    },
    {
      "character": "Yumi",
      "text": "Oh, I had a response to this. Uhh..."
    },
    {
      "character": "Yumi",
      "text": "Right! Yeah. So, what I’m selling ain’t really a business yet. It’s an {i}idea.{/i} Which is why I’m willing to give up a controlling share of it."
    },
    {
      "character": "Yumi",
      "text": "Past experiences have shown me that I don’t know the first thing when it comes to running a business. So I’m probably more suited to just, like...coming up with shit, you know?"
    },
    {
      "character": "Yumi",
      "text": "If I can focus on, uhh...more ideas or whatever, I can see this thing maybe kind of possibly working or something."
    },
    {
      "character": "Imani",
      "text": "Unfortunately, Yumi...I’m not interested in investing in a product that will “maybe kind of possibly work or something.” So, for that reason...I am out."
    },
    {
      "character": "Yumi",
      "text": "Cool, you ain’t got the money anyway."
    },
    {
      "character": "Tsubasa",
      "text": "Let’s talk a little about monetization as you’ve made it clear you have no sales yet."
    },
    {
      "character": "Tsubasa",
      "text": "In this vision of yours, where Study Buddy is used as a platform for freelance workers, how do you generate revenue?"
    },
    {
      "character": "Yumi",
      "text": "I figured we’d just take a cut or something. I ain’t really good when it comes to numbers."
    },
    {
      "character": "Yumi",
      "text": "We could probably charge some sort of subscription fee too and-"
    },
    {
      "character": "Tsukasa",
      "text": "I’m going to make you an offer, but you have to say yes right now."
    },
    {
      "character": "Tsubasa",
      "text": "Tsukasa?"
    },
    {
      "character": "Yumi",
      "text": "Wait, right now? But I haven’t even heard the offer yet."
    },
    {
      "character": "Tsukasa",
      "text": "Miss...Yamaguchi, was it?"
    },
    {
      "character": "Yumi",
      "text": "You were calling me Yumi literally all day yesterday."
    },
    {
      "character": "Tsukasa",
      "text": "I think this app of yours is a great idea...and one that I can see myself using as I also find myself getting lonely at times."
    },
    {
      "character": "Tsukasa",
      "text": "But it’s evident that all of the actual {i}work{/i} still needs to be done as, according to my notes, all you have come up with is an idea and a name."
    },
    {
      "character": "Tsukasa",
      "text": "Which is fine...as all of the major conglomerates out there were once {i}just{/i} ideas as well."
    },
    {
      "character": "Tsukasa",
      "text": "The issue is, no {i}idea{/i} is worth the amount of money you’re asking for.  And developing this app alone will take much more than that."
    },
    {
      "character": "Yumi",
      "text": "Still haven’t heard the offer."
    },
    {
      "character": "Tsukasa",
      "text": "I’ll give $10,000 for 100%% of your {i}idea,{/i} which can hardly be called a company."
    },
    {
      "character": "Tsubasa",
      "text": "Tsukasa, that’s nearly your whole allowance."
    },
    {
      "character": "Tsukasa",
      "text": "And, to be honest, that’s an extremely generous offer as I could just {i}take{/i} your idea since there’s nothing proprietary about it."
    },
    {
      "character": "Tsubasa",
      "text": "I, too, would like to make you-"
    },
    {
      "character": "Tsukasa",
      "text": "Don’t listen to her. If you listen to her offer, I’m out."
    },
    {
      "character": "Tsubasa",
      "text": "I am your {i}mother.{/i} I reserve the right to-"
    },
    {
      "character": "Yumi",
      "text": "You’ve got a deal!"
    },
    {
      "character": "Tsukasa",
      "text": "Yay!"
    },
    {
      "character": "Tsubasa",
      "text": "Oh, gosh darn it. I would have given her what she asked for."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Tsukasa",
      "text": "An excellent presentation for your first time, Miss Yamaguchi. I take it a certain...pre-existing business partner of mine was involved in its creation as well?"
    },
    {
      "character": "Yumi",
      "text": "Yup. Chinami and I stayed up late last night going over all of the details. Pleasure doing business with you, brat."
    },
    {
      "character": "Tsukasa",
      "text": "Likewise. I’ll have my people reach out to your people and wire the money over by the end of the day."
    },
    {
      "character": "Yumi",
      "text": "Uhh...but what if I ain’t got “people?”"
    },
    {
      "character": "Tsukasa",
      "text": "Mother! Can I have an advance on next week’s allowance?"
    },
    {
      "character": "Tsubasa",
      "text": "That depends. Can I have 10%% of Study Buddy?"
    },
    {
      "character": "Tsukasa",
      "text": "Can you wait until next week?"
    },
    {
      "character": "Yumi",
      "text": "Yeah. One more week of bein’ poor ain’t nothing to me."
    },
    {
      "character": "Tsukasa",
      "text": "Nevermind, Mother! Your assistance is no longer needed!"
    },
    {
      "character": "Tsubasa",
      "text": "Darn it again!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "Congrats, Yumi. I haven’t seen that much money at once since the last time I robbed a bank."
    },
    {
      "character": "Sensei",
      "text": "Yeah. That was a surprisingly...{i}good(?){/i} presentation."
    },
    {
      "character": "Yumi",
      "text": "Thanks..."
    },
    {
      "character": "Imani",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "I don’t think she wants to talk to us."
    },
    {
      "character": "Sensei",
      "text": "Maybe...let me handle this, Imani. You can go back to organizing assorted Dorm Wars things."
    },
    {
      "character": "Imani",
      "text": "Roger. And remember, if shit hits the fan, make sure your thumbs aren’t tucked into your fists when you have to punch. Got it?"
    },
    {
      "character": "Sensei",
      "text": "Got it..."
    },
    {
      "character": "narrator",
      "text": "Imani walks away and-"
    },
    {
      "character": "Yumi",
      "text": "Didn’t realize you were gonna be here."
    },
    {
      "character": "narrator",
      "text": "And things go back to normal."
    },
    {
      "character": "Sensei",
      "text": "It wouldn’t really make sense for me {i}not{/i} to be here when I’m the prize."
    },
    {
      "character": "Sensei",
      "text": "I’m glad you were able to show up, though. I’ll admit that I didn’t think you were-"
    },
    {
      "character": "Yumi",
      "text": "I ain’t ready to talk to you yet."
    },
    {
      "character": "Yumi",
      "text": "And, honestly, not sure when I {i}will{/i} be."
    },
    {
      "character": "Yumi",
      "text": "Out of all of the horrible shit you’ve done to me...that was a new low. A low I didn’t think that even someone like {i}you{/i} would ever touch."
    },
    {
      "character": "Yumi",
      "text": "So, yeah. I came to your stupid, little contest. But I did it for {i}me.{/i} And it would be really fucking cool if we could go back to ignoring each other now."
    },
    {
      "character": "Yumi",
      "text": "Finally have a little peace for the first time in my fucking life and-"
    },
    {
      "character": "Chika",
      "text": "Yumi! You did it! Oh my God! What are you going to do with all of that money?!"
    },
    {
      "character": "Yumi",
      "text": "Well, the first step is converting it to yen. After that, no fucking clue."
    },
    {
      "character": "Chika",
      "text": "I’m so happy for you! I knew you could do it! And I’m so glad I didn’t have to since I, like...totally would have dropped the ball!"
    },
    {
      "character": "Yumi",
      "text": "Guess I ain’t totally worthless after all, huh?"
    },
    {
      "character": "Nodoka",
      "text": "Congratulations, Yumi. You did an excellent job and should be proud of yourself."
    },
    {
      "character": "Nodoka",
      "text": "I must know, though...do you plan on listing your services on the finalized Study Buddy app? Because I’d be more than willing to hire you for all sorts of-"
    },
    {
      "character": "Nodoka",
      "text": "Oh, okay. See you later then."
    },
    {
      "character": "Chika",
      "text": "Hah...just leave her alone, Nodoka. It’s clear she doesn’t want anything to do with you and you’re just going to make things worse for yourself."
    },
    {
      "character": "Nodoka",
      "text": "What? I was simply hoping to hire someone to teach me self defense for the next time I am beaten within inches of my life."
    },
    {
      "character": "Sensei",
      "text": "Not right now, Nodoka."
    },
    {
      "character": "Nodoka",
      "text": "When would be a better time? Children and Yakuza aren’t the only ones who get lonely, you know?"
    },
    {
      "character": "Chika",
      "text": "He said beat it."
    },
    {
      "character": "Nodoka",
      "text": "Right now? But that would risk soiling my kimono."
    },
    {
      "character": "Chika",
      "text": "Nodoka-"
    },
    {
      "character": "Nodoka",
      "text": "Fine, fine. I’ll leave you two alone."
    },
    {
      "character": "Nodoka",
      "text": "But, should you find yourself utilizing that time to get a little {i}closer{/i} to one another, please feel free to help yourself to the table of quadrildos in the room next to this one."
    },
    {
      "character": "Nodoka",
      "text": "Farewell, friends."
    },
    {
      "character": "Chika",
      "text": "Hah..."
    },
    {
      "character": "Chika",
      "text": "That girl is so fucking weird."
    }
  ],
  "state_changes": {
    "dormwartwo13": {
      "from": null,
      "to": true
    }
  }
}