{
  "event_id": 130,
  "event_label": "chikalust25skip",
  "dialogue": [
    {
      "character": "Chika",
      "text": "So, now what? "
    },
    {
      "character": "Chika",
      "text": "We’ve got like forty-five minutes before we need to start heading over to the next contest. And I’m pretty sure the Tsukioka kitchen staff is setting up a buffet for everybody before that happens."
    },
    {
      "character": "Chika",
      "text": "If you don’t have anything else going on, want to head over there with me? "
    },
    {
      "character": "Chika",
      "text": "Or would you rather I walk ten steps behind you the whole way so no one gets any ideas about us dating? Which is a thing we are totally not doing."
    },
    {
      "character": "Sensei",
      "text": "Chika-"
    },
    {
      "character": "Chika",
      "text": "Fine, fine. Twenty steps. But that’s my final offer."
    },
    {
      "character": "Sensei",
      "text": "I think we can manage to walk to whatever fancy dining hall the Tsukiokas have without anyone thinking we are having sex."
    },
    {
      "character": "Chika",
      "text": "Sex? Me? Nuh-uh. Not until marriage, Sensei. But I {i}guess{/i} I can find the time to accompany you to the buffet."
    },
    {
      "character": "Sensei",
      "text": "You {i}guess?{/i} You’re the one who invited me."
    },
    {
      "character": "Chika",
      "text": "Only because I feel bad that you’re all alone, obviously. It doesn’t have anything to do with that fact that I, the reigning Dorm Wars date champion, have barely gotten to spend time with you the last couple days."
    },
    {
      "character": "Sensei",
      "text": "You do realize there is a new champion, right?"
    },
    {
      "character": "Chika",
      "text": "Sure, but...come on. We all know who the {i}real{/i} champion is."
    },
    {
      "character": "Chika",
      "text": "Hint, {i}it’s the one who lets you cum inside of her.{/i}"
    },
    {
      "character": "narrator",
      "text": "Chika and I exit whatever room I was kidnapped and tossed into and I am forced to follow her on account of having no idea where I am."
    },
    {
      "character": "narrator",
      "text": "Sure, I’ve toured at least part of the place before, but when your house is so big that it requires a GPS to get around, it’s easy to find yourself being completely and utterly lost."
    },
    {
      "character": "Chika",
      "text": "Oh, we have to go left down the next hallway in order to make it to the dining hall?"
    },
    {
      "character": "Sensei",
      "text": "How do you even remember that? This place is only half a step away from being a full-on maze."
    },
    {
      "character": "Chika",
      "text": "Hm? Did you not download the Tsukioka Manor app? There’s a whole map built in."
    },
    {
      "character": "narrator",
      "text": "Oh. So I guess it actually {i}does{/i} require a GPS to get around."
    },
    {
      "character": "narrator",
      "text": "Regardless, we make it to the dining hall after a five minute walk and spend the next half hour gorging ourselves on food we can not pronounce until it is finally time to leave..."
    },
    {
      "character": "narrator",
      "text": "{i}Yumi’s affection has increased to [yumi_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Nodoka’s affection has increased to [nodoka_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}First Floor: [dorm1war2points]\\nSecond Floor: [dorm2war2points]{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "chikalust25skip": {
      "from": null,
      "to": true
    }
  }
}