{
  "event_id": 131,
  "event_label": "dormwartwo14",
  "dialogue": [
    {
      "character": "narrator",
      "text": "{i}Roughly fifteen minutes later...at a bar with a horrible name...{/i}"
    },
    {
      "character": "Noriko",
      "text": "Ladies and...oh. I guess Sensei isn’t here yet. So...just ladies, then!"
    },
    {
      "character": "Noriko",
      "text": "Please feast your eyes on the amazing...outstanding...and only {i}mildly{/i} incorrigible...Kirin Kanda! "
    },
    {
      "character": "Kirin",
      "text": "That’s right, that’s right. It is I, Kirin Kanda, who has located the trophy and brought home one more point to the lovely ladies of the second floor."
    },
    {
      "character": "Kirin",
      "text": "Please hold your applause as I already know how great I am. But, if any of you find yourself absolutely {i}needing{/i} to congratulate me in some way, please note that I will always accept massages. Thank you."
    },
    {
      "character": "Ami",
      "text": "And please don’t feast your eyes on me...Ami Arakawa. The loser."
    },
    {
      "character": "Ayane",
      "text": "They...{i}did{/i} have an unfair advantage with Noriko on their team considering that she’s from the area and whatnot..."
    },
    {
      "character": "Noriko",
      "text": "But it was not {i}me{/i} who found the treasure, it was Kirin! All by herself without any assistance at all!"
    },
    {
      "character": "Kirin",
      "text": "That’s right. I didn’t find this because of Noriko. I found it because of my deep connection to Miku and my ability to sniff out her scent from miles away."
    },
    {
      "character": "Noriko",
      "text": "Exactly. But, to be fair, Miku’s so far into gyarudom right now that anyone could smell her perfume from miles away."
    },
    {
      "character": "Makoto",
      "text": "Please leave Miku alone as it’s her first time doing such things and that there will likely be several mistakes."
    },
    {
      "character": "Noriko",
      "text": "How’d things go on your end, Ayane? I mean...you obviously didn’t find the trophy, but...did you guys have fun, at least?"
    },
    {
      "character": "Ayane",
      "text": "Uhh..."
    },
    {
      "character": "Ayane",
      "text": "I mean...{i}I{/i} had fun. But I think Ami’s a little down in the dumps since she wasn’t able to earn a point for us."
    },
    {
      "character": "Ami",
      "text": "Once again, the enemy has won while I have been forced to stand on the sidelines and pretend to be happy for them."
    },
    {
      "character": "Ayane",
      "text": "I don’t think anyone’s expecting you to pretend that, Ami."
    },
    {
      "character": "Ami",
      "text": "Good. Because I hate Kirin and Noriko now and I want their floor to collapse."
    },
    {
      "character": "Ayane",
      "text": "You realize we’d probably be killed if that ever happened, right?"
    },
    {
      "character": "Ami",
      "text": "Yes. But at least we’ll die {i}together.{/i}"
    },
    {
      "character": "Makoto",
      "text": "As exciting as it is to watch you all talk about how much fun you had, I’m going to need to see that trophy."
    },
    {
      "character": "Kirin",
      "text": "Why? Do you really think I would have gone to the effort of buying a fake one just to win some contest?"
    },
    {
      "character": "Makoto",
      "text": "No...I need to give it back to Miku."
    },
    {
      "character": "Kirin",
      "text": "{i}I{/i} will give it to Miku. Or rather, I will sell it back to her for a small price. Finders keepers."
    },
    {
      "character": "Makoto",
      "text": "Fine. Then I {i}do{/i} need to verify it’s the correct trophy as, even at the height of my disinterest in this year’s war, I still want to win...And what’s left of my life is still ruled by proper protocol."
    },
    {
      "character": "Kirin",
      "text": "Well, if any of us were having fun, we’re sure not now. Thanks for dragging the mood down, Makoto."
    },
    {
      "character": "Makoto",
      "text": "You’re very welcome. Now, please bring that here as I would like to go home."
    },
    {
      "character": "Noriko",
      "text": "Home? You’re leaving already? "
    },
    {
      "character": "Noriko",
      "text": "Don’t we still have a handful of competitions left?"
    },
    {
      "character": "Makoto",
      "text": "We do. But I’m not needed for any of them and I’ve already fulfilled my purpose in orchestrating and finalizing the scavenger hunt."
    },
    {
      "character": "Makoto",
      "text": "And seeing as the scavenger hunt is now over, so is my job. Thank you for relieving me of what little responsibility I had this year. It’s been fun. Except for the fact that it hasn’t."
    },
    {
      "character": "Kirin",
      "text": "You know I was just fucking around when I said you were dragging the mood down, right? It’s not like I actually want you to leave."
    },
    {
      "character": "Noriko",
      "text": "Yeah, stick around for a little while. You can hang out with us."
    },
    {
      "character": "Makoto",
      "text": "That’s very kind of you, but I’ll have to respectfully decline. My sleep schedule has become rather unpredictable lately and I’m still in the process of getting things back to normal."
    },
    {
      "character": "Makoto",
      "text": "As such, I’ve found it best to just capitalize on every opportunity where I actually {i}want{/i} to sleep."
    },
    {
      "character": "Makoto",
      "text": "That said, I will likely fail and find myself back here before the night’s end. But, for now?...No thank you."
    },
    {
      "character": "Noriko",
      "text": "You try taking sleeping pills or anything? My sister had insomnia for a while and seemed to do a little better on those."
    },
    {
      "character": "Makoto",
      "text": "Do you...actually have any?"
    },
    {
      "character": "Noriko",
      "text": "Yeah. I’ve got a whole pharmacy in my bag. "
    },
    {
      "character": "Makoto",
      "text": "I see no bag."
    },
    {
      "character": "Noriko",
      "text": "Sorry. I {i}normally{/i} have a whole pharmacy in my bag. But right now, I’ve just got all of my essentials strapped to my upper thigh. Pocket knife, tampons, pills, 4x7 pictures of Sensei...you name it, I’ve got it."
    },
    {
      "character": "Kirin",
      "text": "You’re like some kind of prison contraband dealer."
    },
    {
      "character": "Noriko",
      "text": "Thanks! I really appreciate that."
    },
    {
      "character": "Makoto",
      "text": "Yeah, I’m good on thigh-pills. But thanks for the offer. "
    },
    {
      "character": "Kirin",
      "text": "What else do you have down there?"
    },
    {
      "character": "Noriko",
      "text": "Cell phone...glasses...second pocket knife...a bag of gummy bears...normal stuff."
    },
    {
      "character": "Kirin",
      "text": "How do you even walk with all of that on you?"
    },
    {
      "character": "Noriko",
      "text": "I normally don’t. I am doing this for the sake of the costume and if something happens to chafe or cut my leg, I’ll just deal with it until I get back to the dorm and can patch myself up."
    },
    {
      "character": "Kirin",
      "text": "You gonna be able to wait that long? Cause I’m pretty sure that’s happened already judging by the blood trickling down your leg."
    },
    {
      "character": "Noriko",
      "text": "That’s fine. I brought bandages too."
    },
    {
      "character": "Makoto",
      "text": "Maybe...apply one before you wind up staining the carpet."
    },
    {
      "character": "Noriko",
      "text": "Don’t need to! Brought shampoo for carpets as well in case something like this happened!"
    },
    {
      "character": "Kirin",
      "text": "How fucking big are your thighs?!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Oh, welcome back. How did your scavenger hunt go?"
    },
    {
      "character": "Ami",
      "text": "Let’s avoid that topic altogether for now. In fact, better question- how did {i}your{/i} contest go? Please tell me you won."
    },
    {
      "character": "Maya",
      "text": "I won."
    },
    {
      "character": "Ami",
      "text": "Oh, thank god. I was worried that you were going to be too embarrassed to actually do any maid stuff."
    },
    {
      "character": "Maya",
      "text": "You underestimate what I am willing to do for food."
    },
    {
      "character": "Ayane",
      "text": "The buffet tickets were really that important to you, huh?"
    },
    {
      "character": "Maya",
      "text": "Yes. Not to mention that being a maid is almost {i}excruciatingly{/i} easy and that the return on this investment makes it one of the best decisions I have ever made."
    },
    {
      "character": "Ami",
      "text": "Oh, thank god. I was worried that-"
    },
    {
      "character": "Maya",
      "text": "Unfortunately, I won by so much that I actually wound up losing."
    },
    {
      "character": "Ami",
      "text": "What?! How is that even possible?! That makes no sense!"
    },
    {
      "character": "Maya",
      "text": "It makes perfect sense when you remember who the judge of this competition is and how passionately he enjoys making my life hell."
    },
    {
      "character": "Ayane",
      "text": "Are you saying Sensei only voted against you because...he wanted to piss you off?"
    },
    {
      "character": "Maya",
      "text": "That is precisely what I am saying. And I’d likely be quite torn up about it if being a maid wasn’t the actual easiest thing I have ever had to do."
    },
    {
      "character": "Ami",
      "text": "Wait...{i}easy?!{/i} What do you mean {i}easy?!{/i} I work my butt off at that place!"
    },
    {
      "character": "Maya",
      "text": "Doing what? The same exact things you do at home but {i}without{/i} the actual “maid-like” parts? Because I’d call house-Ami more of a maid than maid-Ami."
    },
    {
      "character": "Maya",
      "text": "So long as you know how to talk and appeal to people, being a maid in a cafe is as simple as snapping your fingers and learning to draw a heart on a plate of eggs."
    },
    {
      "character": "Ami",
      "text": "Were you...actually good, though? Like...did you really do...maid-like stuff in front of Sensei?"
    },
    {
      "character": "Maya",
      "text": "Why? Are you jealous?"
    },
    {
      "character": "Ami",
      "text": "Yes, but I don’t know if I’m jealous of you for being the one to serve him or jealous of {i}him{/i} for being the one you served."
    },
    {
      "character": "Ayane",
      "text": "I would like service from maid Maya as well, please."
    },
    {
      "character": "Maya",
      "text": "It’s {i}Moe Moe Maya,{/i} thank you very much."
    },
    {
      "character": "Ami",
      "text": "Wow...you actually {i}did{/i} do it, didn’t you?"
    },
    {
      "character": "Maya",
      "text": "Again, the lengths I am willing to go to for food are quite dramatic."
    },
    {
      "character": "Maya",
      "text": "But that's enough about me. Tell me how things went for you guys."
    },
    {
      "character": "Ami",
      "text": "Well, it all started when-"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Tsuneyo",
      "text": "Is something the matter, Emerald Guardian? It is not like you to call for a guild meeting with only two members."
    },
    {
      "character": "Molly",
      "text": "Can we drop the act for a second, Tsuneyo?"
    },
    {
      "character": "Tsuneyo",
      "text": "Act?"
    },
    {
      "character": "Molly",
      "text": "I’ve gotta be mean to you for a minute and it’s gonna be mighty hard doing that with you calling me by my codename."
    },
    {
      "character": "Tsuneyo",
      "text": "I’m confused. Have I done something to anger you? Because I don’t believe I have acted out of the ordinary in any-"
    },
    {
      "character": "Molly",
      "text": "The bloody hell was that last night?"
    },
    {
      "character": "Tsuneyo",
      "text": "I believe the technical term is “Standing up comedy.” It is short for “Stand-up comedy,” which is a style of telling jokes that-"
    },
    {
      "character": "Molly",
      "text": "I obviously mean about the “jokes” you told. Those weren’t jokes {i}at all.{/i}"
    },
    {
      "character": "Molly",
      "text": "Do you have any idea how hard I worked to patch things up with the Herald of...with {i}Sensei?{/i}"
    },
    {
      "character": "Molly",
      "text": "Were you trying to ruin that? Do you not want me near him for some reason you have not yet disclosed to me?"
    },
    {
      "character": "Molly",
      "text": "You are supposed to be my best friend. I’m supposed to be able to trust you. You should have known how uncomfortable that would have made me and-"
    },
    {
      "character": "Molly",
      "text": "And..."
    },
    {
      "character": "Molly",
      "text": "Oh..."
    },
    {
      "character": "Tsuneyo",
      "text": "Are you referring to the jokes about the semen?"
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Tsuneyo",
      "text": "Molly?"
    },
    {
      "character": "Molly",
      "text": "Huh? Yeah. Those are the ones."
    },
    {
      "character": "Tsuneyo",
      "text": "I understand. But I did not think bringing those things up in such a setting would lead to such a reaction from you."
    },
    {
      "character": "Tsuneyo",
      "text": "There are many comedians who draw upon real life experiences to-"
    },
    {
      "character": "Molly",
      "text": "Have you not learned compassion in all of our time together?"
    },
    {
      "character": "Molly",
      "text": "Have you not learned the things that make me worried or uneasy? Or scared or nervous? Or any of that? Any of the things I have finally begun to move {i}past{/i} feeling on a daily basis?"
    },
    {
      "character": "Molly",
      "text": "Why would you wake those up? And for {i}laughs{/i} no less..."
    },
    {
      "character": "Molly",
      "text": "Am I a joke to you?"
    },
    {
      "character": "Molly",
      "text": "Or are you just {i}pretending{/i} to be oblivious right now?"
    },
    {
      "character": "Tsuneyo",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "Tsuneyo...talk to me."
    },
    {
      "character": "Tsuneyo",
      "text": "I am not good at that."
    },
    {
      "character": "Molly",
      "text": "What, and I am?"
    },
    {
      "character": "Molly",
      "text": "There are too many skill trees in life to spec into all of ‘em...and there are gonna be times when we’ve gotta dig into our spellbook and put stuff we forgot we even had onto the hotbar."
    },
    {
      "character": "Molly",
      "text": "What I’m trying to say is...just because we’re not good at certain things doesn’t mean we can avoid them forever if the mechanics of a fight call for them."
    },
    {
      "character": "Molly",
      "text": "It’s either that or we just give up. And if there is anything I have learned from my time in Elden Ring, it is that Malenia is not going to just kill herself."
    },
    {
      "character": "Molly",
      "text": "Peer into that inventory and see what you’ve got, Tsuneyo. Because there’ll always be something that’ll help...and whatever that something is is a little different for everybody."
    },
    {
      "character": "Tsuneyo",
      "text": "I do not understand any of what you just said, but I will do my best to explain my actions."
    },
    {
      "character": "Tsuneyo",
      "text": "One year ago, my inattentiveness and disregard for your safety led to you being harmed."
    },
    {
      "character": "Tsuneyo",
      "text": "And while you have chosen to believe that you were not harmed at all, it does not change what I saw and my thoughts on what may have happened that night."
    },
    {
      "character": "Tsuneyo",
      "text": "If I had only been there sooner, I could have prevented-"
    },
    {
      "character": "Molly",
      "text": "It’s not your job to take care of me, Tsuneyo."
    },
    {
      "character": "Tsuneyo",
      "text": "But it is when you can not take care of yourself."
    },
    {
      "character": "Tsuneyo",
      "text": "Were you in the right state of mind to make decisions that night? Or were there multiple “debuffs” and “status effects” that disallowed you from acting of your own volition?"
    },
    {
      "character": "Tsuneyo",
      "text": "You are the first person other than my father that I have ever connected with. And it is my duty to protect you."
    },
    {
      "character": "Molly",
      "text": "How are you going to protect me from something that already happened?"
    },
    {
      "character": "Tsuneyo",
      "text": "By not letting it happen again."
    },
    {
      "character": "Molly",
      "text": "That’s not what you did."
    },
    {
      "character": "Molly",
      "text": "All you did was reawaken the uncertainties of that night in not just me, but in Sensei as well."
    },
    {
      "character": "Molly",
      "text": "I’m sure this will sound hard to believe, but I think that...he was just as much of a victim in that as I was."
    },
    {
      "character": "Molly",
      "text": "No one paid closer attention to him in the coming days than I did. Not even Ami. And the way he acted was not of a man who did something malicious, but of a man who had something malicious done to {i}him.{/i}"
    },
    {
      "character": "Molly",
      "text": "What if I was the one who forced his hand? And what if all of those “jokes” you told reminded him of that?"
    },
    {
      "character": "Molly",
      "text": "There’s far too much unknown about that night to justify telling stories about it. But even if all {i}was{/i} known, it would not be your story to tell."
    },
    {
      "character": "Tsuneyo",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "You really disappointed me, Tsuneyo..."
    },
    {
      "character": "Molly",
      "text": "I didn’t think that would ever happen with you."
    },
    {
      "character": "Tsuneyo",
      "text": "I apologize for my actions...but I can not rid my mind of the horrible state I saw you in that night."
    },
    {
      "character": "Tsuneyo",
      "text": "And saying what I did seemed like the only way to make it so I wasn’t the only one who knew anymore."
    },
    {
      "character": "Tsuneyo",
      "text": "The idea of anyone harming you is too much for me to bear. And I believe that anyone who does so should have to pay a price."
    },
    {
      "character": "Tsuneyo",
      "text": "But...as it appears my words were truly just taken as mere “jokes,” you don’t have anything to worry about..."
    },
    {
      "character": "Molly",
      "text": "I do, though. I have to worry about you doing that again."
    },
    {
      "character": "Tsuneyo",
      "text": "Molly..."
    },
    {
      "character": "Molly",
      "text": "Tell me you {i}won’t.{/i}"
    },
    {
      "character": "Molly",
      "text": "You can protect me all you want from things that haven’t happened yet, but don’t try rewriting the past and turning matters I have already settled into ones much greater than they wound up being."
    },
    {
      "character": "Tsuneyo",
      "text": "I don’t trust him with you anymore."
    },
    {
      "character": "Molly",
      "text": "Do you trust {i}me?{/i}"
    },
    {
      "character": "Tsuneyo",
      "text": "Of course."
    },
    {
      "character": "Molly",
      "text": "Then trust the {i}me{/i} who trusts {i}him.{/i}"
    },
    {
      "character": "Tsuneyo",
      "text": "..."
    },
    {
      "character": "Tsuneyo",
      "text": "What?"
    },
    {
      "character": "Molly",
      "text": "That quote works better in its original context and phrasing but, what I’m trying to say is just...let me decide things like this for myself."
    },
    {
      "character": "Molly",
      "text": "I wouldn’t care so much about my relationship with Sensei if he was not an important person to me."
    },
    {
      "character": "Molly",
      "text": "And, as another person who is very important to me, you have to understand that."
    },
    {
      "character": "Tsuneyo",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Tsuneyo",
      "text": "I will do my best."
    },
    {
      "character": "Tsuneyo",
      "text": "Please continue to be kind to me in the future."
    },
    {
      "character": "Molly",
      "text": "Of course..."
    },
    {
      "character": "Molly",
      "text": "And please let {i}me{/i} continue to dress you up in different outfits."
    },
    {
      "character": "Tsuneyo",
      "text": "Okay. But please stop groping me when I do so."
    },
    {
      "character": "Molly",
      "text": "Please don’t tell me how to live my life."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "dormwartwo14": {
      "from": null,
      "to": true
    },
    "dorm2war2points +": {
      "from": null,
      "to": 1
    }
  }
}