{
  "event_id": 135,
  "event_label": "dormwartwo18",
  "dialogue": [
    {
      "character": "Imani",
      "text": "Before we begin, I’d like to give one final shout-out to everyone who’s helped put this thing together! "
    },
    {
      "character": "Imani",
      "text": "The Tsukioka Foundation for providing multiple venues...the Produce Delivery Administration for providing both funding and vegetables that none of us ate...and Sara. For being a hot fucking mom."
    },
    {
      "character": "Sara",
      "text": "Woo!"
    },
    {
      "character": "Imani",
      "text": "Who also let us wrap things up here for what is apparently the second year in a row."
    },
    {
      "character": "Imani",
      "text": "But more importantly than that, I want to thank a good friend of mine..."
    },
    {
      "character": "Imani",
      "text": "Senpai Arakawa McSenseison!"
    },
    {
      "character": "Sensei",
      "text": "That is not my name."
    },
    {
      "character": "Imani",
      "text": "I don’t know your real name so that’s what you are to me."
    },
    {
      "character": "Ami",
      "text": "Woo!"
    },
    {
      "character": "Sara",
      "text": "That’s the spirit, Ami!"
    },
    {
      "character": "Sana",
      "text": "Mom...shh..."
    },
    {
      "character": "Imani",
      "text": "There’s no particular reason {i}for{/i} me to be thanking him considering I have done roughly 90%% of the work for this contest, but I’m doing so regardless because I am such a good friend."
    },
    {
      "character": "Rika",
      "text": "Woo! Kiss him!"
    },
    {
      "character": "Pretty Much Everyone Else",
      "text": "Don’t kiss him!"
    },
    {
      "character": "Imani",
      "text": "Jeez, guys. Tell me how you really feel."
    },
    {
      "character": "Imani",
      "text": "Anyway, due to unforeseen circumstances that have resulted in one of our participants going home early, the final vote for the Dorm Wars popularity poll will be held via the app after the costume contest."
    },
    {
      "character": "Imani",
      "text": "Results will be revealed after the tallies have been finalized in the morning, as well as the results for the rest of the war."
    },
    {
      "character": "Imani",
      "text": "That being said, the time has come for me to say goodbye."
    },
    {
      "character": "Imani",
      "text": "But do not weep for the days when my words would reach you through speakers funded by oligarchs and cabbage mongers...no. For our time together has only just-"
    },
    {
      "character": "Noriko",
      "text": "Bring on the costumes already!"
    },
    {
      "character": "Uta",
      "text": "N-No! Keep talking for as long as you want!"
    },
    {
      "character": "Imani",
      "text": "Ah-ah-ah! Careful, Uta! You swore an oath to not break character until you and Miku were finished-"
    },
    {
      "character": "Imani",
      "text": "Wait, where’d Miku go? I could have sworn I saw her there just a second ago."
    },
    {
      "character": "Uta",
      "text": "The...winds have carried her away to...the land of...water and...tile?"
    },
    {
      "character": "Imani",
      "text": "Bathroom break. Heard."
    },
    {
      "character": "Imani",
      "text": "Guess that means you’re up first, then!"
    },
    {
      "character": "Uta",
      "text": "If...If that is what must be done..."
    },
    {
      "character": "Imani",
      "text": "Then, without further ado..."
    },
    {
      "character": "Imani",
      "text": "Please welcome to the stage...Uta Ushibori as the unkillable kunoichi of Kumon-mi! A name I just made up right now! Be impressed!"
    },
    {
      "character": "Imani",
      "text": "Uta starts off strong with a standing...split-ish thingy that probably has some sort of cool name that I don’t know! But just look how flexible she is!"
    },
    {
      "character": "Uta",
      "text": "I have spent years in the countryside...watching stray cats roam the fields in search of their next meal...learning from them..."
    },
    {
      "character": "Uta",
      "text": "How to move without being detected...how to bend my body in ways that no regular human ever could...how to-"
    },
    {
      "character": "Imani",
      "text": "Yo. Costume contest. No speech required. Let me do my MC thing while you stand up there in that vertical spread eagle."
    },
    {
      "character": "Uta",
      "text": "Uhh...okay...but there is no telling how long this pose will last as even the unkillable kunoichi of Kumon-mi has her limits."
    },
    {
      "character": "Imani",
      "text": "As is required of this year’s costume contest, everything Uta is wearing is completely custom made. Or at least as custom made as something can be without being hand-sewn."
    },
    {
      "character": "Imani",
      "text": "Basically, she didn’t buy it from a store and put everything together herself."
    },
    {
      "character": "Molly",
      "text": "Pfft. Amateur."
    },
    {
      "character": "Uta",
      "text": "Who dares tarnish my name? Approach the stand and fight me with honor, not from the shadows."
    },
    {
      "character": "Ami",
      "text": "Aren’t shadows your whole thing? Wouldn’t you {i}want{/i} to fight in them?"
    },
    {
      "character": "Uta",
      "text": "Shh...silence."
    },
    {
      "character": "Ami",
      "text": "I call for a disqualification of Uta since she can’t remember anything about her character."
    },
    {
      "character": "Imani",
      "text": "After that split thingy? No way! Gotta at least give her a shot."
    },
    {
      "character": "Ami",
      "text": "Tch."
    },
    {
      "character": "Imani",
      "text": "Will Uta Ushibori remain undefeated in the Dorm Wars following tonight’s contest?"
    },
    {
      "character": "Imani",
      "text": "Or will her adversary, who has just returned from the bathroom with not one but {i}two{/i} of Uta’s floormates take the cake?! And by cake I obviously mean contest."
    },
    {
      "character": "Molly",
      "text": "Ah! The cake was a lie!"
    },
    {
      "character": "Uta",
      "text": "Wha...What if I just stand up here for a few more minutes?! You know! To give Sensei a good look at...at the...goods..."
    },
    {
      "character": "Sensei",
      "text": "I also think that’s a good idea. I haven’t finished inspecting the costume yet."
    },
    {
      "character": "Sensei",
      "text": "Uta, please turn around. Or, actually, just come over here. I need to inspect the...materials the costume is made out of."
    },
    {
      "character": "Imani",
      "text": "I don’t know what kind of coordinated stall tactic this is, but I ain’t havin’ any of it! Miku, get that butt of yours up here!"
    },
    {
      "character": "Uta",
      "text": "Maybe just...{i}one{/i} more minute? So we can be sure-"
    },
    {
      "character": "Miku",
      "text": "Uta, chill. I’ve {i}got this.{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Soz for the wait, gang. But there’s a little time required to make sure you can all see me at my best."
    },
    {
      "character": "Kirin",
      "text": "{i}She’s gonna be good right? You gave her a whole tablet.{/i}"
    },
    {
      "character": "Io",
      "text": "{i}Thirty minutes from now, couldn’t tell you. But it’ll help her power through the contest at least.{/i}"
    },
    {
      "character": "Io",
      "text": "{i}If you really care that much, get her back to the hotel as soon as this is over and monitor her.{/i}"
    },
    {
      "character": "Io",
      "text": "{i}Everybody reacts to this kind of stuff differently and there’s really only one way to find out, if you know what I mean.{/i}"
    },
    {
      "character": "Miku",
      "text": "How’s my hair? I’ve been using this new product that’s been trending on TikTok when I’m not too busy rebelling against the expectations society places on the way us girls dress."
    },
    {
      "character": "Imani",
      "text": "A little on the nose, but a valiant attempt at sounding cool from the newest gyaru in town, Miku Maruyama!"
    },
    {
      "character": "Imani",
      "text": "Miku’s costume is also completely customized by- yo! Keep your shirt on, girl!"
    },
    {
      "character": "Miku",
      "text": "Ugh...isn’t anybody else hot in here? Like, I’ve got no idea how you even do it. Summer's like, totally too much for me."
    },
    {
      "character": "Kirin",
      "text": "{i}Okay, now I’m glad Makoto isn’t here. I don’t think she’d want to see this.{/i}"
    },
    {
      "character": "Io",
      "text": "{i}What? Is that not her in the back of the room?{/i}"
    },
    {
      "character": "Kirin",
      "text": "{i}Where? She told Noriko and me she was- oh, that fucking bitch.{/i}"
    },
    {
      "character": "Io",
      "text": "{i}I think Uta said something about her taking a nap upstairs. It was in ninjaspeak though, so I have no idea if that’s accurate or not. But as you can see, she is certainly here now.{/i}"
    },
    {
      "character": "Kirin",
      "text": "{i}Yeah. Thanks, Io. I had no idea you were so good at pointing out the obvious.{/i}"
    },
    {
      "character": "Miku",
      "text": "Sensei, what do ya think? Should I take it off?"
    },
    {
      "character": "Sensei",
      "text": "Uhh..."
    },
    {
      "character": "Miku",
      "text": "Oh my God, perv. I was like, only kidding. Of course I’m not going to just take my top off for you. What am I, a slut? Please."
    },
    {
      "character": "Sensei",
      "text": "Okay, well fuck you too, I guess."
    },
    {
      "character": "Miku",
      "text": "Jk. Love you."
    },
    {
      "character": "Miku",
      "text": "But seriously, should I do it?"
    },
    {
      "character": "Imani",
      "text": "No! Because not only would that be extremely uncomfortable for all of us, it would open us up to a bunch of lawsuits and Sara would lose her bar."
    },
    {
      "character": "Sara",
      "text": "Nooo! Not when it’s finally doing well!"
    },
    {
      "character": "Miku",
      "text": "Ugh. Whatever. This contest is like, totally lame anyway. Let’s go do something fun like dance to Lizzo songs or drown ourselves in tequila."
    },
    {
      "character": "Chika",
      "text": "She really just {i}gets{/i} us, you know?"
    },
    {
      "character": "Haruka",
      "text": "Does she?..."
    },
    {
      "character": "narrator",
      "text": "Miku finishes her...showing or...modeling or...whatever it’s called when a girl gets on stage and almost undresses herself in front of her peers."
    },
    {
      "character": "narrator",
      "text": "Once she’s done, Uta rejoins her on the stage and the two of them move off to the side as I am once again faced with what is sure to be an extremely hard decision..."
    },
    {
      "character": "Imani",
      "text": "So...who’s it gonna be, Sensei?"
    },
    {
      "character": "Imani",
      "text": "Miku...or Uta?"
    },
    {
      "character": "narrator",
      "text": "It’s no surprise that both of them put their best efforts forward in trying to win, the same way they always do."
    },
    {
      "character": "narrator",
      "text": "But the mass of flesh inside of my chest that pumps blood throughout my body is pumping in one particular direction, and that direction is..."
    },
    {
      "character": "narrator",
      "text": "My penis."
    },
    {
      "character": "narrator",
      "text": "I want to have sex with both of them."
    },
    {
      "character": "narrator",
      "text": "But if I were to choose the one who I think most deserves to win today..."
    },
    {
      "character": "narrator",
      "text": "It would be..."
    },
    {
      "character": "Sensei",
      "text": "The winner of this year’s costume contest is..."
    },
    {
      "character": "Sensei",
      "text": "Miku Maruyama."
    },
    {
      "character": "Miku",
      "text": "Huh? What?"
    },
    {
      "character": "Sensei",
      "text": "You won."
    },
    {
      "character": "Miku",
      "text": "I won something?"
    },
    {
      "character": "Miku",
      "text": "Wait, the costume contest?! I won the costume contest?! Seriously?"
    },
    {
      "character": "Sensei",
      "text": "Congratulations, Miku. You deserve it."
    },
    {
      "character": "Miku",
      "text": "You’re...serious? You picked me? Over Uta? And you ain’t messin’ with me?"
    },
    {
      "character": "Imani",
      "text": "Ladies and singular gentleman, it appears our final contest of the night has come to an end."
    },
    {
      "character": "Imani",
      "text": "But even though the games have finished, the night has not!"
    },
    {
      "character": "Imani",
      "text": "Relax! Have fun! And make sure to tip your bartender!"
    },
    {
      "character": "Imani",
      "text": "Oh! And also to vote on the popularity poll, which closes in approximately three hours!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "{i}First Floor: [dorm1war2points]\\nSecond Floor: [dorm2war2points]{/i}"
    },
    {
      "character": "Kirin",
      "text": "See, Miku! You were worried for nothing! All of that “They’re going to see through me” BS was just BS after all. Sensei obviously likes you the most."
    },
    {
      "character": "Miku",
      "text": "Is that true, Sensei?"
    },
    {
      "character": "Miku",
      "text": "Do you like me the most?"
    },
    {
      "character": "Sensei",
      "text": "In the context of this one very specific situation, yes. But please do not take those words and carry them around like some sort of trophy as you will likely be killed for it."
    },
    {
      "character": "Miku",
      "text": "I was really scared, ya know? That you’d go and pick Uta over me. Thought it was guaranteed."
    },
    {
      "character": "Miku",
      "text": "I still don’t feel right when I look like this."
    },
    {
      "character": "Miku",
      "text": "But if this is the side of me that can make your heart flutter, I think I might be able to deal with it sometimes."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Is everything alright? Your voice is a little-"
    },
    {
      "character": "Uta",
      "text": "Congratulations, Miku. It was a well-fought battle and if there is anything Uta Ushibori knows, it’s how to step aside when someone else is clearly the winner."
    },
    {
      "character": "Miku",
      "text": "Thanks, Uta. I still think you were the right choice, but I’m happy I somehow managed to beat you."
    },
    {
      "character": "Uta",
      "text": "Nonsense! You’re cuter than you give yourself credit for. And I’m not just talkin’ about when you’re all dolled up like that. Normal Miku’s great too."
    },
    {
      "character": "Sensei",
      "text": "Sucks I wasn’t able to choose both of you. Your costume was great as well, Uta."
    },
    {
      "character": "Uta",
      "text": "Just not as great as Miku! Talk to her, not me. I’m just here to spread vibes."
    },
    {
      "character": "Miku",
      "text": "Vibes are like, totally my thing now. I finally get what that means."
    },
    {
      "character": "Uta",
      "text": "Aaaand that’s my cue to go back to Io and leave you guys alone for the rest of the night!"
    },
    {
      "character": "Uta",
      "text": "Have fun, okay?!"
    },
    {
      "character": "Miku",
      "text": "Laters, Uta! TTYL! HMU! LOL! NAFTA!"
    },
    {
      "character": "Kirin",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Sup, Kirin? Why’re ya just lookin’ at me like that?"
    },
    {
      "character": "Kirin",
      "text": "Huh? What? I wasn’t."
    },
    {
      "character": "Miku",
      "text": "You think I don’t know when you’re lying by now? Come on."
    },
    {
      "character": "Kirin",
      "text": "I’ve...got no idea what you’re talking about."
    },
    {
      "character": "narrator",
      "text": "Just then, a sudden tapping on my shoulder forces me to turn around."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Mystery Dolphin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Mystery Dolphin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Uhh..."
    },
    {
      "character": "Mystery Dolphin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You want to go outside?"
    },
    {
      "character": "Mystery Dolphin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Uh...excuse me, you two...but I’ll be right back..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Mystery Dolphin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I don’t have any money."
    },
    {
      "character": "Mystery Dolphin",
      "text": "I don’t want your fucking money."
    },
    {
      "character": "Sensei",
      "text": "...No way."
    },
    {
      "character": "Sensei",
      "text": "I know that voice."
    },
    {
      "character": "Mystery Dolphin",
      "text": "Do you have a fucking problem, asshole?"
    },
    {
      "character": "Sensei",
      "text": "Take off the helmet, Niki."
    },
    {
      "character": "Niki",
      "text": "{i}You’re{/i} a helmet! Fuck you!"
    },
    {
      "character": "Sensei",
      "text": "I have so many questions, but I will start with one overarching one."
    },
    {
      "character": "Sensei",
      "text": "{i}Why?{/i}"
    },
    {
      "character": "Niki",
      "text": "What do you mean {i}why?{/i} Do you seriously think I can just be myself in front of a group of teenage girls when they’re my number one demographic?! Get real!"
    },
    {
      "character": "Sensei",
      "text": "I meant something more along the lines of “Why have you been following me around dressed as a dolphin for two days?”"
    },
    {
      "character": "Niki",
      "text": "I overheard my sister talking about a contest where a bunch of teenage girls fight over you and I wanted to make sure that nothing weird happened."
    },
    {
      "character": "Sensei",
      "text": "So basically, you were jealous."
    },
    {
      "character": "Niki",
      "text": "Yeah. And? What are {i}you{/i} gonna do about it?"
    },
    {
      "character": "Sensei",
      "text": "Nothing. I just wish I would have known sooner as I definitely would have chosen you as the winner of the costume contest."
    },
    {
      "character": "Niki",
      "text": "Fucking bite me."
    },
    {
      "character": "Noriko",
      "text": "There you are! I heard you-"
    },
    {
      "character": "Noriko",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "I heard you went outside and I wanted to come say hi."
    },
    {
      "character": "Sensei",
      "text": "No reaction at all to finding out your sister was the mystery dolphin this whole time?"
    },
    {
      "character": "Noriko",
      "text": "Not really. She’s the crazy one in the family, not me."
    },
    {
      "character": "Niki",
      "text": "Crazy awesome, you mean."
    },
    {
      "character": "Noriko",
      "text": "I worry for you sometimes, Nee-chan. I really do."
    },
    {
      "character": "Niki",
      "text": "Shut up! I still haven’t gotten to say what I dragged him out here for!"
    },
    {
      "character": "Sensei",
      "text": "And what’s-"
    },
    {
      "character": "Niki",
      "text": "Christmas date!"
    },
    {
      "character": "Noriko",
      "text": "Ah..."
    },
    {
      "character": "Niki",
      "text": "You and me!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "If you’re going to reject me again, at least do it properly. Don’t just stand there like an idiot. Say something."
    },
    {
      "character": "Sensei",
      "text": "Niki-"
    },
    {
      "character": "Niki",
      "text": "Wait! Before you actually say something, I want to...say {i}more{/i} things!"
    },
    {
      "character": "Niki",
      "text": "Last Christmas...I gave you my heart."
    },
    {
      "character": "Noriko",
      "text": "Oof. Bad start."
    },
    {
      "character": "Niki",
      "text": "And within just minutes, you gave it away."
    },
    {
      "character": "Noriko",
      "text": "Nee-chan, come on. You’re better than this."
    },
    {
      "character": "Niki",
      "text": "Noriko, shut the fuck up."
    },
    {
      "character": "Niki",
      "text": "This year-"
    },
    {
      "character": "Noriko",
      "text": "To save you from tears-"
    },
    {
      "character": "Niki",
      "text": "Yeah! Whatever! This year, I want you to actually accept it."
    },
    {
      "character": "Noriko",
      "text": "That’s not how the song goes."
    },
    {
      "character": "Niki",
      "text": "What the absolute fuck are you even talking about?!"
    },
    {
      "character": "Noriko",
      "text": "Do you seriously not know it?! You work in the music industry!"
    },
    {
      "character": "Sensei",
      "text": "What did you want to do?"
    },
    {
      "character": "Niki",
      "text": "I don’t care. Literally anything."
    },
    {
      "character": "Niki",
      "text": "I’m tired of spending Christmas in front of thousands of people I don’t want to be with while the one person I do is off...doing whatever fucking creepy shit you do in your free time."
    },
    {
      "character": "Niki",
      "text": "Even if it’s just hanging out at your place or going to KFC or a movie theatre or...I don’t fucking know. Maybe a gas station or something! Anywhere! I just want a Christmas date!"
    },
    {
      "character": "Noriko",
      "text": "Me too."
    },
    {
      "character": "Niki",
      "text": "Heh? What do you mean “me too?”"
    },
    {
      "character": "Noriko",
      "text": "I mean you had a whole year to get Sensei back and you didn’t. Let me have this Christmas."
    },
    {
      "character": "Niki",
      "text": "Uhh...how about no? Stop hitting on my ex. It’s creepy."
    },
    {
      "character": "Noriko",
      "text": "Pick me instead, Sensei..."
    },
    {
      "character": "Noriko",
      "text": "Go on a Christmas date with me this year. Not Niki."
    },
    {
      "character": "Niki",
      "text": "Is this a joke?"
    },
    {
      "character": "narrator",
      "text": "It suddenly becomes apparent that I need to make one {i}more{/i} important decision..."
    },
    {
      "character": "narrator",
      "text": "It’s one I didn’t expect to make after the conclusion of the contest, but-"
    },
    {
      "character": "Noriko",
      "text": "Oh, shit. I think someone’s coming."
    },
    {
      "character": "Niki",
      "text": "Oh, you’ve gotta be fucking kidding me."
    },
    {
      "character": "Chika",
      "text": "Hey. What are you doing with Noriko and the dolphin?"
    },
    {
      "character": "Sensei",
      "text": "Just...talking about Christmas."
    },
    {
      "character": "Chika",
      "text": "Oh, that reminds me. Do you have any plans that day?"
    },
    {
      "character": "narrator",
      "text": "{i}Oh no.{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "{i}Meanwhile...{/i}"
    },
    {
      "character": "Nodoka",
      "text": "Why, hello. I don’t believe we’ve met."
    },
    {
      "character": "Nodoka",
      "text": "My name is Nodoka Nagasawa — writer, inventor, entrepreneur...and very good with my fingers."
    },
    {
      "character": "Rika",
      "text": "Really? Do you play guitar?"
    },
    {
      "character": "Nodoka",
      "text": "I do not."
    },
    {
      "character": "Rika",
      "text": "Piano?"
    },
    {
      "character": "Nodoka",
      "text": "Guess again."
    },
    {
      "character": "Rika",
      "text": "Violin?"
    },
    {
      "character": "Nodoka",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "Cello?"
    },
    {
      "character": "Nodoka",
      "text": "I’m flirting with you."
    },
    {
      "character": "Rika",
      "text": "Oooooh."
    },
    {
      "character": "Rika",
      "text": "Why? You’re a kid. Go find someone your own age."
    },
    {
      "character": "Nodoka",
      "text": "All the girls my own age are boring. What I want is someone like you...someone with {i}experience.{/i}"
    },
    {
      "character": "Wakana",
      "text": "Pay her no mind, Rika. If being socially inept equates to having a few screws loose in the head, Nagasawa’s is fully detached and still in the box."
    },
    {
      "character": "Nodoka",
      "text": "What do you say? Do you want to get out of here?"
    },
    {
      "character": "Rika",
      "text": "And do what? Get you into an R-rated movie?"
    },
    {
      "character": "Nodoka",
      "text": "Or my pants. Whichever is more fun for you."
    },
    {
      "character": "Yuki",
      "text": "Hey. Stop hanging all over the customers or I’ll throw you the fuck out of here."
    },
    {
      "character": "Nodoka",
      "text": "But the other couple beside us have been hanging all over each other the whole night."
    },
    {
      "character": "Osako",
      "text": "Yes, but we’re in a committed relationship and that is Rin’s mom."
    },
    {
      "character": "Nodoka",
      "text": "Is that so? Well, seeing as I sleep just ten feet away from Rin’s girlfriend...perhaps we’ll be seeing each other more often?"
    },
    {
      "character": "Rika",
      "text": "Probably not. There’s definitely no reason I would ever be near your dorms, so the chances of us ever seeing each other again basically don’t exist."
    },
    {
      "character": "Nodoka",
      "text": "A one night stand it is, then."
    },
    {
      "character": "Yuki",
      "text": "Yo, creepy kimono girl, let her go or I seriously will toss you the fuck out of here."
    },
    {
      "character": "Nodoka",
      "text": "Yuki, Yuki...be gentle with me. I’m fragile."
    },
    {
      "character": "Yuki",
      "text": "How the fuck do you know my name?"
    },
    {
      "character": "Nodoka",
      "text": "We met at the gym, remember? I asked you if you were into younger women."
    },
    {
      "character": "Yuki",
      "text": "Oh...Yeah, that tracks."
    },
    {
      "character": "Yuki",
      "text": "Doesn’t change shit, though. Leave her alone or you’re getting tossed out."
    },
    {
      "character": "Nodoka",
      "text": "How many more Yamaguchis must I fend off before I find true love? Find out in my next book, “The MILF with the Dragon Tattoo.”"
    },
    {
      "character": "Yuki",
      "text": "More?"
    },
    {
      "character": "Yuki",
      "text": "Wait a second...you the one who got the shit kicked out of her by my daughter?"
    },
    {
      "character": "Nodoka",
      "text": "Guilty as charged. She packs quite a punch. I wonder where all of the strength comes from?"
    },
    {
      "character": "Yuki",
      "text": "You been fuckin’ with her? Cause we ain't the type to attack people without a reason."
    },
    {
      "character": "Nodoka",
      "text": "Me? Do I really seem that threatening?"
    },
    {
      "character": "Yuki",
      "text": "No. But you seem like a fucking creep. And if you’re going out of the way to fuck with Yumi-"
    },
    {
      "character": "Kaori",
      "text": "Aunt Yukiburger! Stop it right now!"
    },
    {
      "character": "Kaori",
      "text": "The first rule of customer service is that the customer is always a customer! Which means that the words we say to them have to be good ones! Round ones! Like a big, rubber ball!"
    },
    {
      "character": "Yuki",
      "text": "Come again?"
    },
    {
      "character": "Kaori",
      "text": "Use your mouth muscle to make the customer happy!"
    },
    {
      "character": "Nodoka",
      "text": "Yes. Please do that."
    },
    {
      "character": "Yuki",
      "text": "Kaori, this girl’s trying to start problems with our family."
    },
    {
      "character": "Kaori",
      "text": "Problems are meant for solving! And if you strike a problem with your arm foot, the problem goes to the Yelp and gives you two stars and says you are confusing! And that you make them feel strange!"
    },
    {
      "character": "Kaori",
      "text": "And that your spider tattoo is too large and it intimidates children!"
    },
    {
      "character": "Yuki",
      "text": "I don’t need you babysittin’ me, you know. I can make my own fuckin’ decisions."
    },
    {
      "character": "Kaori",
      "text": "Do not use that tone of speaktalk with me, young ladywoman. Go to the place you fall asleep at night."
    },
    {
      "character": "Yuki",
      "text": "You can’t ground me. I’m older than you."
    },
    {
      "character": "Kaori",
      "text": "The joke is on top of you, Aunt Yukiburger. You are already {i}on the ground.{/i}"
    },
    {
      "character": "Rika",
      "text": "She’s got a point, Yuki."
    },
    {
      "character": "Yuki",
      "text": "No she doesn’t. You’re just a fucking idiot."
    },
    {
      "character": "Rika",
      "text": "Hey! Big rubber ball words, please! I’m a customer too! I deserve your...mouth muscle- wow, is it just me, or is that kind of lewd?"
    },
    {
      "character": "Nodoka",
      "text": "So...Mrs. Rokuhara...or is it {i}Miss-{/i}"
    },
    {
      "character": "Rika",
      "text": "AAAAAAHHHHHHHHHHHHH!!!!!!!!!!"
    },
    {
      "character": "Yuki",
      "text": "And now she’s crying again. Great."
    },
    {
      "character": "Nodoka",
      "text": "Um..."
    },
    {
      "character": "Nodoka",
      "text": "Perhaps I’ll just go read."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Touka",
      "text": "Uta? What’s wrong? What happened?"
    },
    {
      "character": "Uta",
      "text": "I’m so stupid...I’m so stupid...I’m so stupid..."
    },
    {
      "character": "Touka",
      "text": "You’re not...You’re wonderful...And there are many people who would be in tatters seeing you this way."
    },
    {
      "character": "Uta",
      "text": "No, I am! I’m stupid for getting upset over something like this when it’s not even a big deal and I’m stupid for being jealous and...I’m just stupid in general!"
    },
    {
      "character": "Touka",
      "text": "Is this...about the contest?"
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Touka",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "I really wanted to win..."
    },
    {
      "character": "Uta",
      "text": "I told myself I wasn’t going to cry if I didn’t but now I’m crying and a loser and just flat out stupid!"
    },
    {
      "character": "Touka",
      "text": "Uta, please stop talking down on yourself. It won’t make anything better."
    },
    {
      "character": "Uta",
      "text": "I can’t help it..."
    },
    {
      "character": "Uta",
      "text": "I tried so hard...making this costume...I even helped Io put the plates together..."
    },
    {
      "character": "Uta",
      "text": "It was really difficult...and I kept pinching myself when I tried to put the rivet thingies in and it hurt and it took forever and now I just want to cry and go home."
    },
    {
      "character": "Touka",
      "text": "Forgive me if this is too forward of a question, but...how do you feel about our teacher, Uta?"
    },
    {
      "character": "Uta",
      "text": "{i}Sniff...{/i}"
    },
    {
      "character": "Uta",
      "text": "I don’t know..."
    },
    {
      "character": "Touka",
      "text": "You and I both know that is not true..."
    },
    {
      "character": "Uta",
      "text": "Mm-mm..."
    },
    {
      "character": "Uta",
      "text": "It’s only true if I say it out loud..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "dormwartwo18": {
      "from": null,
      "to": true
    },
    "mikucostumewin": {
      "from": null,
      "to": true
    }
  }
}