{
  "event_id": 139,
  "event_label": "beachmas2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "At night, I reach the end of days — but only until morning."
    },
    {
      "character": "narrator",
      "text": "Every time I close my eyes, I die — but I can’t sleep because it’s pouring."
    },
    {
      "character": "narrator",
      "text": "So as the clouds conceal the sun and the sky continues storming;"
    },
    {
      "character": "narrator",
      "text": "I’ll tell myself I love you — for if I don’t, it gets too boring."
    },
    {
      "character": "narrator",
      "text": "- Me, who’s right behind you"
    },
    {
      "character": "narrator",
      "text": "At night, a stack of silver coins drops further down a well."
    },
    {
      "character": "narrator",
      "text": "A well so deep it cuts through heaven before circling back to hell."
    },
    {
      "character": "narrator",
      "text": "What does it mean, o Sekai!? What is the point, pray tell!?"
    },
    {
      "character": "narrator",
      "text": "There is no point, my child — There is nothing but a shell. "
    },
    {
      "character": "narrator",
      "text": "- Me, again. Turn around."
    },
    {
      "character": "narrator",
      "text": "I can’t KILL this FUCKING headache but I can hurt MYSELF instead!"
    },
    {
      "character": "narrator",
      "text": "It’s okay because my BLOOD is words! My veins are just PRETEND!"
    },
    {
      "character": "narrator",
      "text": "Rapist! Lecher! Pedophile! Flay her ‘til she’s DEAD!"
    },
    {
      "character": "narrator",
      "text": "The things they’d say if only they could see inside my head."
    },
    {
      "character": "narrator",
      "text": "- IT’S STILL ME. IT HAS ALWAYS BEEN ME. IT WILL ALWAYS BE ME."
    },
    {
      "character": "narrator",
      "text": "{size=+25}{b}I MISS YOU SO MUCH.{/b}{/size}"
    },
    {
      "character": "Yumi",
      "text": "{i}The fuck is that guy’s problem? Just saying all that shit out of nowhere...what a fucking creep.{/i}"
    },
    {
      "character": "Yumi",
      "text": "{i}Disgusting. Why the hell am I the one being punished for all the...shitty shit that he has done? How is that fair?{/i}"
    },
    {
      "character": "Yumi",
      "text": "{i}I’m not even fucking sad anymore. I’m just grossed out. Like...who straight up {i}admits{/i} that they jerk it to you? Keep that shit to yourself, scumbag.{/i}"
    },
    {
      "character": "Yumi",
      "text": "{i}Or at the bare minimum, maybe wait until I’m not trying to actually open up about-{/i}"
    },
    {
      "character": "Yumi",
      "text": "Ah."
    },
    {
      "character": "Imani",
      "text": "Uhh...door?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "Yumi? Door? Please?!"
    },
    {
      "character": "Yumi",
      "text": "Oh! Uhh, yeah! My bad!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "Do you, uhh...need something? Preferably something small that I could slip through the bottom of the door so you can just leave afterward?"
    },
    {
      "character": "Yumi",
      "text": "I...uhh..."
    },
    {
      "character": "Yumi",
      "text": "My bag is in there...I wanted to...put my normal clothes back on."
    },
    {
      "character": "Imani",
      "text": "Right. Yeah. Cool. I mean, we’ve only {i}been{/i} here for a good half hour or so and I kind of figured most people would stay in their swimsuits for longer than that, but...right on. Yeah."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "Okay. Uhh..."
    },
    {
      "character": "Imani",
      "text": "I guess it’s...your turn to get changed in the fleeting privacy of a room that people are customarily supposed to, like...knock before they go inside. "
    },
    {
      "character": "Yumi",
      "text": "Yeah, I’m...sorry. I had no idea you were even-"
    },
    {
      "character": "Imani",
      "text": "Listen, it’s...it’s totally cool."
    },
    {
      "character": "Imani",
      "text": "I just...you know, I’d really appreciate it if you could keep what you just saw to yourself. Especially since...it’s something you never {i}should{/i} have seen in the first place."
    },
    {
      "character": "Yumi",
      "text": "Yeah...yeah, that ain’t no problem. I can do that."
    },
    {
      "character": "Yumi",
      "text": "But, like...ain’t you the swim team coach? Won’t everybody else-"
    },
    {
      "character": "Imani",
      "text": "I mean...{i}technically{/i} speaking...I’m the {i}advisor.{/i} Which is a lot different from a coach. So yeah, I was kind of figuring no one {i}would{/i} ever see me in a swimsuit. "
    },
    {
      "character": "Imani",
      "text": "And, if they ever {i}did,{/i} that it would be of my choosing rather than just someone walking in on me. But hey, twenty girls means twenty chances of...yeah."
    },
    {
      "character": "Imani",
      "text": "Anyway, I’m gonna go. So, like...let’s just pretend that none of this ever happened or whatever."
    },
    {
      "character": "Yumi",
      "text": "Yeah...okay. That’s cool."
    },
    {
      "character": "Imani",
      "text": "R...Rad! See you later, then! Hopefully under some sort of pretense that I can control!"
    },
    {
      "character": "Yumi",
      "text": "Yeah..."
    },
    {
      "character": "Yumi",
      "text": "See you later..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "The fuck was I just thinking of again? "
    },
    {
      "character": "Yumi",
      "text": "I can’t even remember why I was mad. "
    },
    {
      "character": "Yumi",
      "text": "Oh, right! That fucking asshole, scumbag teacher just unloading his baggage onto me in the middle of what’s supposed to be a {i}vacation.{/i}"
    },
    {
      "character": "Yumi",
      "text": "Is he trying to ruin my weekend? Or did he just think that maybe hearing about his gross ass masturbation habits would make me pity him enough to-"
    },
    {
      "character": "Chika",
      "text": "Hey! What are you-"
    },
    {
      "character": "Yumi",
      "text": "Hi! Anything you think you might have just heard about masturbation, you didn’t!"
    },
    {
      "character": "Chika",
      "text": "Uhh...what?"
    },
    {
      "character": "Yumi",
      "text": "Nothing. Sup?"
    },
    {
      "character": "Chika",
      "text": "Umm..."
    },
    {
      "character": "Chika",
      "text": "Do you want some time {i}alone?{/i} Should I leave the room and come back later?"
    },
    {
      "character": "Yumi",
      "text": "Please don’t misinterpret what I just said in the actual worst way possible."
    },
    {
      "character": "Chika",
      "text": "To be fair, there aren’t exactly many ways to interpret being greeted by “Hey, I wasn’t masturbating.”"
    },
    {
      "character": "Yumi",
      "text": "That is not even close to what I said!"
    },
    {
      "character": "Chika",
      "text": "It might not be {i}exactly{/i} what you said, but I think it was pretty close."
    },
    {
      "character": "Yumi",
      "text": "What kind of psycho would I have to be to intentionally sneak away from the entire class just to...wait, why are we still even talking about this?! Change the topic!"
    },
    {
      "character": "Chika",
      "text": "Why me? You’re the one ranting about masturbation. I just wanted to make sure I wasn’t interrupting anything."
    },
    {
      "character": "Yumi",
      "text": "Well...you weren’t!"
    },
    {
      "character": "Chika",
      "text": "Okay, then what’s going on? Because I get that you’re {i}you,{/i} but even {i}you{/i} would normally stay at the beach longer than like fifteen minutes before storming off and doing your own thing."
    },
    {
      "character": "Yumi",
      "text": "Why does it matter what I do? I’m barely even one of you guys to begin with."
    },
    {
      "character": "Chika",
      "text": "It matters because you’re my friend and I want to make sure you’re okay. "
    },
    {
      "character": "Chika",
      "text": "And also that I now want to make sure that I shouldn’t have just gotten you a vibrator for Christmas instead of new shoes to go with your winter outfit."
    },
    {
      "character": "Yumi",
      "text": "The shoes will be fine, thanks. But maybe cut back on hanging out with our scumbag teacher if it’s going to make you start thinking you should buy me weird adult shit instead of normal presents."
    },
    {
      "character": "Chika",
      "text": "Scumbag? But I thought you and Sensei finally started patching things up?"
    },
    {
      "character": "Yumi",
      "text": "What? That’s news to me. "
    },
    {
      "character": "Yumi",
      "text": "Sides, even if we {i}did,{/i} which we won’t, it wouldn’t make him any less of a predatorial douche. "
    },
    {
      "character": "Chika",
      "text": "Sensei might be a lot of things, but he sure as hell isn’t a {i}predator.{/i}"
    },
    {
      "character": "Yumi",
      "text": "Oh shit, really? Did I go into a coma or something? Do I have amnesia? At what point did everyone in our class grow up? Because I sure as fuck missed it. "
    },
    {
      "character": "Chika",
      "text": "Legal definitions are stupid. He’s too nice to be a predator."
    },
    {
      "character": "Yumi",
      "text": "You being brainwashed by {i}love{/i} doesn’t make him any less creepy or any less predatorial. He’s fucked up and that’s that."
    },
    {
      "character": "Chika",
      "text": "Yeah, but so are you. And so am I. None of us are perfect."
    },
    {
      "character": "Yumi",
      "text": "True. But not all of us wake up and decide to break the law every single day."
    },
    {
      "character": "Chika",
      "text": "You literally steal candy from convenience stores and sell it to kids. "
    },
    {
      "character": "Yumi",
      "text": "{i}Did,{/i} Chika. Soon as Tsukasa gives me my 10k, I’m leavin’ that life behind."
    },
    {
      "character": "Chika",
      "text": "That sounds a lot like you telling me Sensei is going to leave me behind once he finds a girl closer to his age."
    },
    {
      "character": "Yumi",
      "text": "Wasn’t trying to say that. Nor do I think he would because he’s a fucking creep and a girl like you is basically a lottery win for him."
    },
    {
      "character": "Chika",
      "text": "Aww! Yumi! That's so sweet!"
    },
    {
      "character": "Yumi",
      "text": "It ain’t {i}supposed{/i} to be. That’s the thing. "
    },
    {
      "character": "Yumi",
      "text": "You’re great. You’re everything, like...any dude could ever want. So why waste all of that on a {i}predator{/i} when there are bound to be people out there a million times better for you?"
    },
    {
      "character": "Chika",
      "text": "Well, ignoring the fact that most of those people are in space...Sensei is the one I fell for. Flaws and all. "
    },
    {
      "character": "Chika",
      "text": "There’s no logic behind it or anything. In fact, I don’t think there’s ever really {i}any{/i} logic in anything involving love as it sort of just works in the background without us ever really doing anything."
    },
    {
      "character": "Chika",
      "text": "Like...Okay, I haven’t asked you this in a while, but what kind of guys are you into, Yumi?"
    },
    {
      "character": "Yumi",
      "text": "You know I don’t think about that shit."
    },
    {
      "character": "Chika",
      "text": "I know you {i}say{/i} you don’t think about that shit, but I know you’re lying. Ignoring the fact you still don’t want to tell me, though...do you know {i}why{/i} you feel that way? Or do you just...you know...do?"
    },
    {
      "character": "Yumi",
      "text": "Hey, let’s talk about masturbating again. That sounds easier than this."
    },
    {
      "character": "Chika",
      "text": "Sure. What kind of guys do you masturbate to?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "What? You set me up for that one."
    },
    {
      "character": "Chika",
      "text": "Point is, when it comes to love, once you learn to look past somebody’s flaws and see who they are on the inside, all of that other stuff doesn’t really matter."
    },
    {
      "character": "Chika",
      "text": "Be honest. Do you {i}actually{/i} think Sensei is a bad guy? Or do you think he’s just a little...fucked up? "
    },
    {
      "character": "Yumi",
      "text": "I think he’s a bad guy who is {i}a lot{/i} fucked up. Not a little. "
    },
    {
      "character": "Yumi",
      "text": "He has his moments, I guess...but they’re so few and far between that they barely make any sort of dent in who he is overall."
    },
    {
      "character": "Chika",
      "text": "And yet...you spend so much of your time thinking about him. In fact, you probably bring the guy up just as much as I do."
    },
    {
      "character": "Chika",
      "text": "And hey, since this is honesty-hour, I guess I can go ahead and say that it actually kind of pisses me off sometimes."
    },
    {
      "character": "Yumi",
      "text": "Huh?"
    },
    {
      "character": "Chika",
      "text": "It’s one thing to not like someone. But seizing every opportunity you get to shit on them even when they’re not relevant is like, a major red flag."
    },
    {
      "character": "Yumi",
      "text": "What are you saying?"
    },
    {
      "character": "Chika",
      "text": "I’m saying that if you {i}do{/i} like the same person as me...that you better fucking tell me about it instead of just locking it away."
    },
    {
      "character": "Yumi",
      "text": "But why would-"
    },
    {
      "character": "Chika",
      "text": "Because if you do the latter, it’s going to blow up in your face {i}and{/i} mine and we’re never going to recover from it."
    },
    {
      "character": "Yumi",
      "text": "Dude, I’m not-"
    },
    {
      "character": "Chika",
      "text": "To clarify before you get mad, I’m not accusing you of anything. "
    },
    {
      "character": "Chika",
      "text": "I’m just telling you, as a friend, that the right thing to do is to be honest with me. Because I’ve always been honest with you."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "Also, I was only half joking about my threesome offer a while ago."
    },
    {
      "character": "Yumi",
      "text": "Why do you always have to ruin everything like that?"
    },
    {
      "character": "Chika",
      "text": "Just the kind of girl I am, I guess."
    },
    {
      "character": "Chika",
      "text": "But for real, what are you doing over here while everybody else is off having fun?"
    },
    {
      "character": "Yumi",
      "text": "I think not having fun is more fun than having fun most of the time. "
    },
    {
      "character": "Chika",
      "text": "That was a weird sentence."
    },
    {
      "character": "Yumi",
      "text": "Probably just need to cool off or some shit. I don't know."
    },
    {
      "character": "Chika",
      "text": "Somebody said they saw you talking to Sensei before you stormed off. That have anything to do with it?"
    },
    {
      "character": "Yumi",
      "text": "Maybe. Probably. Who knows?"
    },
    {
      "character": "Chika",
      "text": "I see."
    },
    {
      "character": "Chika",
      "text": "So, let me just circle back to the masturbation thing then-"
    },
    {
      "character": "Yumi",
      "text": "I’d really prefer you didn’t."
    },
    {
      "character": "Chika",
      "text": "I’m kidding. If you don’t mind, though, I’m down to hang out here and “not have fun” with you for a little while longer. "
    },
    {
      "character": "Chika",
      "text": "I’ve gotta do some brainstorming for Sensei’s present anyway as I’m still not really sure what the best way to pull it off is."
    },
    {
      "character": "Yumi",
      "text": "You planning some sort of romantic grand gesture or some shit? Sounds gross."
    },
    {
      "character": "Chika",
      "text": "Something like that. Not a Secret Santa thing, though. Just a normal ole romantic present exchanged between student and teacher. "
    },
    {
      "character": "Yumi",
      "text": "Think he’ll actually get {i}you{/i} something this year?"
    },
    {
      "character": "Chika",
      "text": "I hope..."
    },
    {
      "character": "Chika",
      "text": "Though, he does already pay for my phone...and {i}your{/i} phone, so yeah."
    },
    {
      "character": "Yumi",
      "text": "Don’t remind me. "
    },
    {
      "character": "Chika",
      "text": "Speaking of Secret Santa, though...who’d you get? Anyone fun? Are you excited?"
    },
    {
      "character": "Yumi",
      "text": "Excited for...giving a gift? The fuck do you think I am? Course I ain’t excited. That’s money I could be usin’ on myself."
    },
    {
      "character": "Chika",
      "text": "I hope it’s Nodoka. That would be hilarious."
    },
    {
      "character": "Yumi",
      "text": "Close. I got Futaba. Easy to shop for, though. Probably just gonna grab some random book at a gas station or some shit."
    },
    {
      "character": "Chika",
      "text": "She’s been getting pretty into romance novels lately from what I’ve heard."
    },
    {
      "character": "Yumi",
      "text": "Wow. Exciting. "
    },
    {
      "character": "Chika",
      "text": "Hey, I’m just trying to help you out since you’ve got like, twenty-four hours left to actually buy something and I know you always wait until the last minute."
    },
    {
      "character": "Yumi",
      "text": "Yeah...Actually, instead of hanging out here, why don’t we just get on the bus and head back early? Can go...{i}shopping{/i} or some shit. You like that, right?"
    },
    {
      "character": "Chika",
      "text": "I do and nice try. "
    },
    {
      "character": "Chika",
      "text": "I’ll come with you to the convenience store, but we’re coming back after that. I want to spend more time with that one guy you’re always bringing up. What was his name again?"
    },
    {
      "character": "Yumi",
      "text": "Do you even {i}know{/i} his name?"
    },
    {
      "character": "Chika",
      "text": "Honestly? I’m not even sure if Ami does. I’ve been waiting for her to slip and it legit never happens."
    },
    {
      "character": "Yumi",
      "text": "And you haven’t thought of...you know...asking?"
    },
    {
      "character": "Chika",
      "text": "Nope. I’m in too deep now. Just gotta ride the wave until I figure it out."
    },
    {
      "character": "Chika",
      "text": "Anyway! I guess I should get dressed. Not sure if the convenience store will let me in half-naked."
    },
    {
      "character": "Yumi",
      "text": "Make sure you knock before going into the bedroom. Learned my lesson earlier."
    },
    {
      "character": "Chika",
      "text": "Oooooh who’d you get to see? Anyone exciting?"
    },
    {
      "character": "Yumi",
      "text": "The fuck does that even mean?"
    },
    {
      "character": "Chika",
      "text": "Hey, I’m just saying...if I opened that door and, like...Tsuneyo or Imani were getting dressed in there, I’d probably hang around for a little while."
    },
    {
      "character": "Yumi",
      "text": "Uhh...yeah, I ain’t really sure if you would."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "{i}Meanwhile...{/i}"
    }
  ],
  "state_changes": {
    "beachmas2": {
      "from": null,
      "to": true
    }
  }
}