{
  "event_id": 141,
  "event_label": "beachmas4",
  "dialogue": [
    {
      "character": "Rin",
      "text": "How long do you think I should wait before I should text her again? Two minutes? Three minutes?"
    },
    {
      "character": "Nodoka",
      "text": "Why wait at all? Everyone knows that the quickest way to someone’s heart is the incessant and relentless pursuit of it. And that’s doubly true for a heart you’ve already tied tongues with."
    },
    {
      "character": "Rin",
      "text": "First off, hearts don’t have tongues. Second, I’m not asking for {i}sarcasm,{/i} I am asking for advice."
    },
    {
      "character": "Nodoka",
      "text": "Yes, well, you’ve been asking for {i}advice{/i} all morning and I am running out of answers to give you."
    },
    {
      "character": "Futaba",
      "text": "What if you just...put the phone down for a little while? Otoha might be...busy or something."
    },
    {
      "character": "Rin",
      "text": "Busy doing what? There’s no school and it’s Christmas Eve. She should be here. With her {i}girlfriend.{/i}"
    },
    {
      "character": "Nodoka",
      "text": "I’m surprised you’re still calling her that after nearly two months of this childish bickering."
    },
    {
      "character": "Futaba",
      "text": "Nodoka, come on. That was just mean."
    },
    {
      "character": "Rin",
      "text": "Is there something you want to say to me, Nodoka? Do you have some sort of problem?"
    },
    {
      "character": "Nodoka",
      "text": "Quite the contrary. If anything, I’d say it’s my darling roommate who’s acting more irrationally out of the two of you."
    },
    {
      "character": "Nodoka",
      "text": "At the same time, however, you are doing yourself no favors by dwelling on her as if she’s some sort of incurable illness."
    },
    {
      "character": "Nodoka",
      "text": "Otoha will be Otoha regardless of what any of {i}us{/i} want her to be. Which, if I had any say, would be a free-use puppet that all three of us could take advantage of whenever we wanted."
    },
    {
      "character": "Rin",
      "text": "I don’t know if I like the idea of you using Otoha as a sex puppet even if the two of us {i}are{/i} fighting right now."
    },
    {
      "character": "Nodoka",
      "text": "Silly, Rin. It wouldn’t be just me. We’d {i}all{/i} be using her as a sex puppet. "
    },
    {
      "character": "Nodoka",
      "text": "The jealousy would quickly transition to normalcy and, before you know it, you’d be rolling her around the city in a wheelbarrow to rent."
    },
    {
      "character": "Nodoka",
      "text": "Though, I suppose that would no longer be “free” use. But I digress."
    },
    {
      "character": "Futaba",
      "text": "I would like to petition the room to no longer talk about Otoha the...sex puppet."
    },
    {
      "character": "Rin",
      "text": "Seconded. Or...signed. Whatever you do with a petition to make it work."
    },
    {
      "character": "Nodoka",
      "text": "You two are no fun. What good is a girls' night out if we can not openly discuss our fetishes with one another?"
    },
    {
      "character": "Futaba",
      "text": "It is barely 10:00 AM."
    },
    {
      "character": "Nodoka",
      "text": "The early bird gets the sex puppet. That’s what I always say."
    },
    {
      "character": "Futaba",
      "text": "You also have so many fetishes that we would probably {i}need{/i} the rest of the day to talk about them."
    },
    {
      "character": "Nodoka",
      "text": "Aww, thank you. You flatter me."
    },
    {
      "character": "Rin",
      "text": "You know, sometimes I think {i}I’m{/i} a little too horny for my own good, but then Nodoka opens her mouth and everything becomes good again."
    },
    {
      "character": "Nodoka",
      "text": "But it would be {i}better{/i} if that significant other of yours would actually do her job, wouldn’t it?"
    },
    {
      "character": "Futaba",
      "text": "Sorry, how many more signatures does our petition need for us to stop talking about this?"
    },
    {
      "character": "Rin",
      "text": "Wait, no. This involves {i}me{/i} now. And if Nodoka has vital information about why I’m still a virgin after dating Otoha for over a year now, I would like to hear it."
    },
    {
      "character": "Futaba",
      "text": "Has it really been that long already?..."
    },
    {
      "character": "Nodoka",
      "text": "Unfortunately, my mind is not one that can comprehend {i}ever{/i} going that long without some form of sexual release. "
    },
    {
      "character": "Nodoka",
      "text": "So either Otoha is a chronic masturbator, or she’s simply having that void filled by someone else."
    },
    {
      "character": "Futaba",
      "text": "Someone...else..."
    },
    {
      "character": "Rin",
      "text": "You don’t...actually think Otoha would do something like that, do you? Because I was under the impression I was the first person she ever liked."
    },
    {
      "character": "Nodoka",
      "text": "Do you need to “like” someone to fornicate with them?"
    },
    {
      "character": "Rin",
      "text": "No, but if you’re that {i}into{/i} “fornication,” you would {i}probably{/i} fornicate with someone you like...wouldn’t you? "
    },
    {
      "character": "Rin",
      "text": "Why would she cheat on me before seeing what I can do? Maybe I’m, like...really good at sex and just none of us know it yet?"
    },
    {
      "character": "Nodoka",
      "text": "I’d be willing to help you explore and experiment if you’d like."
    },
    {
      "character": "Rin",
      "text": "Are you kidding?"
    },
    {
      "character": "Nodoka",
      "text": "Am I?"
    },
    {
      "character": "Futaba",
      "text": "Nodoka...that’s your roommate’s girlfriend. How would she feel if she heard you saying that?"
    },
    {
      "character": "Nodoka",
      "text": "Who knows? She’s not here. And frankly, if she’s waited this long to pull the trigger on plucking the petals off of our friend Rin’s flower, I’m sure she’d understand if someone like {i}me{/i} did the deed instead."
    },
    {
      "character": "Rin",
      "text": "Wow. You’re, like...a really shitty friend."
    },
    {
      "character": "Nodoka",
      "text": "But I’m your friend as well, am I not? And what’s friendlier than assisting “one of the gals” with a long overdue orgasm?"
    },
    {
      "character": "Rin",
      "text": "Not cheating on them, for starters. And if Otoha would actually answer her fucking phone, I might even tell her about this. You’re being weird as hell."
    },
    {
      "character": "Nodoka",
      "text": "I can not be blamed for the things I say while surrounded by pretty girls. It is simply not fair."
    },
    {
      "character": "Rin",
      "text": "I feel like you become more and more like Sensei every single day. It’s worrying."
    },
    {
      "character": "Nodoka",
      "text": "More worrying than your {i}girlfriend{/i} not answering her phone...refusing to come with you on vacation...and violently abstaining from sexual contact for over a year?"
    },
    {
      "character": "Nodoka",
      "text": "I am not insinuating anything here, but...if I were you, I’d feel a {i}little{/i} bit worried, Rin. "
    },
    {
      "character": "Futaba",
      "text": "Nodoka...why are you saying things like that? Rin is clearly upset about all of this and hearing you tell her she should be worried is-"
    },
    {
      "character": "Nodoka",
      "text": "Because someone had to say it and everyone else is a coward. "
    },
    {
      "character": "Nodoka",
      "text": "It is a writer’s job to move the plot forward. And when there comes a point in the story where things are not moving, {i}someone{/i} needs to come barging into the room with a gun."
    },
    {
      "character": "Nodoka",
      "text": "Today, that someone is me...the room is you...and the gun is an open offer to alleviate some of your overflowing sexual tension in the form of a meaningless “favor” between two friends."
    },
    {
      "character": "Rin",
      "text": "That’s..."
    },
    {
      "character": "Rin",
      "text": "Yeah, I’m...I’m good. But thanks."
    },
    {
      "character": "Nodoka",
      "text": "If not me, at least let Sensei take the reins. He is {i}experienced{/i} after all. Futaba can vouch for that. Right, Futaba?"
    },
    {
      "character": "Futaba",
      "text": "Yes, but...Sensei and I..."
    },
    {
      "character": "Nodoka",
      "text": "Yes, yes. You love him and he very likely “loves” you in whichever odd ways his brain interprets what that word means."
    },
    {
      "character": "Nodoka",
      "text": "But you love Rin as well, don’t you? And Rin loves Sensei. "
    },
    {
      "character": "Nodoka",
      "text": "So why exactly are we preventing each other from creating a world in which we can {i}all{/i} have sex with the teacher without anyone’s feelings being hurt?"
    },
    {
      "character": "Rin",
      "text": "Are you trying to get your ass kicked a {i}second{/i} time, Nodoka? Because I’m getting a little tired of you trying to talk me into cheating on my girlfriend."
    },
    {
      "character": "Futaba",
      "text": "Rin, don’t."
    },
    {
      "character": "Nodoka",
      "text": "You’re misunderstanding my position here. To me, Otoha is no more of a girlfriend to you than Sensei is a boyfriend. "
    },
    {
      "character": "Nodoka",
      "text": "You love {i}both{/i} of them. You have fantasized about {i}both{/i} of them. "
    },
    {
      "character": "Nodoka",
      "text": "And {i}one{/i} of them is here for you while the other is off being aloof and sexually disinterested."
    },
    {
      "character": "Rin",
      "text": "Sensei and I aren’t like that and I don’t get why both you {i}and{/i} Otoha keep thinking we are."
    },
    {
      "character": "Nodoka",
      "text": "Because you {i}can{/i} be like that. And because {i}I{/i} think {i}he{/i} might be a better match for you at the end of the day."
    },
    {
      "character": "Rin",
      "text": "Even if he is, that doesn’t matter. I don’t want to do that to Futaba."
    },
    {
      "character": "Futaba",
      "text": "That...That probably shouldn’t be the main reason, Rin..."
    },
    {
      "character": "Rin",
      "text": "What does “reason” even have to do with anything? Why do I need better reasons to {i}not{/i} completely fuck up my first ever relationship?"
    },
    {
      "character": "Rin",
      "text": "What I want is for things to work out with {i}Otoha{/i} and me. Not {i}Nodoka{/i} and me. And not {i}Sensei{/i} and me."
    },
    {
      "character": "Nodoka",
      "text": "And also to cum your brains out, which several of us would be willing to help with."
    },
    {
      "character": "Rin",
      "text": "I can help myself with that too, you know!"
    },
    {
      "character": "Futaba",
      "text": "Why is this a thing we need to be yelling about?! "
    },
    {
      "character": "Rin",
      "text": "Because I’m tired of Nodoka’s stupid face and I’m tired of her being horny and saying things that sound really logical but are actually kind of crazy!"
    },
    {
      "character": "Nodoka",
      "text": "Do you really think my face is stupid? I’ve always thought I looked kind of cute."
    },
    {
      "character": "Rin",
      "text": "You are! Just not cute enough for me to cheat on my girlfriend!"
    },
    {
      "character": "Nodoka",
      "text": "What if I put my glasses back on? Would that do anything for you?"
    },
    {
      "character": "Rin",
      "text": "A little bit but still no!"
    },
    {
      "character": "Futaba",
      "text": "That’s it! Nodoka, stop trying to seduce Rin! And Rin, put your stupid phone away and stop worrying about Otoha! Just leave her alone and wait for her to come to you!"
    },
    {
      "character": "Rin",
      "text": "But-"
    },
    {
      "character": "Futaba",
      "text": "No “but”s, do you hear me? We are on vacation. A vacation that Otoha decided to intentionally neglect for reasons none of us even know. "
    },
    {
      "character": "Futaba",
      "text": "You should be {i}mad,{/i} not trying to get her to come here. "
    },
    {
      "character": "Rin",
      "text": "But...this is where I first confessed. And if there is ever going to be a time romantic enough for the two of us to-"
    },
    {
      "character": "Futaba",
      "text": "I don’t care. Go into a quiet room and {i}relieve{/i} yourself if you are that desperately aroused."
    },
    {
      "character": "Nodoka",
      "text": "Offer is still on the-"
    },
    {
      "character": "Futaba",
      "text": "No it’s not!"
    },
    {
      "character": "Futaba",
      "text": "Nodoka, you need to be more considerate of other people’s feelings! Especially when you know one of those people is me and you are suggesting things that are extremely insensitive!"
    },
    {
      "character": "Nodoka",
      "text": "I’m not trying to be “insensitive,” Futaba. I just don’t understand."
    },
    {
      "character": "Nodoka",
      "text": "If Sensei wanted to have sex with {i}me,{/i} would it really be that much of an issue?"
    },
    {
      "character": "Futaba",
      "text": "Sensei wants to have sex with {i}everyone.{/i} He is a boy and that’s just what boys do based on the...very minimal experience I have with them that comes almost entirely from books."
    },
    {
      "character": "Nodoka",
      "text": "Almost?"
    },
    {
      "character": "Futaba",
      "text": "That comes entirely from books!"
    },
    {
      "character": "Futaba",
      "text": "And yes, it {i}would{/i} be an issue if you and Sensei were to do it because I like him and I want him to like {i}me{/i} more and I can’t make that happen if I have to compete with prettier girls like you two!"
    },
    {
      "character": "Rin",
      "text": "Damn it, Nodoka! Look what you did! Now Futaba’s putting herself down because you couldn’t keep your stupid, horny mouth shut!"
    },
    {
      "character": "Nodoka",
      "text": "This is not the way I wanted this conversation to end."
    },
    {
      "character": "Futaba",
      "text": "I know! You wanted this conversation to end in a foursome because you are incorrigible and unrealistic and need to get your head out of the clouds and remember that life is not some smut book!"
    },
    {
      "character": "Futaba",
      "text": "Though it would be really cool if it was because most of them are happier than real life and elves are hot! There, I said it! "
    },
    {
      "character": "Rin",
      "text": "Weird turn, but I agree."
    },
    {
      "character": "Nodoka",
      "text": "I’m more fond of werewolves myself. Or anything with a strange type of penis, really. "
    },
    {
      "character": "Futaba",
      "text": "Can we {i}please...{/i}stop talking about Otoha...and sex...and focus on having fun and enjoying our vacation together?"
    },
    {
      "character": "Futaba",
      "text": "Because if you two are going to keep bickering like this..."
    },
    {
      "character": "Futaba",
      "text": "I am going to leave the room..."
    },
    {
      "character": "Futaba",
      "text": "And take out {i}my{/i} frustration by having aggressive and violent relations with a man that both of {i}you{/i} will avoid sleeping with if at all possible!"
    },
    {
      "character": "Futaba",
      "text": "Is that understood?!"
    },
    {
      "character": "Nodoka",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Futaba",
      "text": "IS THAT UNDERSTOOD?!"
    },
    {
      "character": "Rin",
      "text": "Jeez, yeah! Don’t look at me! Look at Nodoka!"
    },
    {
      "character": "Nodoka",
      "text": "Question. If avoiding our teacher's phallus is no longer an option for me and I find myself in a position where I absolutely {i}must{/i} sleep with him, what should I do then?"
    },
    {
      "character": "Nodoka",
      "text": "I just need some clarity before we proceed with our “fun” sexless vacation."
    },
    {
      "character": "Futaba",
      "text": "If you suddenly find yourselves thrown into an actual fantasy smut novel and need to partake in some sort of sexual mana transfer ritual to save one of your lives, fine. I will not hold that against you."
    },
    {
      "character": "Futaba",
      "text": "But I will not forgive you if you go out of your way to do something that will hurt me just because “you don’t understand.”"
    },
    {
      "character": "Nodoka",
      "text": "You say that, but we both know you’d forgive me regardless."
    },
    {
      "character": "Futaba",
      "text": "Yes, but that doesn’t mean I’ll like it."
    },
    {
      "character": "Rin",
      "text": "Just fucking agree, Nodoka. Haven’t you caused enough trouble today?"
    },
    {
      "character": "Nodoka",
      "text": "Yes. It seems as if I’ve been causing quite a {i}bit{/i} of trouble lately and I’m not exactly sure {i}how.{/i} "
    },
    {
      "character": "Nodoka",
      "text": "I don’t {i}think{/i} I’ve been doing anything differently than normal."
    },
    {
      "character": "Rin",
      "text": "Big disagree. You’ve tried coming onto me before, but never with this level of aggression."
    },
    {
      "character": "Nodoka",
      "text": "What’s this about cumming on you? Are you accepting my offer after all?"
    },
    {
      "character": "Futaba",
      "text": "That’s it! Nodoka! Go...get us drinks or something!"
    },
    {
      "character": "Nodoka",
      "text": "Aww...but it’s girls' night out..."
    },
    {
      "character": "Futaba",
      "text": "It is 10:00 AM!"
    },
    {
      "character": "Rin",
      "text": "It’s actually 10:30 right now."
    },
    {
      "character": "Futaba",
      "text": "Which is a thing you wouldn’t know if you’d just listen to me and put your stupid phone down!"
    },
    {
      "character": "Rin",
      "text": "Fine, fine! But only for a little while since I’m pretty sure she’s going to text back soon."
    },
    {
      "character": "Nodoka",
      "text": "Oh, you poor girl..."
    },
    {
      "character": "Futaba",
      "text": "Nodoka!"
    },
    {
      "character": "Nodoka",
      "text": "Okay, okay. I’m going. But if I come back and you two have gotten started on the foursome without me, I’m going to be quite disheartened as {i}real{/i} friends include one another in-"
    },
    {
      "character": "Futaba",
      "text": "NODOKA!!!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas4": {
      "from": null,
      "to": true
    }
  }
}