{
  "event_id": 142,
  "event_label": "beachmas5",
  "dialogue": [
    {
      "character": "narrator",
      "text": "My search for Yumi is as fruitless as the trees covering this beach as I make my way back to the area most of the girls have been hanging out at."
    },
    {
      "character": "narrator",
      "text": "Perhaps the gap in time between the last time I {i}truly{/i} hung out with her and now has depreciated my once great ability to always find her."
    },
    {
      "character": "narrator",
      "text": "Or perhaps the only reason I ever found her at all is because she wanted to be found."
    },
    {
      "character": "narrator",
      "text": "Now, I’m not so sure anymore."
    },
    {
      "character": "narrator",
      "text": "Because not only did I abandon my blossoming desire to fight for her when it mattered most, I have forced myself upon her in a way different from what I’ve done in the past."
    },
    {
      "character": "narrator",
      "text": "And it doesn’t help that it seems she’s given up on fighting for herself as well."
    },
    {
      "character": "narrator",
      "text": "But alas — I will resign myself to what was decided earlier and simply fall back into line."
    },
    {
      "character": "narrator",
      "text": "I will act normally. "
    },
    {
      "character": "narrator",
      "text": "I will disregard the jump in time that took me from one holiday to the next."
    },
    {
      "character": "narrator",
      "text": "And I will eagerly await the next instance of the world reverting to an earlier version of itself."
    },
    {
      "character": "narrator",
      "text": "Perhaps next time, something greater will happen."
    },
    {
      "character": "narrator",
      "text": "And things will go back to a time when they were easier."
    },
    {
      "character": "Ami",
      "text": "Yay! You’re back!"
    },
    {
      "character": "Ami",
      "text": "Do you know how many seconds you were away?"
    },
    {
      "character": "Sensei",
      "text": "Please tell me you didn’t count them."
    },
    {
      "character": "Ami",
      "text": "Fine. I didn’t count them."
    },
    {
      "character": "Sensei",
      "text": "You counted them, didn’t you?"
    },
    {
      "character": "Ami",
      "text": "It’s possible. But that’s beside the point!"
    },
    {
      "character": "Sensei",
      "text": "Right. And I’m assuming the actual {i}point{/i} you’re trying to make is the fact that you’ve missed me despite my disappearance only lasting probably thirty minutes or so?"
    },
    {
      "character": "Ami",
      "text": "And also the fact that I think we should spend the rest of the day together because we love each other so very much."
    },
    {
      "character": "Sensei",
      "text": "I don’t see how that’s different from your approach to every single day that has ever happened."
    },
    {
      "character": "Ami",
      "text": "It’s different because I’m wearing a swimsuit today and it makes me angry when you look at other girls who are doing the same."
    },
    {
      "character": "Sensei",
      "text": "Let go of my arm, Ami."
    },
    {
      "character": "Ami",
      "text": "No."
    },
    {
      "character": "Ami",
      "text": "You’ve had your fun looking for class delinquents and hiding behind buildings with my friends. Now, it’s Ami time. Which means that you must focus entirely on Ami and ignore anyone else who might show up."
    },
    {
      "character": "Sensei",
      "text": "Hi, Noriko."
    },
    {
      "character": "Ami",
      "text": "Ha ha ha. Very funny. Noriko would know better than to show up in the middle of Ami time. Especially since I would chop off her hands if she ever actually {i}did.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Maybe keep your dismemberment fetish to yourself while we’re out in public."
    },
    {
      "character": "Ami",
      "text": "It’s not a fetish, it’s a necessity. Plus, does Noriko even really {i}need{/i} hands in the first-"
    },
    {
      "character": "Ami",
      "text": "PlaAAAaAAAce!?"
    },
    {
      "character": "Ami",
      "text": "That was assault! I’m calling the police!"
    },
    {
      "character": "Noriko",
      "text": "Soft, yet quite firm upon squeezing. And so very smooth. I’ve gotta say, Ami- you’ve got a surprisingly nice ass. I’d give it...an eight out of ten on the Noriko meter."
    },
    {
      "character": "Ami",
      "text": "Stop ranking my butt! What do you want?! You’re interrupting Ami time!"
    },
    {
      "character": "Noriko",
      "text": "I just wanted to see what my non-blood-related little sister and future husband are up to."
    },
    {
      "character": "Sensei",
      "text": "But if Ami’s your sister, wouldn’t that make me-"
    },
    {
      "character": "Noriko",
      "text": "Shush. You know neither one of us really cares about that."
    },
    {
      "character": "Sensei",
      "text": "True. But on a more serious note, I feel like not enough people {i}do.{/i}"
    },
    {
      "character": "Ami",
      "text": "What I am “up to” is spending time with my beloved uncle. Time that should not be interrupted by-"
    },
    {
      "character": "Ami",
      "text": "Wha- and now you’re hugging me?! Why?! "
    },
    {
      "character": "Noriko",
      "text": "Because I love you, obviously!"
    },
    {
      "character": "Ami",
      "text": "Well, stop! How am I supposed to hate you when you keep being this adorable and kind?!"
    },
    {
      "character": "Noriko",
      "text": "I need not your love, precious imouto. Just your pliable, berry-scented flesh and your 8/10 ass."
    },
    {
      "character": "Noriko",
      "text": "Oh, and I also need to borrow Sensei for a few minutes."
    },
    {
      "character": "Ami",
      "text": "There it is. You never cared about Ami time at all, did you?"
    },
    {
      "character": "Noriko",
      "text": "I will be a happy and willing participant in Ami time right after I can talk to Sensei."
    },
    {
      "character": "Ami",
      "text": "Anything you need to say to Sensei, you can say in front of me."
    },
    {
      "character": "Noriko",
      "text": "Not if I want to keep my hands, I can’t. And I like my hands. What else am I supposed to rank butts with?"
    },
    {
      "character": "Sensei",
      "text": "Am I allowed to ask who the current top scorer in the ass ranking is?"
    },
    {
      "character": "Ami",
      "text": "No. "
    },
    {
      "character": "Noriko",
      "text": "Unfortunately, my unbiased judging has Maya sitting at the very top of the list right now."
    },
    {
      "character": "Sensei",
      "text": "I can not imagine she would be happy to hear that."
    },
    {
      "character": "Ami",
      "text": "Is that why Maya hates you so much? Have you {i}assaulted{/i} her as well?"
    },
    {
      "character": "Noriko",
      "text": "Only with my eyes. But I stare for longer periods of time at the people I’m jealous of and she has many {i}things{/i} I wish I could have as well."
    },
    {
      "character": "Noriko",
      "text": "But so do you, Ami! Which is why I was kind enough to once again ask for your permission to talk to Sensei rather than just stealing him away like everyone else always does."
    },
    {
      "character": "Ami",
      "text": "Well...I do like that you acknowledge your position in the pecking order. And if it weren’t Ami time right now, I’d be inclined to consider your plea."
    },
    {
      "character": "Ami",
      "text": "But unfortunately for you, the only person who can override Ami time other than me is Sensei and there is no way he would ever-"
    },
    {
      "character": "Sensei",
      "text": "We can talk."
    },
    {
      "character": "Ami",
      "text": "Why does nobody ever care about Ami time?! "
    },
    {
      "character": "Sensei",
      "text": "Because Noriko said whatever it is will only take a few minutes. After that, you can do whatever you want with me so long as it’s legal."
    },
    {
      "character": "Ami",
      "text": "You’re going to make me study the {i}law?!{/i} Since when do you care about what’s legal and what’s not?!"
    },
    {
      "character": "Sensei",
      "text": "I’m just covering my bases now for when your ages are no longer indeterminate anymore."
    },
    {
      "character": "Ami",
      "text": "But you {i}know{/i} how old I am."
    },
    {
      "character": "Sensei",
      "text": "I do. But {i}they{/i} don’t."
    },
    {
      "character": "Ami",
      "text": "Who are {i}they?!{/i} What are you talking about?! "
    },
    {
      "character": "Noriko",
      "text": "I have no idea what’s going on, but follow me toward privacy! Or at least as close as we can get to it on a small beach with twenty-some-odd girls!"
    },
    {
      "character": "narrator",
      "text": "In complete disregard for her wishes, I leave Ami’s side and follow Noriko further down the shoreline."
    },
    {
      "character": "narrator",
      "text": "You know that unspoken and mildly-sexist rule where the male in a relationship is always supposed to walk closer to the street so that if {b}ANYTHING HORRIBLE{/b} happens, it happens to {i}him?{/i}"
    },
    {
      "character": "narrator",
      "text": "Well, I’m not sure if that rule applies to the ocean or not. But, if it does, I shatter it into a million pieces as Noriko is not only walking {i}closer{/i} to the ocean, but {i}in{/i} it."
    },
    {
      "character": "narrator",
      "text": "Her feet kick up water each time a wave forces its way into our group of two. And while she does this in a playful fashion, humming happily as she goes, I can not help but mutate the situation inside of my head."
    },
    {
      "character": "narrator",
      "text": "A body of water is chopped into pieces."
    },
    {
      "character": "narrator",
      "text": "I carry some of them with me as they soak into my jeans."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "Sorry for pulling you away like that. I know just how important “Ami time” is to you."
    },
    {
      "character": "Sensei",
      "text": "I feel like my life is perpetually caught in “Ami time,” so I welcome all chances to slip away from that. Even if most of those chances are thwarted soon after. "
    },
    {
      "character": "Noriko",
      "text": "Then, what would you say if I offered you {i}another{/i} opportunity to break free from the chains that bind you tomorrow night?"
    },
    {
      "character": "Sensei",
      "text": "I’d ask what we’re doing, where we’re going, and what you’ll be wearing. "
    },
    {
      "character": "Noriko",
      "text": "Hanging out, around here, and this. "
    },
    {
      "character": "Sensei",
      "text": "Not going to whisk me away to another seedy bar in the urban district?"
    },
    {
      "character": "Noriko",
      "text": "I {i}can{/i} if that’s what you want. I just figured a more relaxing Christmas date would be a little more comfortable for you."
    },
    {
      "character": "narrator",
      "text": "Right...tomorrow is Christmas."
    },
    {
      "character": "narrator",
      "text": "But wasn’t it Niki who asked me out first?"
    },
    {
      "character": "narrator",
      "text": "Granted, I never agreed to go on a date with {i}any{/i} of the three girls who asked me...but sticking with the {i}first{/i} person who did seems to me like it would be the best way to avoid conflict."
    },
    {
      "character": "Sensei",
      "text": "Just out of curiosity, is this something I agreed to do over the last...two-ish months?"
    },
    {
      "character": "Noriko",
      "text": "Hmm...to take advantage of your memory problems or to be honest...which one should I do?"
    },
    {
      "character": "Sensei",
      "text": "I’d prefer honesty but can’t say that’s the route I would take if I were in your shoes."
    },
    {
      "character": "Noriko",
      "text": "Eh. Both paths head to the same place anyway."
    },
    {
      "character": "Noriko",
      "text": "You never responded to any of our date requests. So Nee-chan went ahead with her normal Christmas concert while Chika and I hung back and accepted that it just wasn’t something you were into."
    },
    {
      "character": "Noriko",
      "text": "Well...until now, that is. {i}Now,{/i} Noriko Nakayarakawayama is seizing the day! Or the...tomorrow..."
    },
    {
      "character": "Noriko",
      "text": "...and taking {i}you...{/i} yes, you...out on what is sure to be the most mildly romantic and decently interesting Christmas date of all time."
    },
    {
      "character": "Sensei",
      "text": "Wow, I’m sold. What an amazing pitch."
    },
    {
      "character": "Noriko",
      "text": "I try."
    },
    {
      "character": "Noriko",
      "text": "On the real, though...there’s a place I found that I want to take you."
    },
    {
      "character": "Noriko",
      "text": "It’s pretty hidden, so the chances of anyone seeing us together are null so long as we go there at separate times. "
    },
    {
      "character": "Sensei",
      "text": "True. But you’re overlooking the part where it will be Christmas night, a time we almost always spend as a group, and only the two of {i}us{/i} will be missing. "
    },
    {
      "character": "Noriko",
      "text": "I’m not {i}overlooking{/i} that. I’m accepting it as a necessary risk if I’m ever going to get out of my prototype stage."
    },
    {
      "character": "Noriko",
      "text": "And with a brand new year on the horizon, it’s about time I start doing some things for myself."
    },
    {
      "character": "Sensei",
      "text": "And what better thing to do for {i}yourself{/i} than throw everything you have at winning over a member of the “patriarchy” you so vehemently despise."
    },
    {
      "character": "Noriko",
      "text": "I can fall in love and {i}still{/i} advocate for change, you know. Those things aren’t mutually exclusive."
    },
    {
      "character": "Sensei",
      "text": "You don’t want to fall in love with me, Noriko. "
    },
    {
      "character": "Noriko",
      "text": "No. {i}You{/i} don’t want to fall in love with {i}me{/i} because you’re worried you might break me. But I’m not as fragile as you think."
    },
    {
      "character": "Noriko",
      "text": "And I’m not just saying that because I’d let you do the really rough stuff like choke me and strap me to weird sexual torture devices. "
    },
    {
      "character": "Sensei",
      "text": "Will any of those devices be at this secret spot you’ve managed to find for the two of us?"
    },
    {
      "character": "Noriko",
      "text": "I might be able to make some arrangements."
    },
    {
      "character": "Sensei",
      "text": "Then sign me up. Nothing screams “Christmas” like taking the virginity of a teenage girl in an undisclosed location full of sex machines."
    },
    {
      "character": "Noriko",
      "text": "Just make sure nobody follows you, okay? Not because I’m worried we’ll get caught, but because I don’t want them to be scarred for life after seeing what you’re putting me through."
    },
    {
      "character": "Sensei",
      "text": "Jokes aside, I’m not sure if it’s a good idea or not."
    },
    {
      "character": "Noriko",
      "text": "Really? Not even for-"
    },
    {
      "character": "Sensei",
      "text": "But I’ll do it anyway."
    },
    {
      "character": "Noriko",
      "text": "You...will? Really? "
    },
    {
      "character": "Noriko",
      "text": "I get to have you all to myself on the most romantic night of the year? You’re not going to forget about me and go spend it with Maya or something?"
    },
    {
      "character": "Sensei",
      "text": "Nope. Tonight is Maya night. Tomorrow night will be Noriko night."
    },
    {
      "character": "Noriko",
      "text": "Aww...how generous of you. Thanks, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Jealous she beat you to the punch tonight as well? A more aggressive Noriko could have had dates two nights in a row."
    },
    {
      "character": "Noriko",
      "text": "I’m not jealous, no. "
    },
    {
      "character": "Noriko",
      "text": "I’m happy I get to have you for any amount of time at all..."
    },
    {
      "character": "narrator",
      "text": "{i}Noriko’s affection has increased to [noriko_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Kirin",
      "text": "What do you think they’re talking about over there?"
    },
    {
      "character": "Miku",
      "text": "Sensei and Noriko? Beats me. But if I had to guess, probably somethin’ about how she’s loved him for like forty years or whatever it was."
    },
    {
      "character": "Kirin",
      "text": "Did you know they haven’t even kissed yet? How ridiculous is that?"
    },
    {
      "character": "Miku",
      "text": "Crazy ridiculous. Like, even {i}I’ve{/i} kissed Sensei. Way to drop the ball, Noriko. "
    },
    {
      "character": "Kirin",
      "text": "Right? Like, hurry the fuck up and-"
    },
    {
      "character": "Kirin",
      "text": "Wait, what?"
    },
    {
      "character": "Miku",
      "text": "What?"
    },
    {
      "character": "Kirin",
      "text": "You and Sensei...have kissed?"
    },
    {
      "character": "Miku",
      "text": "Mhm."
    },
    {
      "character": "Kirin",
      "text": "{i}When?{/i}"
    },
    {
      "character": "Miku",
      "text": "Almost a whole year ago at this point."
    },
    {
      "character": "Kirin",
      "text": "And you never told me about it?!"
    },
    {
      "character": "Miku",
      "text": "Was I supposed to?"
    },
    {
      "character": "Kirin",
      "text": "Well...we’re friends, aren’t we? I always thought I’d be one of the first people to hear about something like that. "
    },
    {
      "character": "Miku",
      "text": "I don’t really think I’m supposed to be tellin’ anybody. That kinda thing paints a target on your back ‘round these parts."
    },
    {
      "character": "Miku",
      "text": "But as long as you don’t go around tellin’ anyone else, I don’t think it’ll be a problem. Only you and Makoto know right now."
    },
    {
      "character": "Kirin",
      "text": "Miku, what the fuck?"
    },
    {
      "character": "Miku",
      "text": "I don’t really see what the big deal is with other people knowin’, but if it keeps Sensei outta trouble and my kneecaps still workin’, that’s enough for me."
    },
    {
      "character": "Kirin",
      "text": "So, like...are you saying {i}you{/i} wouldn’t get pissed off hearing about somebody {i}else{/i} making moves on the guy you like?"
    },
    {
      "character": "Miku",
      "text": "Mm-mm. Makoto’s liked Sensei way longer than I have and I’d be super happy if he ever decided to make her his girlfriend. I just also want to be that too. I think. I’m not really sure."
    },
    {
      "character": "Kirin",
      "text": "Then...say if someone like me were to also...you know..."
    },
    {
      "character": "Miku",
      "text": "Kiss Sensei?"
    },
    {
      "character": "Kirin",
      "text": "Or do...{i}more...{/i}"
    },
    {
      "character": "Miku",
      "text": "More?"
    },
    {
      "character": "Kirin",
      "text": "Yeah...like..."
    },
    {
      "character": "Miku",
      "text": "Wait, did he do that fingering thing on you too?"
    },
    {
      "character": "Kirin",
      "text": "What the fuck is going on right now?!"
    },
    {
      "character": "Miku",
      "text": "Isn’t it, like...really weird? But also kind of amazing? Unless you guys haven’t done that yet. But if not, you’ve gotta try it. He’s {i}really{/i} good."
    },
    {
      "character": "Miku",
      "text": "Not like I’ve got anythin’ to compare it to, but still. "
    },
    {
      "character": "Kirin",
      "text": "Sensei...has fingered you?"
    },
    {
      "character": "Miku",
      "text": "Yeah. A bunch of times. It's friggin' awesome."
    },
    {
      "character": "Kirin",
      "text": "How am I only finding out about this right now?"
    },
    {
      "character": "Miku",
      "text": "Idunno. Guess I’m just really good at keepin’ secrets."
    },
    {
      "character": "Miku",
      "text": "This what they call bein’ a side-piece? Cause it ain’t half bad."
    },
    {
      "character": "Kirin",
      "text": "You two haven’t...had sex yet, have you?"
    },
    {
      "character": "Miku",
      "text": "Sex? The whole shabang? You crazy? You have any idea how big that thing is, Kirin? Fingers are one thing, but I ain’t about to let Sensei shove his whole forearm up there."
    },
    {
      "character": "Miku",
      "text": "Ain’t no way I’m ready for that. Nuh-uh. Nope."
    },
    {
      "character": "Kirin",
      "text": "Oh, thank god. You’re not {i}entirely{/i} corrupted yet."
    },
    {
      "character": "Miku",
      "text": "I mean...it might just {i}feel{/i} bigger than it actually is since I ain’t ever technically {i}seen{/i} it...but from what I felt back during Halloween a few years ago...no way. I like bein’ able to walk."
    },
    {
      "character": "Kirin",
      "text": "Miku...between you and me..."
    },
    {
      "character": "Kirin",
      "text": "{i}It looks even bigger than it feels. You’ve gotta see it up close.{/i}"
    },
    {
      "character": "Miku",
      "text": "Ah! I knew all that experience you’re always talkin’ about came from somewhere! I just always thought it was random guys you met in town and not our teacher!"
    },
    {
      "character": "Kirin",
      "text": "Miku, I’m not going to have sex with random guys I meet in town! Even I’m better than that!"
    },
    {
      "character": "Miku",
      "text": "You’re only sayin’ that cause there ain’t any guys around! And wait a minute, you put that thing {i}inside{/i} of you?!"
    },
    {
      "character": "Kirin",
      "text": "SHH! Someone’s going to hear you!"
    },
    {
      "character": "Miku",
      "text": "How can you still walk?!"
    },
    {
      "character": "Miku",
      "text": "Wait a minute! Is that why you were gonna quit the soccer team?! Because Sensei messed up your-"
    },
    {
      "character": "Kirin",
      "text": "Stop yelling about it like that! It’s embarrassing!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas5": {
      "from": null,
      "to": true
    }
  }
}