{
  "event_id": 144,
  "event_label": "beachmas7",
  "dialogue": [
    {
      "character": "Uta",
      "text": "Oh Io! You’re sure back early. "
    },
    {
      "character": "Io",
      "text": "Yes, but not because I want to be."
    },
    {
      "character": "Uta",
      "text": "Guess I can’t blame ya for not being able to function without the aid of your trusty companion and best friend forever, Uta Ushi-"
    },
    {
      "character": "Io",
      "text": "I just walked in on Sana with her fingers so deep inside of herself that I think she may have been trying to pull out her uterus. "
    },
    {
      "character": "Uta",
      "text": "You what?"
    },
    {
      "character": "Io",
      "text": "Where is the nearest maintenance shed? And what do you think the chances are that I will be able to find some bleach in there that I can use to fix my eyes?"
    },
    {
      "character": "Sensei",
      "text": "Io is obviously lying. Sana is too innocent to ever do anything like that and I refuse to believe it’s true."
    },
    {
      "character": "Uta",
      "text": "You sure it was Sana you saw in there and not somebody more, uhh...horny? Like Kirin or Nodoka?"
    },
    {
      "character": "Io",
      "text": "I know what I saw, but I wish I didn’t."
    },
    {
      "character": "Sensei",
      "text": "You’re on drugs. That makes you an unreliable source. It’s not true."
    },
    {
      "character": "Uta",
      "text": "Sensei, I’d hate bein’ the one to break the illusion that some girls just truly {i}are{/i} innocent and not interested in stuff like that, but the fact of the matter is that Sana’s got needs too."
    },
    {
      "character": "Io",
      "text": "But is it normal for those “needs” to take over in a public restroom?"
    },
    {
      "character": "Uta",
      "text": "Now, that’s just unsanitary. "
    },
    {
      "character": "Sensei",
      "text": "I don’t know if I should keep being upset or if I should be saying “I told you so” in response to your “No cumming on Christmas” proclamation."
    },
    {
      "character": "Uta",
      "text": "Well...on the bright side, at least it was Io that found her and not you! Now you can keep her all angelic and pure inside of your mind and...pretend she never does the same things that...literally all of us do."
    },
    {
      "character": "Io",
      "text": "That side isn’t bright at all. It’s dark and full of sorrow. I will never be able to unsee this."
    },
    {
      "character": "Uta",
      "text": "Oh, come on. Walkin’ in on a girl in the middle of, uhh...private time ain’t the end of the world, is it? "
    },
    {
      "character": "Io",
      "text": "Ask Sensei. He’s just as shocked as I am and he wasn’t even there for it."
    },
    {
      "character": "Sensei",
      "text": "Everything I know is a lie."
    },
    {
      "character": "Uta",
      "text": "Y-You know, you guys are makin’ a much bigger deal out of this than it actually is! I’m sure Sana ain’t thrilled to have been discovered in the heat of the moment either!"
    },
    {
      "character": "Io",
      "text": "You’re right. She’s probably still too busy digging the rest of her arm out of her vagina. "
    },
    {
      "character": "Sensei",
      "text": "I bet this is Sara’s fault somehow. That is the only explanation."
    },
    {
      "character": "Uta",
      "text": "Yeah, I’m sure it doesn’t have {i}anything{/i} to do with the guy who’s been going around and trying to corrupt {i}all{/i} of us girls one by one. "
    },
    {
      "character": "Sensei",
      "text": "Are you saying she was masturbating to {i}me?{/i} Because I think I can be a little more comfortable with this if that is the case."
    },
    {
      "character": "Uta",
      "text": "How the heck am I supposed to know?! I can’t read minds! I just don’t want everybody thinking Sana’s some kind of perverted freak just cause she decided to rub one out in the bathroom!"
    },
    {
      "character": "Uta",
      "text": "This is obviously a thing we need to keep secret! Cause if somebody ever found {i}me{/i} going to town on myself like that, I sure as heck wouldn’t want people going around and gossiping about it!"
    },
    {
      "character": "Sensei",
      "text": "But it would be hot if {i}you{/i} did that. Sana is a completely different story. She’s too small and delicate."
    },
    {
      "character": "Uta",
      "text": "She’s only an inch shorter than me! Don’t say I’m not delicate just cause my {i}features{/i} started coming in early!"
    },
    {
      "character": "Io",
      "text": "Why would it make any difference if it was {i}you{/i} Sana was thinking about? I don’t see how it changes the fact that she was literally {i}masturbating in a public bathroom.{/i}"
    },
    {
      "character": "Sensei",
      "text": "It wouldn’t change that fact, but at least it would allow me to distract myself."
    },
    {
      "character": "Io",
      "text": "From what? {i}Not{/i} thinking about sex? Because it’s okay to do that every once in a while, Sensei. You’re not going to suddenly burst into flames if you don’t have an erection."
    },
    {
      "character": "Sensei",
      "text": "How can you be so sure?"
    },
    {
      "character": "Io",
      "text": "Ugh, forget it. I don’t want to talk about this anymore. It’s gross."
    },
    {
      "character": "Sensei",
      "text": "You’re the one who brought it up. I was just trying to enjoy my day and now all I can think of is the most timid girl in class angrily fisting herself."
    },
    {
      "character": "Io",
      "text": "Well, sorry for once again ruining everything."
    },
    {
      "character": "Uta",
      "text": "Io...stop. Let’s just...hang out here for a little while longer before heading back to the inn. That should help get all of our minds off of...uhh...Sana’s {i}habits,{/i} right?"
    },
    {
      "character": "Io",
      "text": "For me, maybe. Sensei’s a whole other story."
    },
    {
      "character": "Sensei",
      "text": "No one look down. It’s not safe."
    },
    {
      "character": "Uta",
      "text": "Well, obviously now I’m going — wow. Hello."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "Ooooh boy."
    },
    {
      "character": "Io",
      "text": "Can I open my eyes now? Or do you two want to keep being disgusting for a little while longer?"
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Uta."
    },
    {
      "character": "Uta",
      "text": "Ten more seconds."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Ignoring the fact that one of the girls I am most interested in copulating with just spent the last ten seconds staring at my erection through my jeans, I can’t manage to get Sana out of my head."
    },
    {
      "character": "narrator",
      "text": "But the weird part is that it’s not even in a mostly-sexual way. Like, sure there is some element of that to it, but I’m more {i}shocked{/i} than anything else."
    },
    {
      "character": "narrator",
      "text": "And I think it’s pretty safe to say that she is as well- considering when Uta, Io and I make it to the inn about thirty minutes later, she immediately locks eyes with the one who caught her."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "She then realizes that I know-"
    },
    {
      "character": "narrator",
      "text": "And promptly exits the room."
    },
    {
      "character": "Nodoka",
      "text": "Wow. I’ve never heard a sliding door close with such force before."
    },
    {
      "character": "Io",
      "text": "See, Uta? I told you. "
    },
    {
      "character": "Uta",
      "text": "I never doubted you! I just said it’s not something we should hold against her!"
    },
    {
      "character": "Io",
      "text": "She’s probably heading back there right now. "
    },
    {
      "character": "Uta",
      "text": "Io! Leave the poor...horny girl alone! This is a confusing time in our lives!"
    },
    {
      "character": "Nodoka",
      "text": "Perhaps it would be best if I went to check on her..."
    },
    {
      "character": "Imani",
      "text": "Oh, Senpai. Welcome home."
    },
    {
      "character": "Imani",
      "text": "Did you miss me? I feel like we’ve barely seen each other all day."
    },
    {
      "character": "Sensei",
      "text": "Put on a bathing suit like the rest of the girls. What’s the point in having a student teacher if I can’t discreetly stare at her body in contrast to all of the students during a field trip to the beach?"
    },
    {
      "character": "Imani",
      "text": "You ain’t missing much, buddy. I might be in my twenties, but even I’m outpaced by some of these bright, young stars. "
    },
    {
      "character": "Sensei",
      "text": "Speaking of “bright young stars” who outpace you in the growth department, have you seen Yumi around?"
    },
    {
      "character": "Imani",
      "text": "Yumi?! Nope! Hahah! Haven’t seen her all day! What a crazy thing you’d just ask me out of nowhere, Senpai! Like {i}I’d{/i} have any idea where Yumi is! Pfft!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You didn’t...kill her, did you?"
    },
    {
      "character": "Imani",
      "text": "Nope! No murderers in this room! Least...not to my knowledge!"
    },
    {
      "character": "Sensei",
      "text": "Then...are you two secretly fucking?"
    },
    {
      "character": "Imani",
      "text": "Bruh. Come on. Why would you even ask that?"
    },
    {
      "character": "Sensei",
      "text": "Because you’re being “sus” as hell right now and I am going to get to the bottom of it."
    },
    {
      "character": "Imani",
      "text": "Did you seriously just “sus” me?"
    },
    {
      "character": "Sensei",
      "text": "You’re not the only young and vibrant teacher around here, Imani. Now, tell me where Yumi is or I’m going to demote you to school janitor."
    },
    {
      "character": "Imani",
      "text": "You’d really send me off to my death just like that? There’s no way I’d be able to dodge Ayane’s absurdly good dodgeball skills. Besides, you don’t even have the {i}right{/i} to demote me."
    },
    {
      "character": "Imani",
      "text": "And if anything, {i}you’d{/i} probably be the one getting demoted since all of the staff likes me and you’re just known as the creepy guy with really entrancing eyes."
    },
    {
      "character": "Nodoka",
      "text": "I do find myself getting lost in them rather often."
    },
    {
      "character": "Imani",
      "text": "Oh, Nodoka. You’re an omniscient weirdo. Do {i}you{/i} have any idea where Yumi is? Because if so, Sensei wants to know. And if not, be careful yo. She could strike again at any moment."
    },
    {
      "character": "Nodoka",
      "text": "I’m afraid I haven’t seen her. Which is quite unfortunate as I was hoping to get a better look at her body in a more...exposed state than normal."
    },
    {
      "character": "narrator",
      "text": "Certainly wouldn’t be the first time."
    },
    {
      "character": "Imani",
      "text": "You’re wild. I’m not sure if my lust could ever survive through having the shit kicked out of me. But hey, hate sex is a thing and why am I talking about this with a student?"
    },
    {
      "character": "Sensei",
      "text": "Nodoka is barely a student when she’s light years smarter than both of us."
    },
    {
      "character": "Nodoka",
      "text": "That’s right. I know {i}all{/i} about hate sex, so please feel free to continue talking about it and don’t pay me any mind if I begin softly moaning underneath my breath."
    },
    {
      "character": "Imani",
      "text": "Welp, there you have it, Senpai. Nobody’s got any idea where Yumi is. And if you just so happen to find her, don’t bring me up. Understood?"
    },
    {
      "character": "Sensei",
      "text": "You really are fucking her, aren’t you?"
    },
    {
      "character": "Imani",
      "text": "That might be preferable to our current situation because at least I’d have some sort of {i}control{/i} in a relationship like that."
    },
    {
      "character": "Sensei",
      "text": "Got it. You owe money to the Yakuza."
    },
    {
      "character": "Imani",
      "text": "Sure. Let’s just go with that."
    },
    {
      "character": "Nodoka",
      "text": "Why are you looking for Yumi, exactly? Is there anything {i}I{/i} could help with?"
    },
    {
      "character": "Nodoka",
      "text": "Perhaps the three of us could-"
    },
    {
      "character": "Sensei",
      "text": "Nope. I’m good."
    },
    {
      "character": "Nodoka",
      "text": "But you haven’t even let me finish. And you know for a fact I’d let {i}you{/i} finish, Sensei."
    },
    {
      "character": "Imani",
      "text": "Was that {i}supposed{/i} to sound lewd? Or-"
    },
    {
      "character": "Nodoka",
      "text": "I’d let you finish {i}all over me.{/i}"
    },
    {
      "character": "Imani",
      "text": "Well, that answers that question."
    },
    {
      "character": "Sensei",
      "text": "Just leave Yumi alone, Nodoka. Haven’t you already done enough?"
    },
    {
      "character": "Imani",
      "text": "Isn’t it the other way around? Yumi’s the one who knocked Nodoka on her ass. Nodoka didn’t do shit."
    },
    {
      "character": "Sensei",
      "text": "There might be more to that story than you think."
    },
    {
      "character": "Imani",
      "text": "You saying that public apology was all for shits and gigs then? "
    },
    {
      "character": "Sensei",
      "text": "Public apology? What public apology?"
    },
    {
      "character": "Nodoka",
      "text": "The heartfelt and moving speech Yumi gave in front of the classroom that ultimately allowed her to rejoin the class. Surely you haven’t forgotten such a touching moment, have you?"
    },
    {
      "character": "narrator",
      "text": "Did...something like that really happen between Halloween and now? "
    },
    {
      "character": "narrator",
      "text": "I’ve got...no way of knowing what sort of changes Yumi went through ever since she was suspended, but...there’s no way she’d ever do something like that on her own, is there?"
    },
    {
      "character": "narrator",
      "text": "Does Nodoka have something {i}else{/i} on her now, too?"
    },
    {
      "character": "Sensei",
      "text": "Must have just...slipped my mind."
    },
    {
      "character": "Nodoka",
      "text": "Oh?..."
    },
    {
      "character": "Imani",
      "text": "Well slip it back into normal gear or whatever cause she’s still on thin ice. And, if you do find some kinda dirt on her, bring it to me first so I can even our playing field again."
    },
    {
      "character": "Sensei",
      "text": "Just what the hell is going on between you two?"
    },
    {
      "character": "Imani",
      "text": "Oh, you know. Just sex stuff. Don’t think too much about it. And again...{i}dirt, please.{/i}"
    },
    {
      "character": "narrator",
      "text": "Imani and Nodoka step away from a brightly decorated Christmas tree as I am finally faced with the reality that it truly is “the” holiday season."
    },
    {
      "character": "narrator",
      "text": "And judging by the fact that Maya and Ayane are already casually hanging out at a table in front of a {i}second{/i} Christmas tree, I assume they’ve accepted it as well."
    },
    {
      "character": "narrator",
      "text": "Ami, too — who has either forgotten that Ami time exists or has simply respawned into her typical group of girls after mysteriously vanishing earlier."
    },
    {
      "character": "narrator",
      "text": "I stare down at the stack of presents and-"
    },
    {
      "character": "Noodles",
      "text": "CAW! (We meet again, Father.)"
    },
    {
      "character": "Sensei",
      "text": "Okay. I guess this is happening now."
    },
    {
      "character": "Noodles",
      "text": "CAW! (This moment of splendor will be temporary. Savor it while it lasts. For it is only in moments like these that we can truly appreciate the wonders of life.)"
    },
    {
      "character": "Noodles",
      "text": "CAW! (But as those wonders fade and you come face to face with the unkind reflection of your mutilated self, remember-)"
    },
    {
      "character": "Noodles",
      "text": "CAW! (Some things are not always as they seem.)"
    },
    {
      "character": "Noodles",
      "text": "CAW! (And there will always be a place for you shrouded in wires and surrounded by salt.)"
    },
    {
      "character": "Sensei",
      "text": "Noodles, why are you even here?"
    },
    {
      "character": "Noodles",
      "text": "CAW! (Reconnaissance.)"
    },
    {
      "character": "Sensei",
      "text": "And where is Tsuneyo?"
    },
    {
      "character": "Molly",
      "text": "That’s what I’d like to know!"
    },
    {
      "character": "Molly",
      "text": "Sir, I’ve been looking all over for the Kendo Princess and I’ve yet to uncover even the faintest trace of her essence."
    },
    {
      "character": "Molly",
      "text": "Have you, perchance, stumbled across her in your journeys? Perhaps with a large, yellow exclamation point over her head?"
    },
    {
      "character": "Sensei",
      "text": "Is she giving out quests now?"
    },
    {
      "character": "Molly",
      "text": "It’s possible. She-"
    },
    {
      "character": "Molly",
      "text": "Wait, why did you know what that meant?"
    },
    {
      "character": "Sensei",
      "text": "I..."
    },
    {
      "character": "Sensei",
      "text": "I’m not really sure."
    },
    {
      "character": "Molly",
      "text": "Sir...have you secretly been an otaku this whole time?"
    },
    {
      "character": "Sensei",
      "text": "Absolutely not. But I’ll keep an eye out for Tsuneyo and will let her know you’re looking for her if I bump into her."
    },
    {
      "character": "Molly",
      "text": "I appreciate that, Sir. The reward I have to offer you will not be great as this is merely a side quest-"
    },
    {
      "character": "Molly",
      "text": "But, perhaps there is something I could make to go along with last year’s Christmas present...which I see you’re still wearing."
    },
    {
      "character": "Sensei",
      "text": "Indeed I am. It’s one of my three favorite shirts."
    },
    {
      "character": "Molly",
      "text": "And it brightens my day to hear you say that."
    },
    {
      "character": "Molly",
      "text": "Now, if you’ll please excuse me, I have agreed to partake in a treacherous ritual where myself and several other girls will go around in a circle revealing secrets about ourselves and making bad decisions."
    },
    {
      "character": "Sensei",
      "text": "Oh, good. It wouldn’t really be a beach trip unless something terrible happened to at least one of the interpersonal relationships in this class."
    },
    {
      "character": "Molly",
      "text": "Right you are, Sir! And here's hoping that person is not me for the second year in a row!"
    },
    {
      "character": "narrator",
      "text": "Molly makes her way back to the table and-"
    },
    {
      "character": "Rin",
      "text": "Sensei!"
    },
    {
      "character": "narrator",
      "text": "Okay. I guess Rin is here now."
    },
    {
      "character": "Rin",
      "text": "Sensei, have you seen Futaba anywhere?"
    },
    {
      "character": "Rin",
      "text": "I’m pretty sure I pissed her off by spending so much time on my phone and she doesn’t {i}have{/i} a girlfriend so she didn’t {i}bring{/i} her phone with her and now I can’t apologize."
    },
    {
      "character": "Sensei",
      "text": "Wow, everyone’s just missing tonight, huh?"
    },
    {
      "character": "Rin",
      "text": "Who else is missing?"
    },
    {
      "character": "Sensei",
      "text": "Yumi...Tsuneyo...Futaba...And come to think of it, I haven’t seen Otoha around either."
    },
    {
      "character": "Rin",
      "text": "Kind of hard to see somebody who didn’t come in the first place."
    },
    {
      "character": "Sensei",
      "text": "What? Why isn’t she here? You’re not fighting again, are you?"
    },
    {
      "character": "Rin",
      "text": "We’ve barely {i}stopped{/i} fighting since Halloween."
    },
    {
      "character": "Rin",
      "text": "So in a sense, I guess it’s kind of {i}good{/i} that she didn’t come because this would be prime “Let’s dump Rin” territory and I doubt she’d do something like that over the phone."
    },
    {
      "character": "Rin",
      "text": "But also, I {i}want{/i} her to be here so we can finally stop all this arguing and just make out or something."
    },
    {
      "character": "Sensei",
      "text": "Fine. If you {i}really{/i} want someone to make out with, I-"
    },
    {
      "character": "Rin",
      "text": "I can’t joke about that anymore. I’m sorry."
    },
    {
      "character": "Sensei",
      "text": "Who said I’m-"
    },
    {
      "character": "Rin",
      "text": "Please don’t. Things are complicated enough as-is."
    },
    {
      "character": "Sensei",
      "text": "My bad. But yeah, I’ll keep an eye out for Futaba. Especially since it seems like it is now my duty to go round all of the missing people up in one leisurely stroll around the beach."
    },
    {
      "character": "Sensei",
      "text": "Want to come with me?"
    },
    {
      "character": "Rin",
      "text": "Me? Thanks but no thanks. I’m going to continue sulking in the bedroom. Just tell her I’m sorry if you see her, okay? I get not wanting to hang out with me. I kinda suck right now."
    },
    {
      "character": "Sensei",
      "text": "Just stop sucking and you won’t have any problems anymore."
    },
    {
      "character": "Rin",
      "text": "I’ll get right on that. Thanks for the pep talk, Dad."
    },
    {
      "character": "Rin",
      "text": "Enjoy your leisurely walk down the beach and make sure to hold Futaba’s hand if you guys wind up romantically walking back here together."
    },
    {
      "character": "Rin",
      "text": "It’ll be a good substitute for the Christmas present you totally didn’t get her."
    },
    {
      "character": "Sensei",
      "text": "How about I just have sex with her instead?"
    },
    {
      "character": "Rin",
      "text": "How about I pretend I didn’t hear that and go back to blinding myself with blue light in a dark room?"
    },
    {
      "character": "Sensei",
      "text": "Wait, one last thing."
    },
    {
      "character": "Rin",
      "text": "What?"
    },
    {
      "character": "Sensei",
      "text": "Is your mom coming?"
    },
    {
      "character": "Rin",
      "text": "Goodnight, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Because if not, I can make her."
    },
    {
      "character": "Rin",
      "text": "You and what vagina?"
    },
    {
      "character": "narrator",
      "text": "As Rin disappears back into the bedroom away from the comfort of all of her friends, I set out on yet another soon-to-be fruitless journey."
    },
    {
      "character": "narrator",
      "text": "And while there’s no guarantee I’ll find any of the three people I have been tasked with finding (One being a task I set myself) I can at least make sure I’m not around when things inside inevitably start cracking."
    },
    {
      "character": "narrator",
      "text": "That sort of thing always happens around here. And it happens even {i}faster{/i} when I’m present."
    },
    {
      "character": "narrator",
      "text": "And so my early Christmas gift will be minding my own business for most...while figuring out a way to get {i}involved{/i} in the business of those who I think actually {i}need{/i} it."
    },
    {
      "character": "narrator",
      "text": "The ones who are missing-"
    },
    {
      "character": "Sana",
      "text": "{i}Hngh! Mmm!....Mmf!{/i}"
    },
    {
      "character": "Sana",
      "text": "{i}Mmf...no...I have...ngh! I have...to stay...quiet!{/i}"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "The ones who are missing are the ones who need me the most."
    },
    {
      "character": "Sana",
      "text": "{i}Ahh.......haaaah!{/i}"
    },
    {
      "character": "narrator",
      "text": "But..."
    },
    {
      "character": "narrator",
      "text": "Maybe not all of them."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas7": {
      "from": null,
      "to": true
    }
  }
}