{
  "event_id": 145,
  "event_label": "beachmas8",
  "dialogue": [
    {
      "character": "Molly",
      "text": "...and that’s exactly why I think school should be done entirely online and that requesting our presence is a waste of both money {i}and{/i} resources!"
    },
    {
      "character": "Ami",
      "text": "Something wrong, Maya? You’ve been staring at the door for a good twenty seconds."
    },
    {
      "character": "Maya",
      "text": "Hm? What? No. I was just wondering when this stupid game is going to start since we’ve just been sitting in a circle for what feels like thirty minutes now."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Kirin",
      "text": "I’m with Maya! I would also like to get the game started!"
    },
    {
      "character": "Nodoka",
      "text": "As would I. I had an absolute blast the last time we played truth or dare and I can’t {i}wait{/i} to see what wonders are in store this time."
    },
    {
      "character": "Touka",
      "text": "And while I am very happy for you, Nodoka, I {i}must{/i} remind you that you are forever banned from playing this game following your direct breach of both our trust and the rules last time."
    },
    {
      "character": "Kirin",
      "text": "She can watch, though. Right? We can rob her of the privilege to play, but we can’t {i}completely{/i} strip her of her freedom."
    },
    {
      "character": "Nodoka",
      "text": "You can all strip me in whichever ways you like. Though, I can’t guarantee I’d be the most fun person here to undress. I believe that role would have to go to-"
    },
    {
      "character": "Touka",
      "text": "It’s going to be me, isn’t it?"
    },
    {
      "character": "Nodoka",
      "text": "Touka."
    },
    {
      "character": "Touka",
      "text": "Of course. "
    },
    {
      "character": "Kirin",
      "text": "That swimsuit {i}does{/i} look a little tight. Would you mind if I just reached over and-"
    },
    {
      "character": "Touka",
      "text": "I would, actually. And very much so, at that."
    },
    {
      "character": "Ayane",
      "text": "Hey, here’s a fun idea! How about we stop trying to strip Touka and indulge the wretched behaviors of the two most destructively horny girls on the planet and, {i}instead,{/i} play some truth or dare!"
    },
    {
      "character": "Kirin",
      "text": "She says, despite being equally as wretched and horny."
    },
    {
      "character": "Ayane",
      "text": "So, we already know that Nodoka is banned from participating in any way, but there are a few other rules we need to get out of the way first so things don’t become horrible out of nowhere!"
    },
    {
      "character": "Ayane",
      "text": "First and foremost, nothing sexual! "
    },
    {
      "character": "Kirin",
      "text": "Laaaaame. "
    },
    {
      "character": "Ayane",
      "text": "You {i}may{/i} dare another girl {i}from this table{/i} to {i}kiss{/i} you if you absolutely must. But that girl has the right to veto said kiss and, if she does, your dare has been forfeit and the next person goes."
    },
    {
      "character": "Ayane",
      "text": "There are no limits to what sorts of truths you can ask for though."
    },
    {
      "character": "Kirin",
      "text": "Hey, I have a question. Why did we mutate a timeless classic like truth or dare into something so family friendly that even my fucking sister would play it?"
    },
    {
      "character": "Ami",
      "text": "Because most of us here are wholesome and only you and Nodoka are degenerates."
    },
    {
      "character": "Molly",
      "text": "{i}Ahem.{/i} "
    },
    {
      "character": "Ami",
      "text": "And Molly. But she’s a different type of degenerate."
    },
    {
      "character": "Molly",
      "text": "‘Tis the truth. I’m the brand of degenerate that you’d be okay with introducing to your mother so long as I was briefed on what not to say beforehand."
    },
    {
      "character": "Ayane",
      "text": "And Kirin is the type who would fuck your dad."
    },
    {
      "character": "Nodoka",
      "text": "And {i}I{/i} am the type who would fuck your mother. Now, who’s ready to play? "
    },
    {
      "character": "Ami",
      "text": "Not you! That’s for sure!"
    },
    {
      "character": "Touka",
      "text": "Maya, you look a bit uncomfortable. Are you sure you do not want to leave the table before the game begins? No one will hold it against you."
    },
    {
      "character": "Ami",
      "text": "Hey, yeah. Why {i}are{/i} you here anyway?"
    },
    {
      "character": "Maya",
      "text": "Because my other plans apparently fell through. Now, can we begin?"
    },
    {
      "character": "Ayane",
      "text": "Go make them come true, then. Nothing’s going to happen by just sitting here."
    },
    {
      "character": "Touka",
      "text": "American movie star, Shia LaBeouf, always says to never let your dreams be dreams. I am with Ayane on this. And it is not only because we are both rich."
    },
    {
      "character": "Kirin",
      "text": "Gee, thanks for reminding us. I almost forgot. "
    },
    {
      "character": "Ami",
      "text": "Kirin, you’re the most reckless person here. Why don’t {i}you{/i} start?"
    },
    {
      "character": "Kirin",
      "text": "Can someone else go first? I haven’t decided who I’m going to dare to kiss me yet."
    },
    {
      "character": "Nodoka",
      "text": "Perhaps it’s not too late to track down Noriko and have her join us for a round?"
    },
    {
      "character": "Kirin",
      "text": "Already tried. She won’t do it."
    },
    {
      "character": "Touka",
      "text": "Oh my. Is it against the rules to share truths before they’re asked of you? Because I don’t believe that was something we were meant to hear."
    },
    {
      "character": "Kirin",
      "text": "You know what? I’ll save my dare until the second round. "
    },
    {
      "character": "Molly",
      "text": "That is...assuming that person selects “dare,” correct? I’m not great at games that don’t involve controllers or touch pads."
    },
    {
      "character": "Ami",
      "text": "Correct. Kirin can’t just dare you to do something because she wants to. It has to be your choice."
    },
    {
      "character": "Kirin",
      "text": "For the millionth time, {i}lame.{/i} Ayane, truth or dare."
    },
    {
      "character": "Ayane",
      "text": "Well, I definitely don’t want to kiss you so...truth."
    },
    {
      "character": "Kirin",
      "text": "Do you actually believe it’s realistic that you and Sensei are going to get married and start a family one day?"
    },
    {
      "character": "Ami",
      "text": "That is...way tamer than I expected from you."
    },
    {
      "character": "Ami",
      "text": "Also, I’ll answer for Ayane. She obviously doesn’t think that-"
    },
    {
      "character": "Ayane",
      "text": "Is that really all you want?"
    },
    {
      "character": "Kirin",
      "text": "Yeah. Is there a problem with that?"
    },
    {
      "character": "Ayane",
      "text": "I just figured it would be something more...{i}Kirin.{/i}"
    },
    {
      "character": "Kirin",
      "text": "Just answer the fucking question before I ask you something else like when the last time you masturbated was."
    },
    {
      "character": "Ayane",
      "text": "I...I don’t really know. If you asked me that question a year ago, I’d probably have an entirely different answer."
    },
    {
      "character": "Ayane",
      "text": "But now, I barely even know if I’m going to make it to the end of each {i}day.{/i} Let alone so far off into the future that I have a career and kids and..."
    },
    {
      "character": "Ayane",
      "text": "Yeah..."
    },
    {
      "character": "Ayane",
      "text": "What I {i}can{/i} say, though, is...if any of that ever {i}does{/i} happen for me...I can’t imagine it being with anyone other than Sensei. So that’s all on him and whether or not that’s what {i}he{/i} wants as well."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "{i}And also Ami because she makes the rules and you would need her blessing before doing anything as ridiculous as that.{/i}"
    },
    {
      "character": "Kirin",
      "text": "You want to fuck your uncle. We know."
    },
    {
      "character": "Ami",
      "text": "You said it. Not me. "
    },
    {
      "character": "Ayane",
      "text": "Welp, I guess it’s my turn now, so..."
    },
    {
      "character": "Ayane",
      "text": "Maya...truth or dare?"
    },
    {
      "character": "Maya",
      "text": "Are you sure I’m the correct target?"
    },
    {
      "character": "Ayane",
      "text": "Frankly, I can’t think of any better targets right now. And there are definitely some things I’d like to have you clear up."
    },
    {
      "character": "Maya",
      "text": "I see. And what better setting to do that than a table full of our peers who will have no idea what we’re talking about?"
    },
    {
      "character": "Touka",
      "text": "It’s true. I am quite lost right now."
    },
    {
      "character": "Ayane",
      "text": "Well...what’ll it be? Truth or-"
    },
    {
      "character": "Maya",
      "text": "Dare."
    },
    {
      "character": "Ayane",
      "text": "Oh. Oh, right. I just kind of assumed you were going to choose truth."
    },
    {
      "character": "Maya",
      "text": "I am, unfortunately, in a position where I will never choose truth."
    },
    {
      "character": "Kirin",
      "text": "Welp, that helps narrow down my list for the next go around. Now to figure out who would rather kiss me between Molly and Maya."
    },
    {
      "character": "Ayane",
      "text": "Umm..."
    },
    {
      "character": "Ami",
      "text": "Come on, Ayane. There’s gotta be {i}something{/i} you want out of Maya, right?"
    },
    {
      "character": "Ayane",
      "text": "Maya...I..."
    },
    {
      "character": "Ayane",
      "text": "I dare you to always look after Ami and Sensei if anything bad ever happens to me."
    },
    {
      "character": "Kirin",
      "text": "God! You’re all so fucking boring! "
    },
    {
      "character": "Nodoka",
      "text": "To be fair, your question wasn’t much better."
    },
    {
      "character": "Ami",
      "text": "What do you mean “if something bad ever happens to you?” That’s really ominous and I don’t like it."
    },
    {
      "character": "Molly",
      "text": "It’s the request of a seasoned warrior at the end of her days who wants nothing more than to watch the kingdom she used to serve flourish."
    },
    {
      "character": "Molly",
      "text": "Maya is the next generation of the kingsguard and Ayane-"
    },
    {
      "character": "Maya",
      "text": "Molly, shut up. "
    },
    {
      "character": "Maya",
      "text": "Ayane, if anything bad ever {i}does{/i} happen to you, it will be precisely {i}because{/i} of that destructive brand of selflessness. "
    },
    {
      "character": "Maya",
      "text": "But regardless of that...I promise you, dare or not, that I will always protect the two of them no matter what happens. "
    },
    {
      "character": "Maya",
      "text": "You have my word."
    },
    {
      "character": "Molly",
      "text": "And my bow."
    },
    {
      "character": "Maya",
      "text": "Molly, {i}please{/i} shut up."
    },
    {
      "character": "Ami",
      "text": "Why do I want to cry now?! And why are my friends so sweet when they’re not trying to get with my guardian?!"
    },
    {
      "character": "Molly",
      "text": "Let it be known that I, Molly MacCormack, have not attempted such a feat yet! At least not intentionally. But there was that one time in my room when-"
    },
    {
      "character": "Ami",
      "text": "When what?"
    },
    {
      "character": "Molly",
      "text": "Ah! Ami popped her racial ability that lets her get rid of all negative status effects once per day!"
    },
    {
      "character": "Ayane",
      "text": "Wouldn’t that make you the only person at the table {i}without{/i} that ability? Seeing as we’re all Japanese and whatnot."
    },
    {
      "character": "Maya",
      "text": "What is the Irish racial ability?"
    },
    {
      "character": "Molly",
      "text": "One that lets me dodge a targeted character ability once per day! Which I will use right now to stop myself from telling the rest of my embarrassing and shameful bedroom story!"
    },
    {
      "character": "Ami",
      "text": "You absolutely will not-"
    },
    {
      "character": "Maya",
      "text": "Molly. Truth or dare?"
    },
    {
      "character": "Ami",
      "text": "Oh, damn it, Maya! I was this close to figuring out if she needs to be added to my list or not!"
    },
    {
      "character": "Ayane",
      "text": "You still have that thing?"
    },
    {
      "character": "Ami",
      "text": "I will never get rid of it."
    },
    {
      "character": "Molly",
      "text": "The great and powerful Emerald Guardian is no stranger to risk...so the only option for me to choose is dare!"
    },
    {
      "character": "Maya",
      "text": "Excellent. I dare you to never tell anyone about any strange or embarrassing stories involving you or Sensei ever again as I thoroughly enjoy having an appetite and do not want it permanently ruined."
    },
    {
      "character": "Ayane",
      "text": "You realize that can just be bypassed the next time someone uses a truth command on her, right?"
    },
    {
      "character": "Maya",
      "text": "Every second I can buy is worth a thousand truths."
    },
    {
      "character": "Molly",
      "text": "A Thousand Truths sounds like a good guild name. Or an album title for a V-Kei band if you add a few more broody adjectives to the mix."
    },
    {
      "character": "Molly",
      "text": "Like “A Thousand Bloody Screaming Truths in the Dead of the Night” or “A Thousand Angels Screaming Truths in...Blood.”"
    },
    {
      "character": "Molly",
      "text": "Or something."
    },
    {
      "character": "Maya",
      "text": "I also dare you to never speak again."
    },
    {
      "character": "Molly",
      "text": "You really do sound like the Herald of the Adolescents at times, you know."
    },
    {
      "character": "Ami",
      "text": "Heheh...isn’t it great? It’s like I have an extra Sensei around whenever the first one forgets he’s supposed to love me every hour of every day."
    },
    {
      "character": "Maya",
      "text": "I have no clue what you’re talking about. But it appears that my time has expired so, please. Proceed."
    },
    {
      "character": "Molly",
      "text": "Then...in that case..."
    },
    {
      "character": "Molly",
      "text": "Touka!"
    },
    {
      "character": "Touka",
      "text": "Present!"
    },
    {
      "character": "Molly",
      "text": "Truth or dare? Choose your destiny."
    },
    {
      "character": "Touka",
      "text": "Truth!"
    },
    {
      "character": "Touka",
      "text": "But only because I know your degeneracy is nothing but a false label that others have plastered on you due to countless misunderstandings and I would like to give you a chance to prove your wholesomeness."
    },
    {
      "character": "Molly",
      "text": "Gah! Thank you so much for your sweet and honeyed words! "
    },
    {
      "character": "Molly",
      "text": "NOW FORGIVE ME AS I LAY WASTE TO THEM! MWAHAHAHAH!"
    },
    {
      "character": "Touka",
      "text": "Um...I beg your pardon?"
    },
    {
      "character": "Molly",
      "text": "Favorite sex position! What is it?!"
    },
    {
      "character": "Touka",
      "text": "Excuse me?!"
    },
    {
      "character": "Kirin",
      "text": "Ayyy! Molly coming in clutch! Maybe I’ll dare her to kiss me since I can’t dare Nodoka to do it."
    },
    {
      "character": "Nodoka",
      "text": "I’d refuse anyway. Your sister on the other hand..."
    },
    {
      "character": "Molly",
      "text": "What is it, Touka?! What is thy position of choice?!"
    },
    {
      "character": "Touka",
      "text": "Umm...r...regular?"
    },
    {
      "character": "Ayane",
      "text": "I, too, am a fan of “regular style.”"
    },
    {
      "character": "Molly",
      "text": "A {i}real{/i} position! Not one you made up!"
    },
    {
      "character": "Touka",
      "text": "I don’t know! I was never taught their {i}names!{/i} No such terminology was included in {i}any{/i} of the Powerpoint presentations I watched on the matter!"
    },
    {
      "character": "Touka",
      "text": "And why did I have to be the one who was assaulted with the first lewd question of the night when I am inarguably the most wholesome person at this table!"
    },
    {
      "character": "Nodoka",
      "text": "Strange. Am I wrong in remembering you asking Makoto something similar last year?"
    },
    {
      "character": "Touka",
      "text": "Yes! You are!"
    },
    {
      "character": "Kirin",
      "text": "Touka, the lewd questions are the best part of the game. Just answer."
    },
    {
      "character": "Touka",
      "text": "They are not! And I already did!"
    },
    {
      "character": "Ayane",
      "text": "How about this? You don’t need to know the {i}name{/i} of the position so long as you describe what it looks like."
    },
    {
      "character": "Molly",
      "text": "The rogue preaches the truth! The rest of us are knowledgeable enough to connect the dots! Outline your constellation for us, Touka!"
    },
    {
      "character": "Touka",
      "text": "How am I supposed to know that without having any experience?!"
    },
    {
      "character": "Ami",
      "text": "Just...tell us what kind of porn you watch?"
    },
    {
      "character": "Kirin",
      "text": "Yeah. Which is a totally normal thing that none of us here will ever hold against you."
    },
    {
      "character": "Touka",
      "text": "It’s...unbecoming of a lady to consume such material..."
    },
    {
      "character": "Kirin",
      "text": "I get that. Especially when you probably have a whole lineup of “sex therapists” back at your manor that help relieve your {i}tension{/i} for you. "
    },
    {
      "character": "Nodoka",
      "text": "Oooh, keep talking. I’m getting ideas. "
    },
    {
      "character": "Nodoka",
      "text": "Does anyone mind if I take a few no-"
    },
    {
      "character": "Ami",
      "text": "Yes."
    },
    {
      "character": "Ayane",
      "text": "No one’s going to hold your preferences against you, Touka."
    },
    {
      "character": "Kirin",
      "text": "Unless you’re a furry."
    },
    {
      "character": "Molly",
      "text": "Furries have feelings too."
    },
    {
      "character": "Touka",
      "text": "If I..."
    },
    {
      "character": "Touka",
      "text": "If I ever did watch something as vulgar as...pornography..."
    },
    {
      "character": "Touka",
      "text": "It would...probably be...the kind where...they speak directly to you...through the...the speakers..."
    },
    {
      "character": "Kirin",
      "text": "Like...POV shit?"
    },
    {
      "character": "Molly",
      "text": "No...No, I believe we’ve got a genuine ASMR fan in the server! How unsurprisingly fitting!"
    },
    {
      "character": "Kirin",
      "text": "That doesn’t really answer the position question, though."
    },
    {
      "character": "Ayane",
      "text": "Just take the victory, Molly. Touka’s obviously embarrassed and-"
    },
    {
      "character": "Molly",
      "text": "Insolent whelp! You have been given one simple task and have left nothing but scraps upon my wooden floors! Bequeath to me your true self! Surrender your inhibitions and announce to the world-"
    },
    {
      "character": "Touka",
      "text": "I already said it! The regular one! Where the man is behind the girl and the girl’s hands are tied to something in front of her! Like a...pole or...something!"
    },
    {
      "character": "Kirin",
      "text": "How fucked up does your algo have to be for something like that to be “regular?”"
    },
    {
      "character": "Touka",
      "text": "I seldom view such content! Forgive me for having more important things to do!"
    },
    {
      "character": "Nodoka",
      "text": "And sex servants. She never specifically denied the sex servants."
    },
    {
      "character": "Touka",
      "text": "I have no such thing!"
    },
    {
      "character": "Touka",
      "text": "Ami! It is now your turn because everyone has decided to gang up on me and I am feeling very overwhelmed!"
    },
    {
      "character": "Ami",
      "text": "Don’t be! And excellent choice of position!"
    },
    {
      "character": "Touka",
      "text": "I would very much like to move past that right now! Truth or dare!"
    },
    {
      "character": "Ami",
      "text": "Let’s go with...truth!"
    },
    {
      "character": "Kirin",
      "text": "Ask her something lewd! Keep the ball rolling!"
    },
    {
      "character": "Touka",
      "text": "I would never-"
    },
    {
      "character": "Kirin",
      "text": "But it would make you {i}cooler...{/i}"
    },
    {
      "character": "Touka",
      "text": "Does...talking about such things truly make one cooler? I was under the impression it just made you a harlot."
    },
    {
      "character": "Kirin",
      "text": "Are you calling me a {i}harlot,{/i} Touka?"
    },
    {
      "character": "Touka",
      "text": "Are...Are you not? I thought that was your whole thing."
    },
    {
      "character": "Molly",
      "text": "F’s in chat for Kirin. "
    },
    {
      "character": "Ami",
      "text": "Ask whatever you want, Touka. I don’t really care. "
    },
    {
      "character": "Maya",
      "text": "You probably should. Your interests aren’t exactly socially acceptable."
    },
    {
      "character": "Ami",
      "text": "They are in some countries."
    },
    {
      "character": "Touka",
      "text": "I will...remain true to myself and ask you something that is {i}not{/i} lewd as...imagining myself ever being like Kirin worries me greatly. "
    },
    {
      "character": "Touka",
      "text": "Ami...what is the...most absurd thing you would ever do for someone you love?"
    },
    {
      "character": "Ami",
      "text": "The most...absurd thing...for someone I love?"
    },
    {
      "character": "Touka",
      "text": "R-Right! Where would you draw the line? Just how far would you go to prove yourself to the person you admire?"
    },
    {
      "character": "Kirin",
      "text": "His name is Sensei. You can call him Sensei."
    },
    {
      "character": "Ami",
      "text": "Hmm...I’ve never really thought about it before..."
    },
    {
      "character": "Molly",
      "text": "I’m calling BS. I’ve had you pegged as the yandere from the start."
    },
    {
      "character": "Touka",
      "text": "What is a yandere, exactly?"
    },
    {
      "character": "Maya",
      "text": "Someone so attached to the object of their affection that they’re willing to kill anyone and everyone who gets in their way."
    },
    {
      "character": "Touka",
      "text": "Oh. Well of course Ami isn’t like that. She’s such a good girl. Just look at her, lost in thought about the man she loves. It’s adorable."
    },
    {
      "character": "Nodoka",
      "text": "It’s even more adorable when you remember they’re related."
    },
    {
      "character": "Touka",
      "text": "Ami, you’d never {i}kill{/i} for Sensei, would you?"
    },
    {
      "character": "Ami",
      "text": "Oh, I {i}definitely{/i} would. I’m just trying to think of things that are {i}worse.{/i}"
    },
    {
      "character": "Touka",
      "text": "Than murder?!"
    },
    {
      "character": "Molly",
      "text": "Boom! Called it! Never doubt Molly MacCormack’s ability to accurately categorize young girls into various tropes and groups! It is for this exact reason that I was put on this planet!"
    },
    {
      "character": "Ami",
      "text": "How long do you have to torture someone for it to be worse than murder?"
    },
    {
      "character": "Touka",
      "text": "This isn’t wholesome at all! Pick dare instead!"
    },
    {
      "character": "Ami",
      "text": "Is sensory deprivation cruel? Or is that kind of just a thing that nobody really cares about?"
    },
    {
      "character": "Ayane",
      "text": "When did you get like this?"
    },
    {
      "character": "Ami",
      "text": "Like what?"
    },
    {
      "character": "Ayane",
      "text": "Like...Like that."
    },
    {
      "character": "Ami",
      "text": "Are you saying you {i}wouldn’t{/i} kill for Sensei?"
    },
    {
      "character": "Ayane",
      "text": "Uhh...I mean...I guess if I absolutely {i}had{/i} to. But-"
    },
    {
      "character": "Ami",
      "text": "Well, I guess we know who loves him more then!"
    },
    {
      "character": "Ami",
      "text": "Okey-dokey! Seeing as it’s my turn now and Kirin is the only one who hasn’t gotten a truth or a dare yet..."
    },
    {
      "character": "Kirin",
      "text": "Bring it on. And, just FYI, I won’t put up a fight like a certain {i}someone{/i} if you ask for my favorite sex position. I’ve got that drilled into the back of my-"
    },
    {
      "character": "Ami",
      "text": "Maya!"
    },
    {
      "character": "Kirin",
      "text": "Seriously?! But you literally {i}just{/i} acknowledged how I haven’t gotten to go yet!"
    },
    {
      "character": "Ami",
      "text": "Yeah, but I wasn’t really interested in anything I could make you say or do and I want to hear Maya say more cute things about how much she loves me."
    },
    {
      "character": "Maya",
      "text": "Well, good luck as I mentioned earlier that I am a “dares only” girl and have little interest in whispering sweet nothings to you just because I am asked to."
    },
    {
      "character": "Ami",
      "text": "Fine. Then I dare you to come over here and give me a hug because I love you."
    },
    {
      "character": "Ayane",
      "text": "Careful, Maya. You’ve been within ten feet of Sensei today so there’s a chance Ami might smell him on your skin and slit your throat when you’re not paying attention."
    },
    {
      "character": "Maya",
      "text": "If Ami truly wanted to kill me, I can guarantee you I would be dead already."
    },
    {
      "character": "Ami",
      "text": "Keep saying suspicious things like that and I might have to!~"
    },
    {
      "character": "narrator",
      "text": "{i}No one chooses Kirin for the next fifteen minutes. And no one ever agrees to kiss her either.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Touka only chose dares from that point on.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}And Ami manages to make it through the rest of the game without killing anyone.{/i}"
    }
  ],
  "state_changes": {
    "beachmas8": {
      "from": null,
      "to": true
    }
  }
}