{
  "event_id": 151,
  "event_label": "beachmas13",
  "dialogue": [
    {
      "character": "narrator",
      "text": "{i}Meanwhile...{/i}"
    },
    {
      "character": "Molly",
      "text": "Loyal followers who have graciously heeded my call! Surrender to me your time, and I will give unto you abilities unlike anyone has ever seen!"
    },
    {
      "character": "Tsuneyo",
      "text": "To unite all peoples within our nation!"
    },
    {
      "character": "Molly",
      "text": "Nice try, Ram! But this is not a two part speech and we have already exhausted our usage of the Team Rocket motto!"
    },
    {
      "character": "Maya",
      "text": "Molly, what are we doing?"
    },
    {
      "character": "Molly",
      "text": "An excellent question, Urrheak. And one that will be met with an excellent answer once I set the table. Just...in a metaphorical sense as our next real session isn’t until next weekend."
    },
    {
      "character": "Maya",
      "text": "If this has something to do with D&D, why is Yasu here? And where are the rest of the regular members? Why am I the only one who had to come?"
    },
    {
      "character": "Molly",
      "text": "As your dungeon master and someone who puts extraordinary thought into each and every one of your questions, I am going to need you to limit yourself to one at a time. "
    },
    {
      "character": "Molly",
      "text": "Please select an option from the screen you see before you. They should all be popping up in the form of a menu right now."
    },
    {
      "character": "Molly",
      "text": "Your decision may directly influence whether or not we kiss in the future."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "Your time has expired. Molly will remember this."
    },
    {
      "character": "Maya",
      "text": "What are we doing?"
    },
    {
      "character": "Molly",
      "text": "A roleplaying exercise."
    },
    {
      "character": "Maya",
      "text": "And I’m the only one from the normal group here because?..."
    },
    {
      "character": "Molly",
      "text": "Because you’re the worst at roleplaying."
    },
    {
      "character": "Maya",
      "text": "What?! Since when?!"
    },
    {
      "character": "Molly",
      "text": "Umm...since the beginning? "
    },
    {
      "character": "Molly",
      "text": "Technically speaking, Ram is most certainly worse than you. But I am already having her serve as my assistant in this exercise, so she is unable to appear as a player as well."
    },
    {
      "character": "Maya",
      "text": "There is no way Ami is better than me at roleplaying."
    },
    {
      "character": "Molly",
      "text": "I actually believe that Ami is rather exceptional and that all of the flaws in Arborea’s character are simply a byproduct of the type of girl she is in-world."
    },
    {
      "character": "Molly",
      "text": "Plus, she's much more involved in the actual happenings of the campaign than Urrheak. So I believe it would be best if you would, for lack of a better term, {i}git gud.{/i}"
    },
    {
      "character": "Maya",
      "text": "You realize Yasu’s not even part of the campaign, right? How am I supposed to {i}git gud{/i} by practicing with someone who has not only less experience than me, but is {i}clinically insane?{/i}"
    },
    {
      "character": "Yasu",
      "text": "If the light of the Lord makes me crazy, I don’t want to be sane."
    },
    {
      "character": "Maya",
      "text": "Do you see what I mean?"
    },
    {
      "character": "Molly",
      "text": "Hey! Yasu’s a valued member of the manga club now. Which means that it’s only fair that she gets invited to all of the same nerdy things that we do or she will feel like an outcast."
    },
    {
      "character": "Yasu",
      "text": "I am not meant to blend in with anyone. A streak of white stands out amidst a sea of darkness. And if there is anything-"
    },
    {
      "character": "Maya",
      "text": "Yes, god is good. Hooray. Now what? "
    },
    {
      "character": "Tsuneyo",
      "text": "Roll for initiative. Ram does not like the attitude the bird person is taking and has an advantage on attacks against all feathered creatures."
    },
    {
      "character": "Molly",
      "text": "Nobody is rolling for initiative. This is a combat-free zone right now and any attempt at violence will be immediately thwarted by a large group of men in robes watching from the corners of the room."
    },
    {
      "character": "Yasu",
      "text": "I like this game."
    },
    {
      "character": "Molly",
      "text": "We haven’t technically started yet, Yasu."
    },
    {
      "character": "Yasu",
      "text": "How will I know when we’ve begun? Will it hurt? Because Touka will be very upset if I get injured while she is not around."
    },
    {
      "character": "Maya",
      "text": "Are you seriously making me do this?"
    },
    {
      "character": "Molly",
      "text": "I’ll reward you with a new magic item at the end of the session if I believe you’ve done well. You’re the only member of the party without one right now, so it’s sure to come in handy."
    },
    {
      "character": "Molly",
      "text": "Or not. I don’t know. I haven’t thought up an item yet."
    },
    {
      "character": "Maya",
      "text": "I hope you’ve put more effort into the scenario than you have the reward. "
    },
    {
      "character": "Molly",
      "text": "Never fear, Aarakocra! For I have devised an in-universe, solo-scenario for everyone’s favorite unenthusiastic bird-cleric!"
    },
    {
      "character": "Maya",
      "text": "Oh, you’re far too kind."
    },
    {
      "character": "Yasu",
      "text": "Birds are sacred beings in the eyes of He who is so commonly misunderstood. They can pass through planes at will and hear things that normal humans can not."
    },
    {
      "character": "Maya",
      "text": "This particular bird wishes she were deaf right about now."
    },
    {
      "character": "Tsuneyo",
      "text": "Ram makes a ranged attack against Urrheak. "
    },
    {
      "character": "Molly",
      "text": "Ram doesn’t have a bow. It was confiscated at the door."
    },
    {
      "character": "Tsuneyo",
      "text": "Ram casts fireball."
    },
    {
      "character": "Molly",
      "text": "Ram doesn’t have that spell. Now stop trying to fight and let me explain the scenario."
    },
    {
      "character": "Molly",
      "text": "The church doors squeak and squeal as Urrheak pushes them open, setting foot into the main hall of the holiest building in all of Newhaven — the Cathedral of Misguided Souls."
    },
    {
      "character": "Molly",
      "text": "The rest of the party has split off...venturing into separate parts of the town in order to train and hone their respective skills before their next major outing."
    },
    {
      "character": "Molly",
      "text": "It’s the middle of the day...and yet no one apart from several nuns and men dressed in robes is present in the entire hall."
    },
    {
      "character": "Molly",
      "text": "Urrheak, who has fallen out of favor with his god due to the unending, gluttonous indulgence in food and drink, seeks to regain favor...or perhaps even find a {i}new{/i} god."
    },
    {
      "character": "Molly",
      "text": "But is this cathedral the right destination for a goal like this?...Or is there something sinister lurking in the background...waiting for a chance to prey upon him in his weakest moment?"
    },
    {
      "character": "Molly",
      "text": "A hoodless nun, Deirbhile, who looks starkly different from the rest, steps into a circle created by rays of light leaking in through stained glass...looks Urrheak right in the eyes...and says {i}what?{/i}"
    },
    {
      "character": "Molly",
      "text": "It is at this point, Yasu, where you will take the role of your character and-"
    },
    {
      "character": "Yasu",
      "text": "Is it salvation you seek, feathered one?...Or are you lost in more ways than one?"
    },
    {
      "character": "Molly",
      "text": "Oooh! Okay! No trouble at all, I see! Very impressive!"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "There is no need to fear me...for all people are safe within these walls. And the only enemy you will ever encounter within them is your own reflection."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "So, tell me...what is it that brings you here? What is it that brings you to the closest idea of {i}Heaven{/i} that we could ever truly know?"
    },
    {
      "character": "Molly",
      "text": "The nun steps out of the light and comes face to face with Urrheak! But despite being a full two feet shorter, it is {i}she{/i} who seems more powerful at the moment."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Hah..."
    },
    {
      "character": "Maya",
      "text": "I come not in search of salvation...but guidance. As it appears I have lost my way."
    },
    {
      "character": "Yasu",
      "text": "We all lose our way from time to time, feathered one. With paths so shrouded by darkness, it only makes sense that you’ll forget where you are going if you look away for even a moment."
    },
    {
      "character": "Yasu",
      "text": "But before I tell you how to find your way home...may I ask...what do you hope to find when you get there?"
    },
    {
      "character": "Maya",
      "text": "Food."
    },
    {
      "character": "Yasu",
      "text": "Isn’t that precisely what landed you here in the first place?"
    },
    {
      "character": "Maya",
      "text": "Isn’t that meta-gaming? She’s not supposed to know that. She just remembers it from your description earlier."
    },
    {
      "character": "Molly",
      "text": "Yasu’s character is an extremely powerful arch-priest with the ability to successfully cast Detect Thoughts on any humanoid creature without giving them a chance to block it via Wisdom save."
    },
    {
      "character": "Molly",
      "text": "Basically, she reads minds and there is nothing you can do about it."
    },
    {
      "character": "Maya",
      "text": "Oh, good. That’s fair."
    },
    {
      "character": "Maya",
      "text": "Yes. That is the reason I am here. But frankly, I find it exhausting having to obey the words and laws of a god when there are things out there more important to me."
    },
    {
      "character": "Yasu",
      "text": "There is nothing more important than God."
    },
    {
      "character": "Maya",
      "text": "There are {i}tons{/i} of things more important than god. Food, friends, fun...why should an invisible entity be the one who chooses the paths we walk when we’re perfectly capable of choosing ourselves?"
    },
    {
      "character": "Yasu",
      "text": "If that were the case, you wouldn’t be here. "
    },
    {
      "character": "Yasu",
      "text": "The only reason you have entered these halls is because you did not know where to go...and felt powerless without the guidance you abhor so much."
    },
    {
      "character": "Yasu",
      "text": "Do you not see the hypocrisy?"
    },
    {
      "character": "Maya",
      "text": "All I see is another cultist trying to fortify the numbers of her organization through vague projection and what I assume is a gross amount of donations from the local aristocracy."
    },
    {
      "character": "Molly",
      "text": "At that moment, the candles blow out — leaving the light Deirbhile was standing in moments ago as the only thing illuminating the hall."
    },
    {
      "character": "Molly",
      "text": "It is clear by the reaction from the hooded men and other nuns that this is no normal feat. Chatter can be heard in the background as some of the men and women begin to filter into smaller, private rooms."
    },
    {
      "character": "Molly",
      "text": "Urrheak can feel something churning in his chest...like it’s reacting to the dark. And it compels him to move closer to the light to quell it."
    },
    {
      "character": "Maya",
      "text": "Urrheak...does {i}not{/i} move closer to the light. In fact, he takes a step further away from it."
    },
    {
      "character": "Molly",
      "text": "The churning in his stomach grows more violent in response."
    },
    {
      "character": "Yasu",
      "text": "The word “cultist” is so harsh...don’t you think?"
    },
    {
      "character": "Yasu",
      "text": "It matters not to me what the others think or do...as they’ll all wind up in these halls once the rest of the roads have been plucked from the ground and consumed."
    },
    {
      "character": "Yasu",
      "text": "It is just my greatest pleasure to help those in need find their way sooner."
    },
    {
      "character": "Yasu",
      "text": "And if there was ever {i}anyone{/i} who looked like they could benefit from my assistance...it would be you."
    },
    {
      "character": "Maya",
      "text": "Uh-huh. And what makes me different from the rest? What is so special about {i}me{/i} compared to those I travel with?"
    },
    {
      "character": "Yasu",
      "text": "All you need to do is look in the mirror and you will know."
    },
    {
      "character": "Maya",
      "text": "No mirrors around. Just tell me, Deir...whatever."
    },
    {
      "character": "Yasu",
      "text": "If you would like the simple answer..."
    },
    {
      "character": "Yasu",
      "text": "It’s your feathers."
    },
    {
      "character": "Yasu",
      "text": "Your ability to take flight...venture forth to places unseen by the rest of us. Places that could never be reached without {i}your{/i} help...or..."
    },
    {
      "character": "Yasu",
      "text": "At least someone {i}like{/i} you."
    },
    {
      "character": "Yasu",
      "text": "There aren’t many...but they exist. And even those dwindling, finite numbers shake you to your core...don’t they?"
    },
    {
      "character": "Yasu",
      "text": "The reason you ask what makes you special is not because you disbelieve it...but because you want to be reassured. You want to know you’re {i}different.{/i}"
    },
    {
      "character": "Yasu",
      "text": "But that difference will expire just as all things will. And the only way to postpone your demise is to-"
    },
    {
      "character": "Maya",
      "text": "Okay, can we stop here? Urrheak wouldn’t have even come somewhere like this in the first place if he was so disinterested in his god that he started acting out against him."
    },
    {
      "character": "Yasu",
      "text": "And yet you did."
    },
    {
      "character": "Maya",
      "text": "Yeah, because I didn’t have a choice in the matter."
    },
    {
      "character": "Yasu",
      "text": "That’s exactly what I’ve been saying all along...{i}Urrheak.{/i}"
    },
    {
      "character": "Maya",
      "text": "Yasu, you know that gods are just things we came up with to make ourselves worry less about dying, right? Things we, human beings, invented to fill some sort of void in ourselves."
    },
    {
      "character": "Molly",
      "text": "Hey, Ur- Maya. There’s no need to make things all personal. Yasu was just playing a character."
    },
    {
      "character": "Yasu",
      "text": "Character?"
    },
    {
      "character": "Maya",
      "text": "Yeah, and that’s good for her. But forcing characters that don’t mix together doesn’t always lead to a good result when opposites only attract like...10%% of the time max."
    },
    {
      "character": "Maya",
      "text": "This wasn’t a roleplaying exercise. It was a {i}disagreement{/i} exercise that mimicked nearly a million conversations I’ve had about this exact thing in the past. It’s just annoying."
    },
    {
      "character": "Yasu",
      "text": "Why do you always say things that make you feel so alone?"
    },
    {
      "character": "Maya",
      "text": "And that! How do you {i}do{/i} that?! How do you just start crying out of nowhere all the time?!"
    },
    {
      "character": "Tsuneyo",
      "text": "I believe Yasu has what are called “feelings.” Which is something you appear to not understand as you are currently desecrating a holy site with universe-breaking dialogue."
    },
    {
      "character": "Molly",
      "text": "That’s true. I never called an end to the session, so this is all still canonically happening in the campaign. Kind of. I don’t know. I might have to write around it later. We’ll see."
    },
    {
      "character": "Maya",
      "text": "Nothing I do is universe-breaking. But forcing characters into situations they don’t belong in is-"
    },
    {
      "character": "Yasu",
      "text": "Is something a...god would do?..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "He is real..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Yasu",
      "text": "And He wants {i}you.{/i}"
    },
    {
      "character": "Tsuneyo",
      "text": "My ability to differentiate good roleplaying from bad roleplaying is obviously not substantial seeing as I am a part of the exercise, but Yasu’s character seemed very believable."
    },
    {
      "character": "Yasu",
      "text": "Character?"
    },
    {
      "character": "Molly",
      "text": "I agree. I’m not sure how I feel about adding another party member at this stage in the game as Rin has yet to return, but perhaps Yasu would be interested in playing several NPCs for fun?"
    },
    {
      "character": "Tsuneyo",
      "text": "Has Nithhala announced an interest in returning?"
    },
    {
      "character": "Molly",
      "text": "Nithhala and I don’t talk very much anymore. But I have a feeling she’ll be back one day. No one stays a normie forever."
    },
    {
      "character": "Chika",
      "text": "EVERYBODY SHUT UP!"
    },
    {
      "character": "Molly",
      "text": "Oh, speaking of normies."
    },
    {
      "character": "Chika",
      "text": "Playtime is over! The queen is going to be on TV in five minutes and everybody needs to shut the fuck up so we can all worship her!"
    },
    {
      "character": "Molly",
      "text": "Alas...our fun has once again been cut down by the popular folk and their ability to control the room."
    },
    {
      "character": "Tsuneyo",
      "text": "I thought the queen died?"
    },
    {
      "character": "Molly",
      "text": "Is {i}that{/i} why my dad sounded so happy on the phone the other day?"
    },
    {
      "character": "Ayane",
      "text": "Hey. How’d the roleplaying exercise go? I wanted to come and watch, but I buried Sana too deep in the sand and it took forever to get her out."
    },
    {
      "character": "Sana",
      "text": "I thought...I was going to die..."
    },
    {
      "character": "Maya",
      "text": "It...went. That’s for sure."
    },
    {
      "character": "Ayane",
      "text": "Oh, and have you seen Ami anywhere? She’s been gone for a while and I haven’t been able to reach her."
    },
    {
      "character": "Maya",
      "text": "Not since this morning. But unless her interests have completely changed overnight, I’m sure she’ll be back to watch the {i}queen{/i} momentarily."
    },
    {
      "character": "Imani",
      "text": "The queen? Didn’t she die?"
    },
    {
      "character": "Ayane",
      "text": "Not that queen — Niki Nakayama. Kumon-mi’s idol queen."
    },
    {
      "character": "Imani",
      "text": "Oh, her? I’ve seen her on billboards. I just call her Hot Noriko."
    },
    {
      "character": "Noriko",
      "text": "Hi. Ugly Niki here. Who are we making fun of next?"
    },
    {
      "character": "Imani",
      "text": "Go grab your Halloween costume if you wanna compete again, kid. It’s all been downhill for you since then."
    },
    {
      "character": "Noriko",
      "text": "Yeah. I’m at my prettiest when it looks like I’m capable of killing people. And I left my pocket knife at home on accident, so I’m just screwed all weekend, aren’t I?"
    },
    {
      "character": "Kirin",
      "text": "Hey. Is your hot sister on TV yet? What’s she wearing? Rate the likelihood of a wardrobe malfunction on a scale of 1-10."
    },
    {
      "character": "Molly",
      "text": "Why don’t we just...leave the door open so people can stop coming in like that?"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas13": {
      "from": null,
      "to": true
    }
  }
}