{
  "event_id": 152,
  "event_label": "beachmas14",
  "dialogue": [
    {
      "character": "Kirin",
      "text": "You know nobody would hold it against you if you were to ever fuck your sister, right?"
    },
    {
      "character": "Noriko",
      "text": "Are you saying that because you actually believe it? Or because you just want someone to say the same thing about you and {i}your{/i} sister?"
    },
    {
      "character": "Imani",
      "text": "I wouldn’t blame either one of you for nailing your sisters. They’re both hot as Hell and it’s not like you run the risk of inbreeding."
    },
    {
      "character": "Noriko",
      "text": "Bad move. Kirin’s been waiting for someone to validate her fantasy of being fucked by her sister for years now and you’ve just opened the floodgates."
    },
    {
      "character": "Kirin",
      "text": "I do not want my sister to {i}fuck{/i} me, you two."
    },
    {
      "character": "Kirin",
      "text": "I want to fuck {i}her.{/i} It’s different."
    },
    {
      "character": "Imani",
      "text": "Oh dayum. She ain’t even hidin’ it."
    },
    {
      "character": "Kirin",
      "text": "Just with you two. Don’t tell anybody else."
    },
    {
      "character": "Imani",
      "text": "Am I...one of the girls now?"
    },
    {
      "character": "Noriko",
      "text": "You’re certainly a special kind of person, Kirin."
    },
    {
      "character": "Kirin",
      "text": "Oh, please. Like you’ve never masturbated with your sister’s hairbrush before."
    },
    {
      "character": "Noriko",
      "text": "Niki’s hairbrush was way too big for that sort of thing. I used a marker, like a real {i}distinguished{/i} lady."
    },
    {
      "character": "Kirin",
      "text": "No wonder she’s head over heels for Sensei. Girl spent her whole life with an XXL hair brush preparing herself for his giant dick."
    },
    {
      "character": "Imani",
      "text": "Uhh...hi. Teacher here."
    },
    {
      "character": "Kirin",
      "text": "I thought you were one of the girls?"
    },
    {
      "character": "Imani",
      "text": "I was until you started talking about Senpai’s penis. Now I’m just a very unqualified detective."
    },
    {
      "character": "Kirin",
      "text": "Oh, I haven’t seen it. Sensei’s a totally respectable adult who only has sex with other adult women. But, let’s be real, we all know he’s packing. "
    },
    {
      "character": "Imani",
      "text": "As your teacher, I’m going to have to ask you to stop saying things like that."
    },
    {
      "character": "Imani",
      "text": "But, as one of the girls, you right. He packin’."
    },
    {
      "character": "Imani",
      "text": "But wait, what does Noriko’s sister’s hair brush have to do with Senpai?"
    },
    {
      "character": "Kirin",
      "text": "They dated for years. And if we’re all gonna keep pretending he never tapped that, we might as well check ourselves into a mental institution because that’s just insane."
    },
    {
      "character": "Noriko",
      "text": "Shh! Chika doesn’t know yet! And for the record, I have confirmation from both sources that they never made it that far."
    },
    {
      "character": "Kirin",
      "text": "Fine. Whatever. But she’s still probably swallowed more of his jizz than there is water in our bodies."
    },
    {
      "character": "Imani",
      "text": "He...dated {i}her?{/i} That mega-babe on a sparkly stage, singing in front of thousands of people?! Ain’t she a little young?!"
    },
    {
      "character": "Noriko",
      "text": "She’s almost 30."
    },
    {
      "character": "Imani",
      "text": "Why are there so many hot girls around here who look way younger than they actually are?!"
    },
    {
      "character": "Imani",
      "text": "And how the fuck are we supposed to compete with an idol?! The hell, Senpai?!"
    },
    {
      "character": "Noriko",
      "text": "{i}Compete?{/i}"
    },
    {
      "character": "Noriko",
      "text": "Are you gunning for Sensei’s affection as well, Imani?"
    },
    {
      "character": "Imani",
      "text": "Um..."
    },
    {
      "character": "Imani",
      "text": "Nooooo?..."
    },
    {
      "character": "Noriko",
      "text": "Convincing."
    },
    {
      "character": "Kirin",
      "text": "No wonder you’ve never accepted any of my advances. You’ve already fallen for the same guy literally everyone else has fallen for."
    },
    {
      "character": "Imani",
      "text": "You know, your ability to just deny the truth and make up your own version of shit instead is really something to be marveled at. "
    },
    {
      "character": "Noriko",
      "text": "If you don’t mind me asking...what’s been holding you back?"
    },
    {
      "character": "Noriko",
      "text": "You guys work together...you get along really well...and you’re straight up so beautiful that it makes literally everyone in class jealous. "
    },
    {
      "character": "Noriko",
      "text": "Realistically speaking, you’d have a much better chance than any one of us, don’t you think?"
    },
    {
      "character": "Imani",
      "text": "Romance is..."
    },
    {
      "character": "Imani",
      "text": "Well, first and foremost, it’s not a thing I should be discussing with a bunch of teens. Especially teens who are in regular contact with the subject of said romance."
    },
    {
      "character": "Imani",
      "text": "It’s just...not a thing I’m really {i}good{/i} at. And it’s not a thing Senpai seems particularly interested in to begin with, so..."
    },
    {
      "character": "Imani",
      "text": "Not to mention there ain’t a single person in class who would endorse it even if, by some stretch of imagination, things {i}did{/i} go somewhere other than the friend route."
    },
    {
      "character": "Kirin",
      "text": "I’d endorse it. And watch it repeatedly if it was on film. That sounds hot."
    },
    {
      "character": "Imani",
      "text": "You’re barely a human. You don’t count."
    },
    {
      "character": "Kirin",
      "text": "N-"
    },
    {
      "character": "Imani",
      "text": "Nodoka too. She’s even {i}less{/i} human. But you’ve been laying it on a lot harder than she has, yo."
    },
    {
      "character": "Noriko",
      "text": "Why does it matter if we endorse it? You should always follow your heart...even if it means putting the people you care about at risk. "
    },
    {
      "character": "Imani",
      "text": "Guys, I’m glad that I’m apparently young and cool enough to talk to about this...but I really shouldn’t be getting into it right now. "
    },
    {
      "character": "Imani",
      "text": "It’s Christmas. We should be hanging out and watching Hot Noriko’s concert. Not discussing why I should be gunning for my senpai’s heart. "
    },
    {
      "character": "Imani",
      "text": "At the end of the day, we’re good friends who work together....and that’s how shit’s going to stay for the indefinite future."
    },
    {
      "character": "Imani",
      "text": "Or at least until we get really, {i}really{/i} drunk one night and wind up sleeping together and taking shit from there like all {i}real{/i} adults do."
    },
    {
      "character": "Imani",
      "text": "But until that happens, I’m just Imani Imai — the hot, fun student teacher who {i}isn’t{/i} boning the other teacher. Even if he {i}is{/i} packing. The end."
    },
    {
      "character": "Noriko",
      "text": "If that’s what makes you happy, Imani..."
    },
    {
      "character": "Kirin",
      "text": "Hmm..."
    },
    {
      "character": "Kirin",
      "text": "You know what would make {i}me{/i} happy?"
    },
    {
      "character": "Imani",
      "text": "Literally anyone boning Senpai and you getting to watch and/or participate?"
    },
    {
      "character": "Kirin",
      "text": "Well..."
    },
    {
      "character": "Noriko",
      "text": "You haven’t exactly been all that reserved about it, Kirin."
    },
    {
      "character": "Kirin",
      "text": "What if I was going to say...something like, “Spending the whole Christmas party hanging out with the two of you?”"
    },
    {
      "character": "Noriko",
      "text": "..."
    },
    {
      "character": "Imani",
      "text": "..."
    },
    {
      "character": "Kirin",
      "text": "..."
    },
    {
      "character": "Kirin",
      "text": "While we take turns with Sensei."
    },
    {
      "character": "Noriko",
      "text": "There it is."
    },
    {
      "character": "Imani",
      "text": "Hope your Secret Santa gift this year is a chastity belt. You need it."
    },
    {
      "character": "Ami",
      "text": "I’M LATE, I’M LATE, I’M LATE! HOW DID YOU LET THIS HAPPEN?!"
    },
    {
      "character": "Sensei",
      "text": "Why is it suddenly my fault that you’re irresponsible when it comes to time?"
    },
    {
      "character": "Ami",
      "text": "My plans for the day didn’t factor in falling unconscious from spending too long in the sauna!"
    },
    {
      "character": "Sensei",
      "text": "I assume they didn’t factor in the hour you had to spend in the bath afterward as well?"
    },
    {
      "character": "Ami",
      "text": "I was all sweaty and gross! And so were you! It was a necessary evil!"
    },
    {
      "character": "Sensei",
      "text": "But an entire {i}hour?{/i}"
    },
    {
      "character": "Ami",
      "text": "MOVE OVER! NIKI’S NUMBER ONE FAN COMING THROUGH!"
    },
    {
      "character": "Chika",
      "text": "HA! Funny joke, Ami! A real number one fan would have cleared her entire schedule to be here from the start!"
    },
    {
      "character": "Ami",
      "text": "Things happened! Things beyond my control! There wasn’t anything I could do!"
    },
    {
      "character": "Chika",
      "text": "Likely story! Now, shut the fuck up! The queen is about to speak!"
    },
    {
      "character": "Sensei",
      "text": "You guys have no idea how glad I am to see you."
    },
    {
      "character": "Miku",
      "text": "First, ya disappear all night...Then, ya disappear all day...If I didn’t know any better, I’d say you were gettin’ dragged along on special event chains, Sensei. "
    },
    {
      "character": "Ayane",
      "text": "Did you have fun with Ami, at least? She seemed pretty excited to enact her revengeful “Hang out with me all day” plan this morning."
    },
    {
      "character": "Sensei",
      "text": "I’m not sure if “fun” is the word I’d use. But it was definitely a time nonetheless."
    },
    {
      "character": "Sensei",
      "text": "What have you guys been up to? Anything interesting happen while I was gone?"
    },
    {
      "character": "Sana",
      "text": "Not...particularly...It was...a pretty normal day..."
    },
    {
      "character": "Sana",
      "text": "We just...hung around and...played games and stuff..."
    },
    {
      "character": "Sensei",
      "text": "No unexpected run-ins today?"
    },
    {
      "character": "Sana",
      "text": "Hm?...No...Why would-"
    },
    {
      "character": "Sana",
      "text": "Ah..."
    },
    {
      "character": "Ayane",
      "text": "Sana? What’s up? You look really flushed all of a sudden."
    },
    {
      "character": "Miku",
      "text": "Yo! Stop shakin’ the Switch or I ain’t ever gettin’ my chicken dinner!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Did something happen with you two? The only time I’ve ever seen Sana with that expression is the time I-"
    },
    {
      "character": "Ayane",
      "text": "Ah! "
    },
    {
      "character": "Ayane",
      "text": "No way..."
    },
    {
      "character": "Ayane",
      "text": "{i}Sana.{/i} "
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "You {i}didn’t.{/i}"
    },
    {
      "character": "Miku",
      "text": "Didn’t what? The heck’s goin’ on over here? And how come Sana looks like she just got caught with her pants-"
    },
    {
      "character": "Sana",
      "text": "I’m leaving and I’m taking my Switch!"
    },
    {
      "character": "Miku",
      "text": "Ay! I wasn’t done with that, ya friggin’ thief! "
    },
    {
      "character": "Sana",
      "text": "IT’S MINE!"
    },
    {
      "character": "Ayane",
      "text": "You, uhh...didn’t by any chance...see something you weren’t supposed to...right? Because she still hasn’t lived down when I-"
    },
    {
      "character": "Sensei",
      "text": "I didn’t see anything."
    },
    {
      "character": "Ayane",
      "text": "Then why is-"
    },
    {
      "character": "Sensei",
      "text": "Hey, ask her. I’m not trying to get anybody in trouble. I just wanted to make sure her day was going smoothly."
    },
    {
      "character": "Ayane",
      "text": "By...casually letting {i}her{/i} know that...{i}you{/i} know something...you shouldn’t?"
    },
    {
      "character": "Sensei",
      "text": "All I did was ask a simple question. Sana is the one who interpreted it that way. And if that means accidentally teaching her a lesson about her role as the one who should always be innocent, so be it."
    },
    {
      "character": "Ayane",
      "text": "Sensei...she’s a normal girl like the rest of us. Of course she’s going to-"
    },
    {
      "character": "Sensei",
      "text": "Don’t say it. I don’t want to hear it."
    },
    {
      "character": "Miku",
      "text": "Sensei...you get out there...and you get me that chicken. You got it?"
    },
    {
      "character": "Sensei",
      "text": "No, Miku. I have literally no idea what that means. And put your hands down. The game thing has been gone for a full minute."
    },
    {
      "character": "Miku",
      "text": "It’s only gone because {i}you let it walk away.{/i}"
    },
    {
      "character": "Sensei",
      "text": "That’s not what-"
    },
    {
      "character": "Rin",
      "text": "Uhh...Sensei?"
    },
    {
      "character": "Sensei",
      "text": "Rin? What’s up?"
    },
    {
      "character": "Rin",
      "text": "Heeeey...soo..."
    },
    {
      "character": "Rin",
      "text": "I am kind of like, thirty...maybe {i}fifteen{/i} seconds away from having a nervous breakdown right now? "
    },
    {
      "character": "Rin",
      "text": "So if you have a few minutes to listen to me yell a whole bunch of reasons you shouldn’t hate me sprinkled with even more that contradict that...uhh...could you maybe follow me into the hallway?"
    },
    {
      "character": "Sensei",
      "text": "Yeah. I just-"
    },
    {
      "character": "Ayane",
      "text": "Go. I’ll make sure no one else leaves the room so you guys can be alone. Not like they {i}would{/i} when Niki is playing anyway, but still."
    },
    {
      "character": "Rin",
      "text": "Thank you, Ayane. I’ll make it-"
    },
    {
      "character": "Ayane",
      "text": "Thank me later. Deal with this first."
    },
    {
      "character": "Rin",
      "text": "Yeah...Yeah, right."
    },
    {
      "character": "narrator",
      "text": "I lead the way into the hall and Rin follows closely behind, taking a deep breath once we move through the doors and the music of a girl I once [[probably] loved fades into nothing."
    },
    {
      "character": "narrator",
      "text": "Her breathing is irregular and panicked and it’s clear that she has some sort of bad news to deliver to me..."
    },
    {
      "character": "narrator",
      "text": "But considering the fact that there were no confessions this year and Otoha isn’t even here to help create any more problems, I’m not really sure what it could be."
    },
    {
      "character": "narrator",
      "text": "It’s probably not depression acting up either but, then again, I’ve never really been present when Rin slips {i}into{/i} one of her episodes and-"
    },
    {
      "character": "Rin",
      "text": "Sensei..."
    },
    {
      "character": "Sensei",
      "text": "Yeah...my bad. Lost in thought."
    },
    {
      "character": "Rin",
      "text": "Yeah! That’s cool. Cool cool cool cool cool cool. Uhh...........okay. Yeah. Words. I can do words. Rin is good at words."
    },
    {
      "character": "Rin",
      "text": "Fuck. Shit. Umm..."
    },
    {
      "character": "Rin",
      "text": "Right! So..."
    },
    {
      "character": "Rin",
      "text": "You...You know how we were kind of best friends for a while? Or at least really good friends who you wouldn’t specifically {i}call{/i} best friends because that’s not really a...thing that registers to...uhh..."
    },
    {
      "character": "Rin",
      "text": "So, anyway! You know how friends know stuff about each other? Like how you knew about my crush on Chika before anybody else? Or how I’m adopted? Stuff like that?"
    },
    {
      "character": "Sensei",
      "text": "Yeah...do you have a {i}new{/i} secret for me?"
    },
    {
      "character": "Rin",
      "text": "Uhhhhhhhhh..........not exactly. "
    },
    {
      "character": "Rin",
      "text": "But if it makes things any better, which it probably won’t because anyone with half a brain would leave me out here in the hall to melt into a puddle of gooey, red pulp, I’ll tell you anything you want!"
    },
    {
      "character": "Rin",
      "text": "Anything you want to know! Anything at all! Because if there’s anything you’ve been wondering-"
    },
    {
      "character": "Sensei",
      "text": "Are you stalling right now?"
    },
    {
      "character": "Rin",
      "text": "Yes! But I can’t help it because I’m scared that this will finally put an end to our relationship since you’re {i}already{/i} on the fence about me and I wouldn’t be able to take that!"
    },
    {
      "character": "Sensei",
      "text": "I’m not “on the fence,” Rin. I’m-"
    },
    {
      "character": "Rin",
      "text": "Yes you are! You’ve already called me out for focusing too much on Otoha and avoiding you and even if that’s not what I was trying to do, it’s what happened!"
    },
    {
      "character": "Sensei",
      "text": "But that doesn’t mean I’m planning on just dropping you. I have no reason to do that."
    },
    {
      "character": "Rin",
      "text": "Well, you sure as shit do now! Because this isn’t another one of Rin Rokuhara’s many minor infractions! This is a big fucking deal that could ruin {i}everything{/i} if it gets out. And I mean {i}everything.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Calm down...take a deep breath."
    },
    {
      "character": "Rin",
      "text": "How?! You told me to stop stalling and that would count as stalling! Should I stall or not stall?! Help me!"
    },
    {
      "character": "Sensei",
      "text": "Rin-"
    },
    {
      "character": "Rin",
      "text": "I told Otoha about you and Chika!"
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Rin",
      "text": "It was an accident, I swear! It just slipped out! And I made her promise not to tell anybody and I trust her but nobody is ever 100%% trustworthy, you know?! Like...what if {i}she{/i} slips next? Then someone {i}else?{/i}"
    },
    {
      "character": "Sensei",
      "text": "Well...that certainly explains why she was acting differently toward me during the Dorm Wars."
    },
    {
      "character": "Rin",
      "text": "I’m so sorry. I’m so so so sorry. I know how important it is for you to keep all of this stuff under wraps but here I am unwrapping everything like it’s-"
    },
    {
      "character": "Rin",
      "text": "Ha! Christmas! It {i}is{/i} Christmas! Oh, how fucking funny is that?!"
    },
    {
      "character": "Rin",
      "text": "And {i}then{/i} there’s Chika! Who’s so in love with you and it’s so adorable and she’s saying all these things about how happy she is and how important it is that no one finds out!"
    },
    {
      "character": "Rin",
      "text": "And that just makes me even more scared of what the fuck is going to happen if people do!"
    },
    {
      "character": "Rin",
      "text": "What if {i}she{/i} loses everything important to her?! And then {i}you{/i} lose {i}everything{/i} in general!"
    },
    {
      "character": "Rin",
      "text": "Not to mention poor Futaba who’s wrapped up in all of this too! What’ll happen when I fuck up and let {i}that{/i} slip as well, Sensei?! Why did you keep me around for so long?! I know too much! It’s not safe!"
    },
    {
      "character": "Sensei",
      "text": "It’s okay..."
    },
    {
      "character": "Rin",
      "text": "No, it’s not! Everyone I love is about to get hurt and it’s all because of me and I was too caught up in worrying about when Otoha is going to fuck me to even think about it!"
    },
    {
      "character": "Rin",
      "text": "I love you! I love Chika! And I’m sorry I couldn’t keep it a secret like you wanted me to and I understand if that makes you hate me, but I couldn’t hold it in anymore!"
    },
    {
      "character": "Sensei",
      "text": "Otoha hasn’t told anyone yet, has she?"
    },
    {
      "character": "Rin",
      "text": "Oh, god! Are you going to {i}kill{/i} her?"
    },
    {
      "character": "Sensei",
      "text": "What? No. Why would you even say something like that?"
    },
    {
      "character": "Rin",
      "text": "I don’t know! Your life is at stake! People do crazy things when they’re cornered!"
    },
    {
      "character": "Sensei",
      "text": "Rin, I {i}like{/i} Otoha. And even if she’s a bitch to me sometimes, I can talk to her. It’s not the end of the world if she knows."
    },
    {
      "character": "Sensei",
      "text": "It just means I have to...figure out a way to make her not {i}want{/i} to tell anyone."
    },
    {
      "character": "Rin",
      "text": "What..."
    },
    {
      "character": "Rin",
      "text": "What does...that mean?"
    },
    {
      "character": "Sensei",
      "text": "I don’t know. But that’s for me to figure out. You’ve done all you can by just telling me."
    },
    {
      "character": "Rin",
      "text": "Sensei...I know this probably isn’t the right time to do this and that I’m literally insane for suggesting you do {i}anything{/i} after openly putting your whole fucking life at risk..."
    },
    {
      "character": "Rin",
      "text": "But I really really really really really think you should stop seeing Futaba. If you cut things off now, Chika might never find out. Because Nodoka knows about that too and...and..."
    },
    {
      "character": "Rin",
      "text": "And Futaba doesn’t love you the way Chika does. It’s totally different."
    },
    {
      "character": "Rin",
      "text": "To Chika, you’re like...her whole life. It’s you and her sister. She {i}needs{/i} you. Futaba will be hurt, sure...but...I don’t think you understand just how bad it would be the other way around."
    },
    {
      "character": "Sensei",
      "text": "Thanks for the suggestion, Rin. But that’s not really something I want to talk about with you."
    },
    {
      "character": "Rin",
      "text": "I understand...of course you wouldn’t want to tell me anything important after all that..."
    },
    {
      "character": "Rin",
      "text": "But I really..{i}really...{/i}really really really really really {i}am{/i} sorry. "
    },
    {
      "character": "Rin",
      "text": "You are...so...{i}so{/i} important to me in so many ways that even {i}I{/i} don’t understand. But I guess that doesn’t mean much when I don’t understand {i}myself{/i} enough to even keep a fucking secret."
    },
    {
      "character": "Rin",
      "text": "I just think...."
    },
    {
      "character": "Rin",
      "text": "I think you should keep the ones you treasure most...the closest to your heart."
    },
    {
      "character": "Rin",
      "text": "Because when someone like me comes around and sabotages all of that, you’ll-"
    },
    {
      "character": "Rin",
      "text": "Huh?..."
    },
    {
      "character": "Sensei",
      "text": "Can you calm down {i}now?{/i}"
    },
    {
      "character": "Rin",
      "text": "What are you doing?..."
    },
    {
      "character": "Rin",
      "text": "Why would you hug me at a time like this?..."
    },
    {
      "character": "Rin",
      "text": "You should be telling me I’m too impulsive to be your friend...that you won’t feed me secrets anymore...that I never deserved them in the first place..."
    },
    {
      "character": "Rin",
      "text": "So why?..."
    },
    {
      "character": "Rin",
      "text": "Why are you holding me?..."
    },
    {
      "character": "Sensei",
      "text": "I’m heeding your advice."
    },
    {
      "character": "Rin",
      "text": "What?..."
    },
    {
      "character": "Sensei",
      "text": "I’m keeping the ones I treasure most the closest to my heart."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "Homies...forever!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Homies forever..."
    },
    {
      "character": "narrator",
      "text": "{i}Rin’s affection has increased to [rin_love]!{/i}"
    }
  ],
  "state_changes": {
    "rin_love +": {
      "from": 1,
      "to": 5
    },
    "beachmas14": {
      "from": null,
      "to": true
    }
  }
}