{
  "event_id": 153,
  "event_label": "beachmas15",
  "dialogue": [
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "{i}Somewhere on the other side of town...{/i}"
    },
    {
      "character": "Niki",
      "text": "AAAAAAAAHHHHH!!!!!!!!!!!!!"
    },
    {
      "character": "Niki",
      "text": "WHO DESIGNED THIS {i}FUCKING{/i} COSTUME?! DO THEY SERIOUSLY EXPECT ME TO BE ABLE TO GET THIS FUCKING STUPID ASS RIBBON OFF BY MYSELF?! FUCK!"
    },
    {
      "character": "Otoha",
      "text": "Hey. The cafe was out of like, every single herbal tea...so I hope you’re cool with sencha. "
    },
    {
      "character": "Niki",
      "text": "I’M NOT! "
    },
    {
      "character": "Otoha",
      "text": "Okay. Guess I’ll just go fuck myself then."
    },
    {
      "character": "Niki",
      "text": "Great idea! And if you see my costume designer while you’re out there, tell her she should go to Hell for creating the world’s most complicated ribbon!"
    },
    {
      "character": "Niki",
      "text": "I’ve only got twenty minutes to get out of this fucking thing and into my second outfit and I can’t do that if it’s going to be a whole ass puzzle, Otoha!"
    },
    {
      "character": "Otoha",
      "text": "Uhh..."
    },
    {
      "character": "Niki",
      "text": "Why are you still holding my tea?! Put it down! I’m thirsty!"
    },
    {
      "character": "Otoha",
      "text": "But you said-"
    },
    {
      "character": "Niki",
      "text": "It doesn’t matter what I said! Just put it down!"
    },
    {
      "character": "Otoha",
      "text": "Jeez, Niki. You’re a real backstage-diva aren’t you?"
    },
    {
      "character": "Niki",
      "text": "I wasn’t even supposed to be playing this fucking show! Can’t I have {i}one{/i} Christmas off?!"
    },
    {
      "character": "Niki",
      "text": "The only reason I’m even here is because your asshole teacher never responded to my date request! And God forbid I find anything {i}else{/i} worth spending my time on!"
    },
    {
      "character": "Niki",
      "text": "But hey! That’s great because it gives me all the time in the fucking world to remove this FUCKING RIBBON!"
    },
    {
      "character": "Otoha",
      "text": "Would you like some help, princess?"
    },
    {
      "character": "Niki",
      "text": "Obviously! What the fuck is taking you so long?!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "I’m sorry for yelling at you. Noriko normally helps me with this sort of thing, but of course {i}she{/i} gets to bail and spend Christmas with my ex-boyfriend while {i}I{/i} do {i}this.{/i}"
    },
    {
      "character": "Otoha",
      "text": "Well, I’m sorry for not being Noriko."
    },
    {
      "character": "Niki",
      "text": "Don’t be. That outfit looks better on you than it would her anyway."
    },
    {
      "character": "Otoha",
      "text": "Thanks. Though, I’m still not really sure why there is a dress code involved for just being your assistant."
    },
    {
      "character": "Niki",
      "text": "Shut up. There’s obviously no dress code for being my assistant. But there {i}is{/i} a dress code for going up on stage, which Noriko {i}was{/i} going to do for Tokimeki Labyrinth this year, BUT NOPE!"
    },
    {
      "character": "Niki",
      "text": "Do you know the words? Can you go up there instead?"
    },
    {
      "character": "Otoha",
      "text": "Up...on stage?! With you?! In front of all of those people?!"
    },
    {
      "character": "Niki",
      "text": "What’s the matter? You’ll be playing for just as many people as I am one day, won’t you? And you’re a better singer than Noriko. So, will you do it or not?"
    },
    {
      "character": "Otoha",
      "text": "Uhh...it’s kind of...really short notice. And I know the words to the chorus but I’m not sure if I know them well enough to-"
    },
    {
      "character": "Niki",
      "text": "Fuck it. I’ll just do it alone again. But if you’re going to keep studying under me, you’re going to have to accept that you’re going to be thrown into the fire from time to time. "
    },
    {
      "character": "Otoha",
      "text": "Oh, thank God. I was like five seconds away from having a full blown panic attack."
    },
    {
      "character": "Niki",
      "text": "Get over it. At least you get to hang out here in the nice, cool dressing room while I’m out there sweating my ass off, wondering why they had to choose the heaviest fabric in the world for a summer concert."
    },
    {
      "character": "Otoha",
      "text": "You can cool off in a second. I just have to figure out the ribbon."
    },
    {
      "character": "Niki",
      "text": "It’s fucking ridiculous, isn’t it? I’m an idol, not Harry fucking Houdini."
    },
    {
      "character": "Otoha",
      "text": "You know, you’re really lucky I skipped out on the beach trip this year. "
    },
    {
      "character": "Otoha",
      "text": "Otherwise, you’d still be screaming and breaking things and your fans would only have {i}one{/i} gorgeous dress they’d get to admire this year."
    },
    {
      "character": "Niki",
      "text": "Yeah. Thanks for coming on such short notice. And for skipping out on {i}your{/i} Christmas date this year just to help me."
    },
    {
      "character": "Otoha",
      "text": "Oh, we didn’t have anything like that planned. We’re in a...pretty rough spot right now, actually."
    },
    {
      "character": "Niki",
      "text": "Yeah, what else is fucking new?"
    },
    {
      "character": "Otoha",
      "text": "There. Got it."
    },
    {
      "character": "Niki",
      "text": "AAAAAHHHHH THANK FUCK! I can finally breathe!"
    },
    {
      "character": "Niki",
      "text": "So, what are you two fighting about this time? What did you do now?"
    },
    {
      "character": "Otoha",
      "text": "Me? What makes you think I’m the one who did something?"
    },
    {
      "character": "Niki",
      "text": "Because your last fight was all about you pretending your parents were homophobic so you wouldn’t have to explain to Rin that you were embarrassed to be dating a girl."
    },
    {
      "character": "Otoha",
      "text": "It was...a little more complicated than that, Niki."
    },
    {
      "character": "Niki",
      "text": "Of course it was. Everything always has to be complicated with you fucking lesbians. Do you know what {i}I{/i} was doing when I was your age, Otoha?"
    },
    {
      "character": "Otoha",
      "text": "You really don’t have to-"
    },
    {
      "character": "Niki",
      "text": "I was jerking off and blowing the same guy nearly every single day for five years. And do you know how many times {i}we{/i} fought?"
    },
    {
      "character": "Otoha",
      "text": "No, Niki..."
    },
    {
      "character": "Niki",
      "text": "Well, neither do I! But it seemed to be a lot less than you and Rin and at least {i}one{/i} of those fights involved me also liking girls! What this means is that lesbians are cursed and nothing but trouble. The end."
    },
    {
      "character": "Otoha",
      "text": "You do realize I’m bi, right? I’m not a lesbian. Rin too."
    },
    {
      "character": "Niki",
      "text": "Whoopdy-fucking-doo. Who {i}isn’t{/i} bisexual today? Do you want a medal?"
    },
    {
      "character": "Otoha",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "Don’t fucking ignore me!"
    },
    {
      "character": "Otoha",
      "text": "I’m not! It’s just a complicated situation and I don’t really have any idea how to talk about it without both sounding controlling {i}and{/i} making you mad."
    },
    {
      "character": "Niki",
      "text": "Me?! Mad?! Why would I ever get mad about anything?! I’m nice! "
    },
    {
      "character": "Otoha",
      "text": "You...sure are, Niki."
    },
    {
      "character": "Niki",
      "text": "Hah...sit the fuck down, Otoha. It’s time we have a talk."
    },
    {
      "character": "Otoha",
      "text": "I already know how babies are made. Thanks. "
    },
    {
      "character": "Niki",
      "text": "A talk about {i}relationships,{/i} you little cunt. Your stupid attitude is getting me down and I still have half a show to do."
    },
    {
      "character": "Niki",
      "text": "Rin is on that stupid beach trip too, isn’t she? Don’t tell me the only reason you skipped out on it is to avoid her."
    },
    {
      "character": "Otoha",
      "text": "Fine. I won’t tell you. So let's just talk about something else instead so you can give your throat a rest before-"
    },
    {
      "character": "Niki",
      "text": "Were you not listening to me?! I blew the same guy every day for {i}five years!{/i} I have the fucking {i}Arnold Schwarzenegger{/i} of throats, Otoha!"
    },
    {
      "character": "Otoha",
      "text": "That’s such a weird analogy! Be more normal!"
    },
    {
      "character": "Niki",
      "text": "What right do you have to tell {i}me{/i} to be more normal when you’re coping with your relationship issues by just ignoring them?!"
    },
    {
      "character": "Niki",
      "text": "Do you have any idea who you remind me of right now?!"
    },
    {
      "character": "Otoha",
      "text": "A...bitch?"
    },
    {
      "character": "Niki",
      "text": "My stupid ex-boyfriend! Because he always did the same exact shit and, let me tell you, it’s fucking annoying!"
    },
    {
      "character": "Otoha",
      "text": "Well, that would certainly explain why Rin likes me."
    },
    {
      "character": "Niki",
      "text": "Bullshit. I’ve only met her once, but it was clear as day that that girl likes you because you’re talented and pretty. Which is, fundamentally, the same reason anyone likes {i}anyone.{/i}"
    },
    {
      "character": "Niki",
      "text": "And I say this as perhaps the most beloved figure in all of Kumon-mi for those exact characteristics. "
    },
    {
      "character": "Niki",
      "text": "If she liked you because you reminded her of someone else, why the fuck would she not just go be with that person instead? And why would she freak out and storm out the way she did at the restaurant?"
    },
    {
      "character": "Otoha",
      "text": "You’re really not the person I want to have this conversation with, Niki."
    },
    {
      "character": "Niki",
      "text": "Why the fuck not?! I’m more than just a mentor to you, aren’t I?! Look at me as a...cool authority figure with more life experience and shit! "
    },
    {
      "character": "Otoha",
      "text": "That’s part of the problem! You’re too old to-"
    },
    {
      "character": "Niki",
      "text": "Watch it."
    },
    {
      "character": "Otoha",
      "text": "You’re too...{i}experienced{/i} to be getting yourself wrapped up in petty drama like what’s going on between two teenagers!"
    },
    {
      "character": "Otoha",
      "text": "It’s my first relationship ever and, let’s be real, there’s no way it’s going to last forever. You’d have to be delusional to follow the same person for your entire-"
    },
    {
      "character": "Niki",
      "text": "{i}Watch it.{/i}"
    },
    {
      "character": "Otoha",
      "text": "What...What I’m saying is that this shouldn’t even be a blip on your radar. There’s no reason for you to even care about what’s going on with my love life."
    },
    {
      "character": "Niki",
      "text": "Well, why the Hell not? I care about you and respect you enough to want any relationship you’re in to {i}succeed.{/i} Not fail."
    },
    {
      "character": "Otoha",
      "text": "Please don’t try and give me some kind of speech that ends with a major realization and me taking the last bus across town to go tell Rin I love her."
    },
    {
      "character": "Niki",
      "text": "{i}Do{/i} you love her?"
    },
    {
      "character": "Otoha",
      "text": "What do {i}you{/i} think?"
    },
    {
      "character": "Niki",
      "text": "Does {i}she{/i} love you?"
    },
    {
      "character": "Otoha",
      "text": "Who the fuck knows? She loves anyone who will regularly spend time with her. There’s nothing about the way she feels for me that sets me apart from the rest."
    },
    {
      "character": "Niki",
      "text": "Is she running around and cheating on you? Because if not, that sounds a lot like your insecurities talking."
    },
    {
      "character": "Otoha",
      "text": "Well...how was it for you? Because Sensei is...well, uhh..."
    },
    {
      "character": "Otoha",
      "text": "Let’s just say it’s hard to really tell where his heart lies sometimes..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Otoha",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "Hah..."
    },
    {
      "character": "Niki",
      "text": "I always knew he loved me. But that didn’t mean there were no complications along the way."
    },
    {
      "character": "Niki",
      "text": "Some people just...have their heartstrings being tugged in different directions. "
    },
    {
      "character": "Niki",
      "text": "And some people are too cowardly to ever really ask why or where. "
    },
    {
      "character": "Niki",
      "text": "Take it from me, you don’t want to be one of those people. If there’s something you’re worried about, {i}ask.{/i} "
    },
    {
      "character": "Niki",
      "text": "If you don’t, all of those worries will eat you alive and, before you know it...you’ll be curled up in a ball in your room, wishing for death while writing letters to someone who will probably never see them."
    },
    {
      "character": "Otoha",
      "text": "It’s...kind of hard imagining you ever being in that position given who you were when I met you."
    },
    {
      "character": "Niki",
      "text": "Obviously. I’m a totally flawless and mentally stable superstar now! But I didn’t become that way by ignoring my problems. "
    },
    {
      "character": "Niki",
      "text": "If you’ve got shit you’re worried about or conflict that needs solving, go out there and face it. If you don’t, you’re just going to drag everyone else down alongside you."
    },
    {
      "character": "Niki",
      "text": "So, once again, stop being like my scumbag ex and actually start {i}doing{/i} shit instead of silently looking down on everyone else and pretending you’re happy."
    },
    {
      "character": "Otoha",
      "text": "I don’t think I’m pretending to be happy. I think it’s more like...I’m waiting for Rin to understand me, and she just...never does. So it makes me doubt myself and I kind of just...go into stasis."
    },
    {
      "character": "Niki",
      "text": "Do you understand {i}her?{/i}"
    },
    {
      "character": "Otoha",
      "text": "Not even close."
    },
    {
      "character": "Niki",
      "text": "Then what the fuck are you doing here?"
    },
    {
      "character": "Otoha",
      "text": "Oh God, here it comes. The bus speech."
    },
    {
      "character": "Niki",
      "text": "There will be no “bus speech.” I can’t risk encountering another overly-complex ribbon without someone there to help me get it off."
    },
    {
      "character": "Niki",
      "text": "I just think that standing still is the worst thing you could ever do when it comes to {i}love{/i} or {i}like{/i} or whatever it is you have with Rin."
    },
    {
      "character": "Niki",
      "text": "If you’re happy, stay. If you’re not, leave. But you owe it to that girl to at least be honest about where you two stand so she’s not forced to wait forever just because {i}you’re{/i} confused."
    },
    {
      "character": "Niki",
      "text": "That’s shit you should have ironed out {i}before{/i} agreeing to be her girlfriend."
    },
    {
      "character": "Otoha",
      "text": "I just had no idea it was going to be this hard. Keeping your mind on just one person is...it’s tough."
    },
    {
      "character": "Niki",
      "text": "I know. Especially when that one person doesn’t understand you."
    },
    {
      "character": "Niki",
      "text": "But it’s not much different for me since the person {i}I{/i} love doesn’t understand me either. The difference is that he and I are actually making progress while you and Rin are moving backwards."
    },
    {
      "character": "Niki",
      "text": "So...pop quiz time. What am I doing differently?"
    },
    {
      "character": "Otoha",
      "text": "Making an effort."
    },
    {
      "character": "Niki",
      "text": "And you are?"
    },
    {
      "character": "Otoha",
      "text": "Useless and inactive."
    },
    {
      "character": "Niki",
      "text": "Bingo."
    },
    {
      "character": "Niki",
      "text": "Take your life into your own hands and pursue a future that will make you happy. "
    },
    {
      "character": "Niki",
      "text": "Every day is another chance to take a stride. To move forward. Even if it’s only a little bit."
    },
    {
      "character": "Niki",
      "text": "And from one super talented, super pretty girl to another — you’re never going to be happy if you don’t make a change."
    },
    {
      "character": "Niki",
      "text": "Follow my lead...and do what I do. Because I like you, Otoha. And I want you to smile more."
    },
    {
      "character": "Niki",
      "text": "So...I know I said things wouldn’t end this way, but..."
    },
    {
      "character": "Niki",
      "text": "Get on the last bus out of here and-"
    },
    {
      "character": "Niki",
      "text": "Mmf?!"
    },
    {
      "character": "Otoha",
      "text": "{i}Chu...{/i}"
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Otoha",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Otoha",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "Oh my God."
    },
    {
      "character": "Otoha",
      "text": "Uh..."
    },
    {
      "character": "Niki",
      "text": "Oh my {i}God.{/i}"
    },
    {
      "character": "Otoha",
      "text": "Um..."
    },
    {
      "character": "Niki",
      "text": "You just {i}kissed{/i} me."
    },
    {
      "character": "Otoha",
      "text": "Did I?..."
    },
    {
      "character": "Otoha",
      "text": "Or did you just...imagine it?..."
    },
    {
      "character": "Niki",
      "text": "Otoha, you are a {i}child.{/i}"
    },
    {
      "character": "Otoha",
      "text": "I think I might have...misunderstood where that was going at the end..."
    },
    {
      "character": "Niki",
      "text": "You {i}think?{/i}"
    },
    {
      "character": "Otoha",
      "text": "Okay, you know what? Let’s just forget that ever happened."
    },
    {
      "character": "Niki",
      "text": "Otoha, what the {i}fuck?!{/i} "
    },
    {
      "character": "Otoha",
      "text": "I’m...I’m sorry, okay?! You just, like...you’re really pretty and...I’ve kinda...you know. And then you grabbed my arm and said to follow your lead and..."
    },
    {
      "character": "Otoha",
      "text": "I thought...you might have been telling me it was okay..."
    },
    {
      "character": "Otoha",
      "text": "To like...take a stride...and stuff..."
    },
    {
      "character": "Niki",
      "text": "Yeah. Toward your {i}girlfriend.{/i} Or literally any other person who is not {i}me.{/i}"
    },
    {
      "character": "Otoha",
      "text": "But what if it’s...{i}you{/i} who makes me-"
    },
    {
      "character": "Niki",
      "text": "Stop. Stop, stop, stop. "
    },
    {
      "character": "Niki",
      "text": "That is {i}not{/i} a thing you should tell me. It is not a thing I want to hear. And neither one of us can ever speak of this again. Holy shit."
    },
    {
      "character": "Otoha",
      "text": "Yeah...sorry, I...yeah."
    },
    {
      "character": "Niki",
      "text": "I can’t believe that just happened."
    },
    {
      "character": "Otoha",
      "text": "I’m, uhh..."
    },
    {
      "character": "Otoha",
      "text": "You know what? Your tea is probably...cold by now, so..."
    },
    {
      "character": "Otoha",
      "text": "I’m just gonna..."
    },
    {
      "character": "Otoha",
      "text": "Herbal, right?..."
    },
    {
      "character": "Niki",
      "text": "Uh-huh. Thanks."
    },
    {
      "character": "Otoha",
      "text": "{i}Maybe there’s another Starbucks open at the other end of the venue?...{/i}"
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "..."
    },
    {
      "character": "Niki",
      "text": "There is no fucking way that just happened."
    },
    {
      "character": "Manager",
      "text": "Niki! You’re on in five! Are you all set?"
    },
    {
      "character": "Niki",
      "text": "Fuck! Uhh...yeah! Be there in a second!"
    },
    {
      "character": "narrator",
      "text": "{i}Otoha’s affection with Niki does not increase!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Her affection with Rin raises by 1! Then decreases by 1! Then raises by 1! Then decreases by 1!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}She is very confused!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas15": {
      "from": null,
      "to": true
    }
  }
}