{
  "event_id": 154,
  "event_label": "beachmas16",
  "dialogue": [
    {
      "character": "narrator",
      "text": "This is where a poetic interjection would go if my mind was not currently occupied by other things."
    },
    {
      "character": "narrator",
      "text": "You see, the beach for me has always been a relaxing place. Not a place I particularly {i}like,{/i} but one where I can kick back and watch the holes in the atmosphere be gradually filled in."
    },
    {
      "character": "narrator",
      "text": "The last two days have felt a lot more like dental surgery."
    },
    {
      "character": "narrator",
      "text": "Like the sky is the roof of my mouth and the surgeon keeps slipping — jabbing me repeatedly with an electric drill and draining the blood from out of my gums."
    },
    {
      "character": "narrator",
      "text": "This isn’t what I wanted."
    },
    {
      "character": "narrator",
      "text": "I wanted {i}peace.{/i}"
    },
    {
      "character": "narrator",
      "text": "But it doesn’t matter what I want, because I am not the protagonist of this game."
    },
    {
      "character": "narrator",
      "text": "I’m just an accompaniment."
    },
    {
      "character": "narrator",
      "text": "Another hole in the atmosphere."
    },
    {
      "character": "narrator",
      "text": "And I’ll have to accept that not every outing like this will always serve to connect the dots."
    },
    {
      "character": "narrator",
      "text": "Sometimes, you can’t help but leave the beach with burns."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "This summer is just far too hot."
    },
    {
      "character": "narrator",
      "text": "Enjoy your night."
    },
    {
      "character": "narrator",
      "text": "It will be a long one."
    },
    {
      "character": "Uta",
      "text": "Okay, Io. This is the part where you talk about how I’m the best friend in the world for walking away from Niki’s Christmas concert just so you can be happy. Because I really wanted to see that."
    },
    {
      "character": "Io",
      "text": "Uta, you’re the best friend in the world. But why would you ever want to spend more than thirty seconds listening to that happy-go-lucky bubblegum pop music when we could be...you know...{i}not{/i} doing that?"
    },
    {
      "character": "Uta",
      "text": "Uhh...because I like that happy-go-lucky bubblegum pop music? How come you spend so much time carving away at wood when you could be helping out at the cafe?"
    },
    {
      "character": "Io",
      "text": "I work for myself — not the culturally exaggerated tourist traps that serve as the lifeblood to all of Japan."
    },
    {
      "character": "Uta",
      "text": "Kumon-mi’s been closed for years. We don’t even have any tourists. It’s just a bunch of lesbians, girls who used to go to our old school, and Sensei who come to the cafe. "
    },
    {
      "character": "Io",
      "text": "I see now why he spends so much time there. Throw in a couple hypersexual blondes who talk too much and you’d have his exact clientèle."
    },
    {
      "character": "Uta",
      "text": "Those are my friends, Io. "
    },
    {
      "character": "Io",
      "text": "Hm? But I didn’t even say anything mean about them this time."
    },
    {
      "character": "Uta",
      "text": "No, but you were thinking it and your tone was rude."
    },
    {
      "character": "Io",
      "text": "I’m pretty much always thinking rude things. That’s what I do. But I’ve gotten better at keeping that kind of stuff to myself lately, haven’t I?"
    },
    {
      "character": "Uta",
      "text": "That...depends on what you brought me out here to talk about tonight."
    },
    {
      "character": "Uta",
      "text": "You said you had something you wanted to tell me, and I kinda just assumed it was gonna be more complaints about all of the people who aren’t you that are also vying for Sensei’s affection."
    },
    {
      "character": "Io",
      "text": "That’s a fair assumption. Complaining about the people I’m wrongfully jealous of despite vehemently hating  is pretty on-brand for me. But that’s not what I wanted to talk about today."
    },
    {
      "character": "Io",
      "text": "There’s a thing that happened a while ago that I never told you about and it’s been kind of eating at me. So I wanted to get your thoughts on it and hear what you think I should do."
    },
    {
      "character": "Uta",
      "text": "That’s..."
    },
    {
      "character": "Uta",
      "text": "There’s...actually something that happened to me too. And I probably should have told you earlier since we promised to not keep that kind of stuff secret, but...you know how I am."
    },
    {
      "character": "Io",
      "text": "Of course. I know you better than anybody. "
    },
    {
      "character": "Io",
      "text": "How about this? Let’s go take a seat under those palm trees over there and spill our hearts out to one another chatroom style. Just like we used to in the old days."
    },
    {
      "character": "Uta",
      "text": "You mean when we thought each other had penises?"
    },
    {
      "character": "Io",
      "text": "Yeah. It’s been a while since we’ve really talked like that, hasn’t it?"
    },
    {
      "character": "Uta",
      "text": "Probably a whole year. Most recent time I remember is when we did...basically the same thing last time we came to the beach. Just with an added layer of Yasu bein’ all creepy."
    },
    {
      "character": "Io",
      "text": "That didn’t count. That was pretty much all about me. We’ll {i}both{/i} get a turn today. And we’ll do it in a way that’s 100%% judgement free."
    },
    {
      "character": "Io",
      "text": "You can even pretend I have a penis again if that makes you happy."
    },
    {
      "character": "Io",
      "text": "Cool?"
    },
    {
      "character": "Uta",
      "text": "Not with that part. Girl Io is the one I care about now. "
    },
    {
      "character": "Uta",
      "text": "Besides, now that I know you, I feel like boy Io would have a really small penis and it would just make me laugh any time I think of it."
    },
    {
      "character": "Io",
      "text": "Boy Io is offended. Girl Io doesn’t care. But both Ios think it’s time for the two of us to relive what brought us together in the first place."
    },
    {
      "character": "Io",
      "text": "If that’s not cool, we can go back inside and listen to your stupid pop idol sing songs about cake or...candy or whatever it is idols sing about. I normally just tune it out."
    },
    {
      "character": "Uta",
      "text": "Okay...but the next time {i}I{/i} want to talk to {i}you{/i} in a situation I’m not comfortable in, you have to come along no questions asked."
    },
    {
      "character": "Io",
      "text": "Uta, are you forgetting who you’re talking to? Literally every situation outside of my bedroom makes me uncomfortable. I’ll come with you no matter what. "
    },
    {
      "character": "Uta",
      "text": "Promise?"
    },
    {
      "character": "Io",
      "text": "Promise."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "{i}Io has logged in.{/i}"
    },
    {
      "character": "Uta",
      "text": "We’re not really going to do it like that, are we?"
    },
    {
      "character": "Io",
      "text": "No. I’m just being awkward. We can talk slowly and succinctly- like the deeply traumatized teenage girls we are!"
    },
    {
      "character": "Uta",
      "text": "Yippee...hooray for scars that never fade."
    },
    {
      "character": "Io",
      "text": "And hooray for safe spaces that protect people like us from further exploitation! I now open the floor to you, Uta."
    },
    {
      "character": "Uta",
      "text": "I’m going first?"
    },
    {
      "character": "Io",
      "text": "Yeah. Because if I go first, I’ll get too absorbed in the sound of my own voice and just ramble on until morning comes- and I want to make sure you’re actually able to get stuff off your oversized chest tonight."
    },
    {
      "character": "Uta",
      "text": "Oversized, it is not. I am quite the proportional creature, Io. And I am proud of the body my parents gave me."
    },
    {
      "character": "Io",
      "text": "You’re only saying that because it makes you money at the maid cafe."
    },
    {
      "character": "Uta",
      "text": "Sometimes, you must submerge yourself in the well of obscenity if you are ever going to emerge wet with confidence."
    },
    {
      "character": "Io",
      "text": "Is that line a leftover from the Dorm Wars?"
    },
    {
      "character": "Uta",
      "text": "Kunoichi Uta isn’t gone. Her story lives on forever."
    },
    {
      "character": "Io",
      "text": "What’s going on, Uta? What did you want to tell me?"
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Let out as much as you can, but stop if you get too uncomfortable. Just like they taught us."
    },
    {
      "character": "Uta",
      "text": "I was always too uncomfortable. I only ever said anything because I felt like I had to. "
    },
    {
      "character": "Io",
      "text": "But think about where you’d be right now if you never did. "
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "It..."
    },
    {
      "character": "Uta",
      "text": "It happened again."
    },
    {
      "character": "Io",
      "text": "{i}What{/i} happened?"
    },
    {
      "character": "Uta",
      "text": "The other day...Well, I guess it’s more like the other {i}month{/i} at this point...I was about to take a bath...and my phone went off."
    },
    {
      "character": "Uta",
      "text": "So, I went to go look and..."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "{i}Hooooo...{/i}"
    },
    {
      "character": "Io",
      "text": "It’s okay. You’re fine."
    },
    {
      "character": "Uta",
      "text": "It was..."
    },
    {
      "character": "Uta",
      "text": "Somebody sent me...a picture...of myself."
    },
    {
      "character": "Uta",
      "text": "I’m sure I don’t have to tell you...what kind."
    },
    {
      "character": "Io",
      "text": "Do you know who did it?"
    },
    {
      "character": "Uta",
      "text": "I looked up the number, but it was...one of those disposable online ones..."
    },
    {
      "character": "Io",
      "text": "I fucking hate everyone. How is this still happening so many years later? Like, seriously. Get a fucking life, assholes. "
    },
    {
      "character": "Uta",
      "text": "It’s going to follow me forever, Io. Every time I think it’s over and start to forget, I get blindsided by the stupid things I did when I was a kid and it just..."
    },
    {
      "character": "Uta",
      "text": "It never ends."
    },
    {
      "character": "Uta",
      "text": "My phone’s not even supposed to {i}get{/i} picture messages. We had them blocked for this exact reason."
    },
    {
      "character": "Uta",
      "text": "Yet, someone always finds them..."
    },
    {
      "character": "Uta",
      "text": "And always finds {i}me.{/i}"
    },
    {
      "character": "Uta",
      "text": "Can I not just disappear? Do I have to change my name? Will that help? Or will they find that too?"
    },
    {
      "character": "Uta",
      "text": "I don’t even {i}know{/i} how many phone numbers and email addresses I’ve gone through at this point. It’s all hopeless. "
    },
    {
      "character": "Uta",
      "text": "And it’s not even the being doxxed part that scares me the most anymore. It’s everyone else finding out about it."
    },
    {
      "character": "Uta",
      "text": "I like my life here. And not only that, but I don’t even have the option to go anywhere else now if things get out."
    },
    {
      "character": "Uta",
      "text": "If news spreads that there are naked pictures of me from before I was even in middle school floating around the Internet, no one’s gonna see me as {i}me{/i} anymore. They’re gonna see {i}that.{/i}"
    },
    {
      "character": "Uta",
      "text": "And even the ones who like me enough to try and look past it...how am I supposed to look at {i}them{/i} knowing that {i}they{/i} know?"
    },
    {
      "character": "Uta",
      "text": "It’s just so fucking embarrassing! And it makes me feel absolutely disgusting every time I remember it since I never thought I was doing anything wrong in the first place!"
    },
    {
      "character": "Uta",
      "text": "I just wanted to feel pretty! Everyone always talked about how boyish I was and...someone finally didn’t do that and I thought I could trust them, but-"
    },
    {
      "character": "Io",
      "text": "This is going to sound extremely hypocritical given the person I’m currently infatuated with, but people are fucking sick, Uta. Never trust anyone."
    },
    {
      "character": "Uta",
      "text": "Io, what should I do if people find out? How would I ever be able to face anyone after that?"
    },
    {
      "character": "Io",
      "text": "I don’t know...but I really wish I did. Because there’s no one out there who deserves a life free of all of that bullshit more than you do."
    },
    {
      "character": "Io",
      "text": "And if we ever find out who it is, you can bet your ass that I’ll be joining your brother in jail. "
    },
    {
      "character": "Uta",
      "text": "Pfft...thanks. I’m pretty sure they keep the boys and girls separate though."
    },
    {
      "character": "Io",
      "text": "I know. And the fact that I’d be willing to deal with an entire correctional facility’s worth of unruly women should show you just how important you are to me."
    },
    {
      "character": "Uta",
      "text": "I already knew that...and I wouldn’t want anyone else sacrificing their freedom for my sake anyway."
    },
    {
      "character": "Uta",
      "text": "Just having somebody to talk to is enough for now. Especially someone like you...who I know won’t look at me any differently for things that have happened in the past."
    },
    {
      "character": "Io",
      "text": "Being able to look past that is the only thing that keeps me together. You know that."
    },
    {
      "character": "Uta",
      "text": "Of course..."
    },
    {
      "character": "Uta",
      "text": "Okay. Uta is no longer typing. That means it’s your turn to enter the judgement free trauma zone."
    },
    {
      "character": "Io",
      "text": "Uhh...I feel kind of weird going now since your thing was way worse than mine and mine was probably just me overreacting."
    },
    {
      "character": "Uta",
      "text": "I don’t care. If it’s something you want to talk about, I want to hear it. You said you wanted my advice anyway, didn’t you?"
    },
    {
      "character": "Io",
      "text": "Yeah...I do. But it’s less like {i}wanting{/i} your advice and more like {i}needing{/i} it since I’ve kind of sworn away all thoughts on the subject already."
    },
    {
      "character": "Uta",
      "text": "I...don’t like the sound of that."
    },
    {
      "character": "Io",
      "text": "So, like...uh..."
    },
    {
      "character": "Io",
      "text": "Remember when I asked you for Sensei’s address a while ago? "
    },
    {
      "character": "Uta",
      "text": "Mhm..."
    },
    {
      "character": "Io",
      "text": "Well, it goes without saying that I went over to his place after that. And it was fun! A lot of fun! "
    },
    {
      "character": "Uta",
      "text": "Mhm."
    },
    {
      "character": "Io",
      "text": "But, uhh..."
    },
    {
      "character": "Io",
      "text": "It kind of...{i}stopped{/i} being fun when we got to a certain point that I...{i}definitely{/i} enabled due to my never ending need to try and make him like me."
    },
    {
      "character": "Io",
      "text": "But I guess I...wanted him to like me {i}differently?{/i} Without, like...you know...sexual...contact?"
    },
    {
      "character": "Uta",
      "text": "You didn’t-"
    },
    {
      "character": "Io",
      "text": "Nonononono. No way. No, I fucking booked it. But it was {i}my{/i} fault he got the wrong idea since I’m the one who got into bed first, you know?"
    },
    {
      "character": "Io",
      "text": "Sensei is...well, very driven by a certain set of...uhh...{i}feelings{/i} I can’t really reciprocate. As I’m sure you...already know."
    },
    {
      "character": "Uta",
      "text": "What...happened?"
    },
    {
      "character": "Io",
      "text": "Nothing! Really! He just...got kind of {i}handsy{/i} when we were cuddling and...I couldn’t take it anymore. Because I’m a coward."
    },
    {
      "character": "Uta",
      "text": "You’re not a coward, Io. That is the {i}last{/i} thing you should be calling yourself in a situation like that."
    },
    {
      "character": "Uta",
      "text": "If anything, you’re brave for doing what you did since you always knew there was the possibility of something like that happening, didn’t you?"
    },
    {
      "character": "Io",
      "text": "Does it...uhh...count if I was in denial about it?"
    },
    {
      "character": "Uta",
      "text": "I think so. "
    },
    {
      "character": "Io",
      "text": "I see...cool. Nice. "
    },
    {
      "character": "Io",
      "text": "We haven’t really...talked about it since then, so...I don’t think Sensei is {i}too{/i} mad. Or, if he is, he’s keeping it to himself and waiting for me to lose interest or something. Which I won’t. Because brain."
    },
    {
      "character": "Uta",
      "text": "I doubt he’s mad, but...how did you run away exactly? What did you say to him?"
    },
    {
      "character": "Io",
      "text": "I think I told him that I had work or something. I don’t know. It all happened really fast and I had to hide under the bridge near his house so I could throw up a few times. It’s all one big blur."
    },
    {
      "character": "Uta",
      "text": "Io..."
    },
    {
      "character": "Io",
      "text": "But, like...he {i}needs{/i} that sort of relationship with somebody. And I’ve given him so many signs that I {i}can’t{/i} do that and he just...he doesn’t really {i}get{/i} it."
    },
    {
      "character": "Io",
      "text": "So that’s the part where your advice is needed...what am I supposed to do from this point on?"
    },
    {
      "character": "Io",
      "text": "We’re at the stage where we’re close enough {i}to{/i} do that by normal standards, but my standards are anything but normal and delaying any longer might make him hate me."
    },
    {
      "character": "Uta",
      "text": "Why don’t you just...tell him? He’ll understand."
    },
    {
      "character": "Io",
      "text": "{i}Understand?{/i}"
    },
    {
      "character": "Io",
      "text": "Not only will he not {i}understand,{/i} he’ll be {i}repulsed.{/i} I’m already infinitely unlikable with all of my broken pieces. The last thing I need is for the most {i}broken{/i} of them to stick out and shine."
    },
    {
      "character": "Io",
      "text": "It’s like your thing. You don’t want anyone to know and neither do I because we want things to stay the way they are."
    },
    {
      "character": "Uta",
      "text": "I know, Io...but I’m not in love with my entire class. And you-"
    },
    {
      "character": "Io",
      "text": "What about...other options? Like...maybe if I just load up on every one of my medications before going over to his place the next time, I can just ignore-"
    },
    {
      "character": "Uta",
      "text": "You can’t just throw medication at all of your problems. That’s unhealthy and you know it. "
    },
    {
      "character": "Io",
      "text": "Then what? Do I just...find someone else to rely on? Someone more like me who can live without that sort of thing?"
    },
    {
      "character": "Io",
      "text": "Like, yeah. That seems pretty reasonable on paper. A great idea even. But will Io-brain agree? I think not. Io-brain wants Sensei. She just wants a Sensei that doesn’t get a boner every five minutes."
    },
    {
      "character": "Uta",
      "text": "Io...I don’t really know how to give you advice for something I’ve never experienced before...so I’m going to just speak generally and you can take from that what you will."
    },
    {
      "character": "Uta",
      "text": "I don’t think that charging your biggest fears face first is something that works for people like us."
    },
    {
      "character": "Uta",
      "text": "I think that...the things we have gone through make us a lot more fragile. And so we need to be a lot more careful when it comes to facing our fears so the duct tape holding us together doesn’t come off."
    },
    {
      "character": "Uta",
      "text": "Cause even if we do our best to hide it and pretend it isn’t there, we’ll never be as {i}together{/i} as all of the other girls...the ones who haven’t been...chipped away at yet."
    },
    {
      "character": "Io",
      "text": "So...it’s okay that I’m not forcing myself? It’s okay to do what {i}I{/i} want rather than what Sensei wants? Even if it puts our relationship at risk?"
    },
    {
      "character": "Uta",
      "text": "I think so. "
    },
    {
      "character": "Uta",
      "text": "Sensei might be a pervert who needs sex in order to survive, but I doubt he’d cast you aside just because you’re not open to it."
    },
    {
      "character": "Io",
      "text": "That’s a relief. Sure, there’s the inherent risk that you’re misinterpreting who he is as a person and that the exact opposite of what you just said may happen...but still. That’s a relief."
    },
    {
      "character": "Io",
      "text": "I wish there was something I could do for him..."
    },
    {
      "character": "Io",
      "text": "I just {i}can’t.{/i} You know?"
    },
    {
      "character": "Uta",
      "text": "I know."
    },
    {
      "character": "Io",
      "text": "If only you liked Sensei too. That would solve pretty much everything."
    },
    {
      "character": "Uta",
      "text": "Uh.......what?"
    },
    {
      "character": "Io",
      "text": "Yeah! You’re not averse to sex the way I am. So if you also liked him, he could get all of his sexual energy out on you and I’d never have to worry about doing that sort of thing with him."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Uta?"
    },
    {
      "character": "Uta",
      "text": "Are you out of your fucking mind?"
    },
    {
      "character": "Io",
      "text": "Yes. That’s like, my whole thing."
    },
    {
      "character": "Uta",
      "text": "But...But you’ve never...said anything about...{i}sharing{/i} him before..."
    },
    {
      "character": "Io",
      "text": "Really? I could have sworn I mentioned something about the two of you getting together at one point. I just figured you weren’t interested."
    },
    {
      "character": "Io",
      "text": "In a perfect world, which obviously doesn’t exist, the ideal scenario would just be him and a trauma-less Io together. But there are loads of problems with that and it would never work."
    },
    {
      "character": "Io",
      "text": "I can’t provide what Sensei needs in a relationship and, frankly, if he was with me every single day, he’d get tired and fed up after like, a week."
    },
    {
      "character": "Io",
      "text": "By that logic, having someone else come in to provide what I can’t, namely someone I also love, IE: you...is not just the quickest path to a future where I can be happy with him, but the {i}only{/i} path."
    },
    {
      "character": "Io",
      "text": "The only issue is that that wouldn’t make {i}you{/i} happy. And I could never ask you to be my sex proxy if you’re not into the same guy as me."
    },
    {
      "character": "Io",
      "text": "Does that make more sense?"
    },
    {
      "character": "Uta",
      "text": "Uhh........{i}no?{/i}"
    },
    {
      "character": "Io",
      "text": "No?"
    },
    {
      "character": "Uta",
      "text": "{i}Sex proxy?{/i}"
    },
    {
      "character": "Uta",
      "text": "So...what? My job would be to lay there and have sex with him while you two do all of the fun, cute, couple stuff together?"
    },
    {
      "character": "Io",
      "text": "Of course not. All three of us could do fun couple stuff together. But we could also get private time whenever we want it. The big thing is that you’d be the only one he actually has sex with. And I’d just be Io."
    },
    {
      "character": "Uta",
      "text": "Oh my God. You want a fucking throuple."
    },
    {
      "character": "Io",
      "text": "Oh, is there a name for it? Cool. "
    },
    {
      "character": "Io",
      "text": "It would really only work with you, though. The idea of Sensei with anyone else makes me want to puke. "
    },
    {
      "character": "Io",
      "text": "But I don’t put you in the same bracket as everyone else. You’re an essential part of my life and, in many ways, the glue that holds me together. The hinges to my door. "
    },
    {
      "character": "Io",
      "text": "Plus, the two of us falling for the same guy would eliminate the risk of you ever dating someone I {i}don’t{/i} like and trying to drag them into the group. I really don’t see any downsides."
    },
    {
      "character": "Io",
      "text": "Well, other than the fact that you don’t like him and I would never force you to do something like that for my sake alone."
    },
    {
      "character": "Uta",
      "text": "This is a dream. Any second now, I’m going to wake up."
    },
    {
      "character": "Ayane",
      "text": "Heeeeey! Uta! Io!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Why do you know so many blondes?"
    },
    {
      "character": "Io",
      "text": "I don’t know, but I wish I didn’t. What do you want?"
    },
    {
      "character": "Ayane",
      "text": "We’re about to start Secret Santa and Imani told me you guys went out here to talk. Is everything alright with Uta? She looks...shocked."
    },
    {
      "character": "Io",
      "text": "Yeah, she’s been acting kind of weird for a few minutes now. But it’s in response to something I have no intention of repeating to you. "
    },
    {
      "character": "Uta",
      "text": "Any minute now...I will wake up in my bed...and none of this will have ever happened..."
    },
    {
      "character": "Ayane",
      "text": "Should we pinch her?"
    },
    {
      "character": "Io",
      "text": "She’ll be fine. She just needs a few minutes to try and reword the apparently horrible explanation I just gave about my feelings. But again, not for you."
    },
    {
      "character": "Ayane",
      "text": "Right..."
    },
    {
      "character": "Ayane",
      "text": "Well, come with me, I guess. We can’t start until everyone is there and you’re the last two hold-outs apart from Otoha."
    },
    {
      "character": "Io",
      "text": "Can you walk?"
    },
    {
      "character": "Uta",
      "text": "No."
    },
    {
      "character": "Io",
      "text": "We’ll be there in a minute. "
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "beachmas16": {
      "from": null,
      "to": true
    }
  }
}