{
  "event_id": 162,
  "event_label": "yumislumber1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I tap on Yumi’s name in “my” phone and wait for her to answer."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "Yumi",
      "text": "Uhh...hello?"
    },
    {
      "character": "Sensei",
      "text": "Hey."
    },
    {
      "character": "Yumi",
      "text": "Who the fuck is this?"
    },
    {
      "character": "Sensei",
      "text": "Your teacher. I’m calling you from my new secret phone number."
    },
    {
      "character": "Yumi",
      "text": "Um...congrats?"
    },
    {
      "character": "Yumi",
      "text": "The fuck you want? Why you callin’ me?"
    },
    {
      "character": "Sensei",
      "text": "Maybe I just miss you?"
    },
    {
      "character": "Yumi",
      "text": "And maybe I’ve gotta find someone willin’ to give me one of those lobotomy things so I can forget I ever heard that. Later."
    },
    {
      "character": "Sensei",
      "text": "Wait. On a serious note, are you busy right now?"
    },
    {
      "character": "Yumi",
      "text": "Yeah."
    },
    {
      "character": "Sensei",
      "text": "With what? You’re unemployed and don’t have a house."
    },
    {
      "character": "Yumi",
      "text": "And you’re a fucking douche nozzle! I’m hanging up now!"
    },
    {
      "character": "Sensei",
      "text": "Stop whatever it is you’re doing. We need to meet up and continue our conversation from the beach. It’s important and...apparently {i}time{/i}-sensitive."
    },
    {
      "character": "Sensei",
      "text": "That was a hilarious pun that you won't understand. But hopefully, you will soon."
    },
    {
      "character": "Yumi",
      "text": "Can't. Chinami's got a fever. You want me to leave her alone so I can come talk to {i}you{/i} about my random ass memory issues?"
    },
    {
      "character": "Sensei",
      "text": "Chinami’s sick?"
    },
    {
      "character": "Yumi",
      "text": "Yeah. And I’m stuck at {i}your girlfriend’s{/i} house watchin’ her until the mall closes and Chika comes back home."
    },
    {
      "character": "Sensei",
      "text": "Great. I’ll meet you there."
    },
    {
      "character": "Yumi",
      "text": "The fuck you will! Were you not payin’ attention when I told you Chinami’s sick?! She needs rest!"
    },
    {
      "character": "Chinami",
      "text": "{i}Is that Chinami’s papa?! The new one, not the one who abandoned her!{/i}"
    },
    {
      "character": "Yumi",
      "text": "No! It’s the fucking...bank."
    },
    {
      "character": "Chinami",
      "text": "{i}Did Chinami’s recent deposit clear?{/i}"
    },
    {
      "character": "Sensei",
      "text": "I’ll see you soon, Yumi."
    },
    {
      "character": "Yumi",
      "text": "Don’t you fucking-"
    },
    {
      "character": "narrator",
      "text": "I hang up the phone and begin to make my way over to the second half of town."
    },
    {
      "character": "narrator",
      "text": "Thankfully, I am no longer completely bewildered in terms of my location and am able to make it to the bus stop without any issues at all."
    },
    {
      "character": "narrator",
      "text": "And while I’d normally just bite the bullet and walk there, I’m admittedly a little worried about Chinami and would like to make sure I see her at least one more time before she dies. "
    },
    {
      "character": "narrator",
      "text": "I kid, of course. Kind of."
    },
    {
      "character": "narrator",
      "text": "I don’t know."
    },
    {
      "character": "narrator",
      "text": "Maybe Maki’s morbid sense of humor has just rubbed off on me after all the time I spent with her during Makoto's tragic arc."
    },
    {
      "character": "narrator",
      "text": "Regardless, I double check the bus schedule on my new backup phone and take a seat on the bench, waiting patiently for it to arrive and carry me toward my current goal."
    },
    {
      "character": "narrator",
      "text": "Here’s hoping Yumi likes sleepovers."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Hey, I’m here."
    },
    {
      "character": "Yumi",
      "text": "Yeah, I can see that! The Hell do you think you are, just walkin’ into somebody else’s house?!"
    },
    {
      "character": "Sensei",
      "text": "In my defense, it’s not like you didn’t know I was coming."
    },
    {
      "character": "Yumi",
      "text": "That doesn’t make it okay! Go back out there and knock or ring the bell like a normal person!"
    },
    {
      "character": "Sensei",
      "text": "But if I do that, you’ll lock me out."
    },
    {
      "character": "Yumi",
      "text": "Tch. Was hopin’ that would work."
    },
    {
      "character": "Sensei",
      "text": "On the bright side, I’m glad to have made it before visiting hours ended. How’s the patient?"
    },
    {
      "character": "Yumi",
      "text": "Chinami, how are you?! "
    },
    {
      "character": "Chinami",
      "text": "Chinami is fine! Hi, Papa!"
    },
    {
      "character": "Sensei",
      "text": "Where did you get such a huge privacy curtain? That’s like, straight out of a hospital."
    },
    {
      "character": "Yumi",
      "text": "Probably because it {i}is{/i} straight out of a hospital. Shit’s been here longer than I have. "
    },
    {
      "character": "Yumi",
      "text": "Pretty sure they’ve had it ever since Chinami was born on account of her whole immune thingy."
    },
    {
      "character": "Chinami",
      "text": "Chinami used to spend a lot of time behind her safety curtain, but now she only has to use it some- {i}ack!..keh...{/i} "
    },
    {
      "character": "Yumi",
      "text": "Hey! Go back to sleep! You know you ain’t gonna get any better if you get all excited and sh...and crap."
    },
    {
      "character": "Sensei",
      "text": "That really isn’t much better, Yumi."
    },
    {
      "character": "Chinami",
      "text": "Chinami is fine! She just swallowed a bug!"
    },
    {
      "character": "Yumi",
      "text": "Just ignore her. She’ll go back to sleep if we don’t pay any attention."
    },
    {
      "character": "Sensei",
      "text": "Is keeping her here okay? Wouldn’t it be better to take her to a hospital or something?"
    },
    {
      "character": "Yumi",
      "text": "With what money? Tsukasa ain’t paid me yet and you know damn well how much Chika’s got."
    },
    {
      "character": "Sensei",
      "text": "I’m sure the Tsukiokas wouldn’t mind fronting the bill if it meant keeping Chinami healthy."
    },
    {
      "character": "Yumi",
      "text": "It’s fine. Shit like this ain’t all that uncommon. Just a normal cold or somethin’. I’ve been givin’ her medicine and her fever’s already started to break and whatnot."
    },
    {
      "character": "Sensei",
      "text": "Good. It’s not every day I get to see you being responsible. I like this side of you, Yumi."
    },
    {
      "character": "Yumi",
      "text": "Only side of you I like is the...one outside of this apartment."
    },
    {
      "character": "Sensei",
      "text": "Good one. "
    },
    {
      "character": "Yumi",
      "text": "Suck my left nut. Why are you even here? What do you want?"
    },
    {
      "character": "Sensei",
      "text": "I told you on the phone, didn’t I? We need to resume our conversation from the beach."
    },
    {
      "character": "Yumi",
      "text": "Probably better off just startin’ from the beginning. Shit confused me so much I can barely even remember what it is we were talkin’ about."
    },
    {
      "character": "Yumi",
      "text": "Somethin’ with the last two months, right?"
    },
    {
      "character": "Sensei",
      "text": "Right. Did you try talking to anyone else about that after I ran off last night?"
    },
    {
      "character": "Yumi",
      "text": "Only person I have to talk to is Chika and it seemed like everything was pretty fuckin’ normal from her point of view. Meanin’ it’s probably only me who-"
    },
    {
      "character": "Yumi",
      "text": "Wait! You didn’t give me your fuckin' memory disease, did you?!"
    },
    {
      "character": "Chinami",
      "text": "Yay! Chinami won’t be alone in the safety curtain! She’ll make room for big sis Yumi right now!"
    },
    {
      "character": "Sensei",
      "text": "I didn’t give you a {i}disease{/i}, Yumi."
    },
    {
      "character": "Chinami",
      "text": "Aww, rats..."
    },
    {
      "character": "Sensei",
      "text": "But just because you’re not terminally ill doesn’t mean this is something we can ignore. "
    },
    {
      "character": "Sensei",
      "text": "Well...I guess technically we {i}could{/i} ignore it and it wouldn’t make much of a difference to you. But it would be a big help for me and a couple other people if you could at least listen for a little while."
    },
    {
      "character": "Yumi",
      "text": "Okay. So {i}you{/i} want {i}me{/i} to take time out of {i}my{/i} life so that {i}your{/i} life can get better or some shit...while I don’t benefit at all. Am I hearin’ that right?"
    },
    {
      "character": "Sensei",
      "text": "More or less."
    },
    {
      "character": "Yumi",
      "text": "Gotcha."
    },
    {
      "character": "Yumi",
      "text": "Welp, you know where the door is."
    },
    {
      "character": "Sensei",
      "text": "Yumi, come on. Just hear me out."
    },
    {
      "character": "Yumi",
      "text": "Ahhhhh, fine! But the second this gets too friggin’ weird I’m calling Gary!"
    },
    {
      "character": "Sensei",
      "text": "Great. Thank you — wait, who’s Gary?"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I help myself to a pot of coffee left out on the kitchen table and quickly come to understand that this was definitely not made anytime within the last six hours."
    },
    {
      "character": "Yumi",
      "text": "You gonna microwave that shit or just pretend it’s drinkable?"
    },
    {
      "character": "Sensei",
      "text": "I made this bed and I now have to lie in it. But that is beside the point."
    },
    {
      "character": "Yumi",
      "text": "Mhm. And the point is?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "How do you feel about sleepovers?"
    },
    {
      "character": "Yumi",
      "text": "Why do you exist?"
    },
    {
      "character": "Sensei",
      "text": "Actually, it’s funny you should ask because that’s a big part of why I’m here today."
    },
    {
      "character": "Yumi",
      "text": "It’s like every single thing you say makes shit ten times more confusing."
    },
    {
      "character": "Sensei",
      "text": "Then I’ll fulfill your greatest wish and shut up while you do your best to recollect the last two months of your life."
    },
    {
      "character": "Yumi",
      "text": "Looks like we’re both gonna shut the fuck up, then. Cause that’s exactly what I was tryin’ to do ever since you pointed shit out and I’ve got nothin’."
    },
    {
      "character": "Yumi",
      "text": "If you know what’s goin’ on with me, fucking spill it. Because all the shit I keep hearin’ about the space between Halloween and Christmas is makin’ my head spin."
    },
    {
      "character": "Yumi",
      "text": "Didn’t think much of it at first, but I straight up can’t even picture any of it when I try to. It’s like all that time was just fuckin’...ripped outta my mind or somethin’."
    },
    {
      "character": "Yumi",
      "text": "That what it’s like for you too? You know, with all your memory shit."
    },
    {
      "character": "Sensei",
      "text": "More or less. Just it’s a lot more than two months for me and I also, occasionally, do things like black out and force myself on teenage girls."
    },
    {
      "character": "Yumi",
      "text": "Those “blackouts” have somethin’ to do with it too? That shit ain’t gonna start happenin’ to me next, is it?"
    },
    {
      "character": "Sensei",
      "text": "I have no idea. And I’m probably not even the right person to lead a conversation like this since I have very little understanding of how {i}anything{/i} works."
    },
    {
      "character": "Sensei",
      "text": "But you’re an outlier right now...so I do know that the logical course of action would be trying to figure out {i}why.{/i}"
    },
    {
      "character": "Yumi",
      "text": "The fuck is an “outlier?”"
    },
    {
      "character": "Sensei",
      "text": "Something that skews what’s meant to be an average."
    },
    {
      "character": "Sensei",
      "text": "For example, if we calculated the mean age of everyone in class, {i}I{/i} would be the outlier since I’m way older than all of you and would force that mean upward."
    },
    {
      "character": "Yumi",
      "text": "Good. So you {i}do{/i} understand that. Now think long and hard about why that makes you such a fucking creep."
    },
    {
      "character": "Sensei",
      "text": "I have plenty of time to think about how horrible of a person I am. But, for reasons I am mostly incapable of explaining, you might not have equal time to do the same when it comes to this."
    },
    {
      "character": "Yumi",
      "text": "Huh? I ain’t gonna, like...die or some shit, am I?"
    },
    {
      "character": "Sensei",
      "text": "Nothing that serious, no."
    },
    {
      "character": "Yumi",
      "text": "Then what? My memories just gonna, like...come back or something?"
    },
    {
      "character": "Sensei",
      "text": "They might."
    },
    {
      "character": "Yumi",
      "text": "I ain’t seein’ what the big deal is, then."
    },
    {
      "character": "Sensei",
      "text": "Would you see the “big deal” if I told you those two months may have never even happened in the first place? And that everyone’s memories of it were just false?"
    },
    {
      "character": "Yumi",
      "text": "Uhh...no. But I {i}would{/i} call you a fucking lunatic."
    },
    {
      "character": "Yumi",
      "text": "If everybody’s got memories of those months and it's just you and me who don’t, wouldn’t {i}we{/i} be the ones...in the wrong or whatever?"
    },
    {
      "character": "Sensei",
      "text": "This is less about who is wrong and who is right and more about {i}why{/i} we’re in the position we’re in."
    },
    {
      "character": "Sensei",
      "text": "Isn’t it strange knowing there could be something different about you, Yumi?"
    },
    {
      "character": "Yumi",
      "text": "Not...really."
    },
    {
      "character": "Yumi",
      "text": "I’ve been different my whole fuckin’ life, man. And I’ve been hearin’ all about it since the first time I knocked somebody’s lights out in daycare."
    },
    {
      "character": "Yumi",
      "text": "Might’ve wound up a better person if somebody looked after me now and then, but I’m well adjusted to not fitting in already."
    },
    {
      "character": "Sensei",
      "text": "This is different, though. This is-"
    },
    {
      "character": "Yumi",
      "text": "No shit it’s different. This is like, some...borderline supernatural shit."
    },
    {
      "character": "Yumi",
      "text": "But if {i}you’ve{/i} got no idea why this is happenin’ and everybody {i}else{/i} is just gonna be weird if we try and talk about it, the Hell’s the point in even trying in the first place?"
    },
    {
      "character": "Yumi",
      "text": "Can’t say I’d feel the same way if I lost as much time and memory as you, but it’s just two months. And those two months weren’t really all that bad from what I understand."
    },
    {
      "character": "Yumi",
      "text": "Wound up back in school, didn’t I? That’s gotta be a plus, right?"
    },
    {
      "character": "Sensei",
      "text": "Is that what you wanted, though? I thought you were planning on dropping out?"
    },
    {
      "character": "Yumi",
      "text": "I..."
    },
    {
      "character": "Yumi",
      "text": "I don’t know. Last I remember, I was still trying to figure shit out."
    },
    {
      "character": "Sensei",
      "text": "I’m surprised you’re okay with the universe just deciding things for you, then."
    },
    {
      "character": "Yumi",
      "text": "Nobody decided shit for me. The only person who chooses what I’m gonna do is myself."
    },
    {
      "character": "Sensei",
      "text": "Then what will you do if this happens again?"
    },
    {
      "character": "Sensei",
      "text": "What will you do if there’s {i}another{/i} huge leap in time that just sets you on autopilot until you’re eventually spat back out into the world?"
    },
    {
      "character": "Yumi",
      "text": "Fuck if I know. But as long as I’m not blackin’ out and doin’ shit like-"
    },
    {
      "character": "Sensei",
      "text": "Maybe that {i}is{/i} what happened in those two months."
    },
    {
      "character": "Sensei",
      "text": "Maybe {i}both{/i} of us blacked out and things just...didn’t go as poorly as they could have."
    },
    {
      "character": "Sensei",
      "text": "We were together, weren’t we? It’s possible."
    },
    {
      "character": "Sensei",
      "text": "One second, everything was normal. Or at least as normal as it {i}could{/i} have been with me admitting all of that stuff about masturbating to you and whatnot-"
    },
    {
      "character": "Yumi",
      "text": "Stop bringing that up!"
    },
    {
      "character": "Sensei",
      "text": "And the next second, two months of our lives were gone."
    },
    {
      "character": "Sensei",
      "text": "If you’re okay with that happening again, fine. Disregard everything I’m saying and just keep living life the way you always do."
    },
    {
      "character": "Sensei",
      "text": "But if you want to take some control back into your {i}own{/i} hands...and don’t want to have any more time taken away from you...why not try and figure this out with me?"
    },
    {
      "character": "Yumi",
      "text": "The fuck you bein’ all serious for? It’s makin’ me uncomfortable."
    },
    {
      "character": "Yumi",
      "text": "'Sides, the Hell can {i}we{/i} do about this in the first place? You might be smart or whatever, but you ain’t a doctor."
    },
    {
      "character": "Sensei",
      "text": "No, I’m not. Nor am I whatever type of scientist handles time travel or...even a {i}teacher{/i} most of the time."
    },
    {
      "character": "Sensei",
      "text": "But I’m someone who won’t think you’re insane when you want to talk about things you don’t particularly understand."
    },
    {
      "character": "Sensei",
      "text": "I don’t know if I can {i}help{/i} you, per se...but I might be able to help you feel a little less alone."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Which is why I need you to sleep at my house."
    },
    {
      "character": "Yumi",
      "text": "Of fucking course that’s what it all comes down to. No idea why I let you just keep talkin’ me into a fuckin’ corner for so long."
    },
    {
      "character": "Yumi",
      "text": "Hell of a charade, I’ll give ya that much. But if you’re really gonna try and {i}win me over{/i} or whatever-"
    },
    {
      "character": "Chika",
      "text": "Sensei? What are you doing here?"
    },
    {
      "character": "Yumi",
      "text": "B-Better question...what are {i}you{/i} doing here? I thought you had work?"
    },
    {
      "character": "Chika",
      "text": "I was able to get somebody to cover for me. Did {i}you{/i} invite Sensei over?"
    },
    {
      "character": "Yumi",
      "text": "Course not. Dude just fuckin’ waltzed in as if he owned the place."
    },
    {
      "character": "Chika",
      "text": "So...you’re {i}not{/i} having an affair?"
    },
    {
      "character": "Yumi",
      "text": "Obviously not! No!"
    },
    {
      "character": "Chika",
      "text": "Great! Then it should be totally fine if I do this!"
    },
    {
      "character": "Yumi",
      "text": "Do what? What are-"
    }
  ],
  "state_changes": {
    "yumislumber1": {
      "from": null,
      "to": true
    }
  }
}