{
  "event_id": 163,
  "event_label": "yumislumber2",
  "dialogue": [
    {
      "character": "Yumi",
      "text": "Oh. Okay. Guess I’ll just go fuck myself."
    },
    {
      "character": "Chika",
      "text": "Hi~ Did you come all the way over here just to surprise me?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Yes. You got me."
    },
    {
      "character": "Chika",
      "text": "That’s so sweet. And it makes me forget all about how you haven’t responded to me all morning."
    },
    {
      "character": "Sensei",
      "text": "I didn’t have my phone on me."
    },
    {
      "character": "Chika",
      "text": "Ooh...So that hard lump I’m feeling in your pants right now is..."
    },
    {
      "character": "Sensei",
      "text": "That...would be my penis."
    },
    {
      "character": "Chika",
      "text": "It feels more rectangular than normal."
    },
    {
      "character": "Sensei",
      "text": "That’s the way it’s always been. I'm sensitive about it."
    },
    {
      "character": "Chika",
      "text": "Uh-huh. Kiss me."
    },
    {
      "character": "Sensei",
      "text": "We probably shouldn’t in front of company-"
    },
    {
      "character": "Chika",
      "text": "Chu~"
    },
    {
      "character": "Yumi",
      "text": "Oh, come on! Not at the table! I eat there! And even {i}your boyfriend{/i} tried turning it down! That’s basically assault!"
    },
    {
      "character": "narrator",
      "text": "When in Rome, I guess."
    },
    {
      "character": "Chika",
      "text": "Mmf...mm...mhlm~"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "Hmngh.......hm.....nn~"
    },
    {
      "character": "Chika",
      "text": "Okay, I’m done. Just needed to recharge my battery a little. "
    },
    {
      "character": "Chika",
      "text": "Unfortunately, that’s {i}all{/i} I can do today as I’ve gotta take care of Chinami now. Which means having {i}you{/i} get the heck out of here."
    },
    {
      "character": "Yumi",
      "text": "Wait, you sure? I've got shit under control, you know. Ain’t so much as let her out from behind the curtain all day."
    },
    {
      "character": "Chika",
      "text": "And you’ve been a big help, but she’s still {i}my{/i} responsibility. And now that I’m done with work, you can go do something you actually enjoy instead of being cooped up in here all day."
    },
    {
      "character": "Yumi",
      "text": "But...I don’t enjoy anything. This is what I do."
    },
    {
      "character": "Chika",
      "text": "Why not hang out with Sensei, then?"
    },
    {
      "character": "Sensei",
      "text": "Great idea, Chika. But I’m only okay with this because it was {i}your{/i} idea and I would never go out of my way to seek out Yumi on my own."
    },
    {
      "character": "Chika",
      "text": "Can it. I know you guys are friends."
    },
    {
      "character": "Yumi",
      "text": "We are not! Just kick him outta here and I can chill with you and Chinami instead!"
    },
    {
      "character": "Chika",
      "text": "Mmm...no. Take a day off. We still don’t even know how she {i}got{/i} sick in the first place. What if it was you? We were {i}all{/i} at the beach yesterday, so it’s possible something might’ve come home with you."
    },
    {
      "character": "Yumi",
      "text": "It was probably that fuckin’ brat and her mom when they came over here to watch her yesterday! Why’s it gotta be me?!"
    },
    {
      "character": "Chika",
      "text": "You’ve seen the Tsukiokas' place, haven’t you? They’re all total clean freaks. Touka washes her hands after basically every single thing she touches."
    },
    {
      "character": "Yumi",
      "text": "Chika-"
    },
    {
      "character": "Chika",
      "text": "Why even fight me on this? Just go for a walk around the block or something. It’s really no big deal."
    },
    {
      "character": "Sensei",
      "text": "If that is what must be done..."
    },
    {
      "character": "Yumi",
      "text": "I-"
    },
    {
      "character": "Chika",
      "text": "No more excuses! Besides, if you two start spending a little more time together, you might not feel pressured to always put on an act in front of me!"
    },
    {
      "character": "Yumi",
      "text": "It ain’t an act! I seriously despise the dude!"
    },
    {
      "character": "Sensei",
      "text": "But just yesterday you said we’d be best friends forever."
    },
    {
      "character": "Yumi",
      "text": "Stop playing along!"
    },
    {
      "character": "narrator",
      "text": "Somehow, Chika manages to force the two of us out of the house so she can take care of her sister. And while it’s not quite how I envisioned this going, I take it as a sort of blessing in disguise."
    },
    {
      "character": "narrator",
      "text": "Surprisingly enough, Yumi doesn’t take off running as soon as the front door opens. Which tells me she is currently facing one of the following predicaments."
    },
    {
      "character": "narrator",
      "text": "Option A) She actually does want to hang out with me. (This is the least likely option)"
    },
    {
      "character": "narrator",
      "text": "Option B) She is dumbfounded by her best friend’s newfound affinity for aggressively thrusting the two of us together and simply doesn’t have it in her to run. (This is the most likely option)"
    },
    {
      "character": "narrator",
      "text": "Or Option C) She’s going to give me more time to try and explain exactly what I need from her and what she has to do next."
    },
    {
      "character": "narrator",
      "text": "I’d be happy with either A or C, but it’s {i}C{/i} that would make all of this a thousand times easier. And it’s C that has the greatest potential to fail."
    },
    {
      "character": "narrator",
      "text": "Which is why it’s important I choose my next words wisely."
    },
    {
      "character": "narrator",
      "text": "For in the silent walk from Point A to Point B, the slow, vine-like creep of an unfortunate realization begins to entangle my limbs."
    },
    {
      "character": "narrator",
      "text": "This realization has naught to do with a task that I have been given nor the now-ingrained responsibility to move things forward-"
    },
    {
      "character": "narrator",
      "text": "The thing that I unfortunately realize is that I am afraid of losing Yumi."
    },
    {
      "character": "narrator",
      "text": "And that even if a new one were to spawn in her place, without memories the universe deems as flawed or unnecessary, she would only be a shell of her former self. "
    },
    {
      "character": "narrator",
      "text": "The real Yumi knows something is wrong, she just doesn’t know {i}why{/i} or {i}how{/i} or where to go from here. And neither do any of us."
    },
    {
      "character": "narrator",
      "text": "But if you take that away, she’s just like everyone else again."
    },
    {
      "character": "narrator",
      "text": "She’s no longer an outlier."
    },
    {
      "character": "narrator",
      "text": "And while some people might feel more comfortable with that, I am not one of them."
    },
    {
      "character": "narrator",
      "text": "The most unfortunate part of this unfortunate realization is how unfortunate it is that I’ve been neglecting that all along."
    },
    {
      "character": "narrator",
      "text": "And that many of the bodies I have taken under the covers of my bed have been nothing more than factory-painted, plastic Easter eggs."
    },
    {
      "character": "narrator",
      "text": "They may all look the same, but they are all empty."
    },
    {
      "character": "narrator",
      "text": "And this egg still has the potential to hatch."
    },
    {
      "character": "narrator",
      "text": "Or sour."
    },
    {
      "character": "narrator",
      "text": "Whatever comes first."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "We just gonna fuckin’ sit here?"
    },
    {
      "character": "Sensei",
      "text": "For now. It’s not like either one of us knows what to talk about."
    },
    {
      "character": "Yumi",
      "text": "Not gonna keep trying to coerce me into...sleeping at your house or whatever the fuck was going on back at Chika’s place?"
    },
    {
      "character": "Sensei",
      "text": "A change of strategies is in order if you’re ever going to go along with it. I just haven’t figured out what the new strategy entails yet."
    },
    {
      "character": "Sensei",
      "text": "We can just stay quiet in the meantime while I work that out in my head."
    },
    {
      "character": "Yumi",
      "text": "The fact that you’re callin’ it a “strategy” tells me pretty much all I need to hear. Still ain’t got any interest in coming to your house and that ain’t gonna change."
    },
    {
      "character": "Sensei",
      "text": "It’s really not how it sounds, Yumi."
    },
    {
      "character": "Yumi",
      "text": "Good. Cause it sounds a lot like you tryin’ to take advantage of me again and I thought we were done with that shit."
    },
    {
      "character": "Sensei",
      "text": "We are."
    },
    {
      "character": "Yumi",
      "text": "You promise?"
    },
    {
      "character": "Sensei",
      "text": "Do promises actually mean anything to you?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Not really."
    },
    {
      "character": "Yumi",
      "text": "When I was still a little brat, not even the same size Chinami is...my douchebag mom promised she’d take me to Okinawa for my birthday."
    },
    {
      "character": "Yumi",
      "text": "But she was so fuckin’ high at the time that she probably didn’t even remember {i}makin’{/i} the promise."
    },
    {
      "character": "Yumi",
      "text": "Least believin’ that makes it easier to accept than her just...decidin’ not to take me once my birthday actually rolled around."
    },
    {
      "character": "Yumi",
      "text": "Haven’t cared much for promises ever since, so I’m not really sure why I asked you in the first place."
    },
    {
      "character": "Sensei",
      "text": "You were probably just looking for another reason to distrust me. Calling it a promise would make it easier to do that for you."
    },
    {
      "character": "Yumi",
      "text": "Probably. Sounds on brand."
    },
    {
      "character": "Sensei",
      "text": "Why Okinawa?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Should I not have asked?"
    },
    {
      "character": "Yumi",
      "text": "You’ll make fun of me. I don’t wanna tell you."
    },
    {
      "character": "Sensei",
      "text": "I’d promise not to, but then you {i}really{/i} wouldn’t want to tell me."
    },
    {
      "character": "Yumi",
      "text": "Probably."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Do you still want to go?"
    },
    {
      "character": "Yumi",
      "text": "Can’t. We’ve got that huge ass wall now, remember?"
    },
    {
      "character": "Sensei",
      "text": "If the wall was gone and we were able to leave, I mean."
    },
    {
      "character": "Yumi",
      "text": "Ain’t the first time you asked me somethin’ like that, you know. Happened on the roof. "
    },
    {
      "character": "Yumi",
      "text": "Shit feels like years ago at this point."
    },
    {
      "character": "Sensei",
      "text": "Maybe it was."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "How many birthdays have you had since you joined my class?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "More than...makes sense."
    },
    {
      "character": "Sensei",
      "text": "Do you think anyone would call you crazy if you pointed that out?"
    },
    {
      "character": "Yumi",
      "text": "Probably. It {i}is{/i} crazy."
    },
    {
      "character": "Sensei",
      "text": "Try. Because I guarantee you they won’t think anything of it."
    },
    {
      "character": "Sensei",
      "text": "And up until recently, you would have felt exactly the same as them."
    },
    {
      "character": "Sensei",
      "text": "{i}That{/i} is why I’m trying to get you on my side. It has nothing to do with my desire to sleep with you."
    },
    {
      "character": "Yumi",
      "text": "The fuck is going on?..."
    },
    {
      "character": "Sensei",
      "text": "We’re stuck. "
    },
    {
      "character": "Yumi",
      "text": "Of course we're stuck. That's the whole fuckin' point of the wall."
    },
    {
      "character": "Sensei",
      "text": "Not in Kumon-mi...in {i}time.{/i} Which I know sounds ridiculous, but it's the truth."
    },
    {
      "character": "Yumi",
      "text": "That ain’t possible. Sounds like...somethin’ from a manga or some shit."
    },
    {
      "character": "Sensei",
      "text": "It does, doesn’t it?"
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Sea turtles..."
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Yumi",
      "text": "I wanted to see the sea turtles...in Okinawa."
    },
    {
      "character": "Yumi",
      "text": "There was this documentary I saw on TV where they went to Tokashiku Beach...and I heard them say I’d be able to see one too if I went there at the right time."
    },
    {
      "character": "Yumi",
      "text": "And even though October ain’t the “right” time...I still thought I might be able to see one if I got lucky or something."
    },
    {
      "character": "Yumi",
      "text": "Maybe there was a turtle out there who was behind schedule or...didn’t really understand how months worked or whatever. I don’t know. It’s stupid. "
    },
    {
      "character": "Yumi",
      "text": "{i}I’m{/i} stupid."
    },
    {
      "character": "Yumi",
      "text": "For havin’ such a...dumb fucking wish...and for trustin’ somebody like my mom to make it happen..."
    },
    {
      "character": "Yumi",
      "text": "It’s all so fuckin’ stupid."
    },
    {
      "character": "Sensei",
      "text": "It’s not."
    },
    {
      "character": "Yumi",
      "text": "It is. You know it is."
    },
    {
      "character": "Sensei",
      "text": "No, it’s an innocent wish. And not something I would have expected from you."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I’d take you myself if I could."
    },
    {
      "character": "Yumi",
      "text": "Don’t say that..."
    },
    {
      "character": "Sensei",
      "text": "I mean it, though."
    },
    {
      "character": "Yumi",
      "text": "Me too!"
    },
    {
      "character": "Yumi",
      "text": "It’s bad enough bein’ let down by one person! I ain’t gonna get my hopes up a second time just because you wanna be a knight in shining armor!"
    },
    {
      "character": "Yumi",
      "text": "For all we know, we might not ever be {i}able{/i} to leave! This city might stay closed forever! You’d be makin’ plans you couldn’t possibly keep! "
    },
    {
      "character": "Yumi",
      "text": "I’m done believin’ in other people! I’ll go there {i}myself{/i} if I ever have the chance! Not with you! Not with anyone!"
    },
    {
      "character": "Sensei",
      "text": "Ah..."
    },
    {
      "character": "Sensei",
      "text": "So you {i}do{/i} still want to see them."
    },
    {
      "character": "Yumi",
      "text": "Of fucking course I do..."
    },
    {
      "character": "Yumi",
      "text": "Dreams don’t just go away. They keep comin’ back until you either make ‘em come true or...find somethin’ else you want instead."
    },
    {
      "character": "Yumi",
      "text": "So what if I ain’t ever found anything else? And what’s it even matter in the first place? Ain’t like people like me are good at makin’ shit like that come true."
    },
    {
      "character": "Yumi",
      "text": "The fact that there’s anything I want at all is a fuckin’ joke. And if I believed in God, I’m sure he’d tell me the same exact shit."
    },
    {
      "character": "Yumi",
      "text": "Somethin’ like, “You need to be good to others if you want good things to happen to you,” or whatever the fuck it is that adults tell kids with anger issues ‘stead of actually teachin’ em how to...not be angry."
    },
    {
      "character": "Sensei",
      "text": "Whatever the case...I hope you make it to Okinawa someday."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Thanks, I guess...and sorry for yellin’ at you."
    },
    {
      "character": "Yumi",
      "text": "Ain’t ever told anybody that before."
    },
    {
      "character": "Sensei",
      "text": "Not even Chika?"
    },
    {
      "character": "Yumi",
      "text": "Never came up, I guess..."
    },
    {
      "character": "Sensei",
      "text": "I see..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "I saw her the other day, you know."
    },
    {
      "character": "Sensei",
      "text": "Chika?"
    },
    {
      "character": "Yumi",
      "text": "No, my fucking mom. Idiot."
    },
    {
      "character": "Yumi",
      "text": "Though, I guess “the other day” is two months ago at this point."
    },
    {
      "character": "Yumi",
      "text": "I was stayin’ at my dad’s place for a while since I didn’t have anywhere else to go and...I guess she caught wind of it and showed up."
    },
    {
      "character": "Yumi",
      "text": "And, honestly...it went...kinda good. She wasn’t pissed that I got kicked out of school and didn’t call me a letdown or any of that shit..."
    },
    {
      "character": "Yumi",
      "text": "Just told me I was doin’ a good job and that Nodoka probably deserved what she had comin’ to her. Which she did."
    },
    {
      "character": "Yumi",
      "text": "Wasn’t just her either. Kaori was there too. Was the first time I talked to her in years."
    },
    {
      "character": "Yumi",
      "text": "Did you know it was her birthday on Christmas? How fuckin’ wild is that? "
    },
    {
      "character": "Yumi",
      "text": "People used to talk about how weird it was that we were both born on such big holidays, but I feel like she’s the one who got the short end of the stick, all things considered."
    },
    {
      "character": "Yumi",
      "text": "Ain’t nobody gonna remember someone’s birthday if it’s on fuckin’ Christmas. Halloween’s easy cause it ain’t that big of a deal."
    },
    {
      "character": "Sensei",
      "text": "What was it like getting to talk to her after so long? Is she anything like you remember?"
    },
    {
      "character": "Yumi",
      "text": "She, uhh..."
    },
    {
      "character": "Yumi",
      "text": "I was kinda expectin’ it after seein’ her with you that one time, but...she ain’t exactly “all there” anymore."
    },
    {
      "character": "Yumi",
      "text": "Wasn’t ever really {i}normal{/i} by any means, but...she’s different now. Don’t think she really remembers me either, which ain’t as hard on me as I expected it to be...but still."
    },
    {
      "character": "Yumi",
      "text": "Kinda surreal seein’ somebody you thought was dead just...suddenly alive and full of energy. Almost {i}too{/i} much energy, if you ask me."
    },
    {
      "character": "Sensei",
      "text": "That is certainly one way to describe her, for sure."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Do you want her number?"
    },
    {
      "character": "Yumi",
      "text": "Kaori’s? Why?"
    },
    {
      "character": "Sensei",
      "text": "To talk to her, obviously. "
    },
    {
      "character": "Yumi",
      "text": "I literally just told you she doesn’t remember me. "
    },
    {
      "character": "Sensei",
      "text": "So remind her. That’s what your mom did and the two of them are relatively close now. "
    },
    {
      "character": "Yumi",
      "text": "Yuki’s just tryin’ to right all the wrongs she made with me by latchin’ onto somebody else who’s lackin’ a mother figure. Does the same shit with Io if what I’ve heard is true. "
    },
    {
      "character": "Sensei",
      "text": "Maybe. But I don’t see why that should prevent you from having a relationship with Kaori."
    },
    {
      "character": "Yumi",
      "text": "I don’t need another “relationship.” Chika’s more than enough for me. And that’s not even countin’ whatever the fuck is goin’ on between us."
    },
    {
      "character": "Sensei",
      "text": "What {i}is{/i} going on between us?"
    },
    {
      "character": "Yumi",
      "text": "Fuckin’...time travel or some shit apparently. Ain’t like {i}I’ve{/i} got a fuckin’ clue."
    },
    {
      "character": "Sensei",
      "text": "Take her number, Yumi. I’m obviously not one to tell you what is and {i}isn’t{/i} good for you, but it’s not like I’m asking you to call her."
    },
    {
      "character": "Sensei",
      "text": "You’ll just...be able to if you ever feel like it."
    },
    {
      "character": "Yumi",
      "text": "Hah..."
    },
    {
      "character": "Yumi",
      "text": "I guess if it’ll get you off my fuckin’ back, I’ll-"
    },
    {
      "character": "Yumi",
      "text": "Huh?..."
    },
    {
      "character": "Sensei",
      "text": "Is something wrong?"
    },
    {
      "character": "Yumi",
      "text": "Do you...see that?"
    },
    {
      "character": "Sensei",
      "text": "See what?"
    },
    {
      "character": "Yumi",
      "text": "Over there...at the end of the aqueduct. "
    },
    {
      "character": "Sensei",
      "text": "I don’t see-"
    },
    {
      "character": "Sensei",
      "text": "Wait, where are you going?"
    },
    {
      "character": "Yumi",
      "text": "To check out what the fuck that is, obviously. Stay here if you’re gonna be a fuckin’ pussy about it."
    },
    {
      "character": "narrator",
      "text": "Yumi takes off toward the end of the aqueduct, and as I lift myself off of the ground to follow her, I notice whatever it is she sees."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "How the fuck?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Since when do we have wild chickens in Kumon-mi?"
    },
    {
      "character": "Sensei",
      "text": "That’s not a wild chicken..."
    },
    {
      "character": "Sensei",
      "text": "That’s someone’s pet."
    }
  ],
  "state_changes": {
    "yumislumber2": {
      "from": null,
      "to": true
    }
  }
}