{
  "event_id": 164,
  "event_label": "yumislumber3",
  "dialogue": [
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Welcome back."
    },
    {
      "character": "Sensei",
      "text": "Are we at...school? When did we get here?"
    },
    {
      "character": "Yumi",
      "text": "Somewhere in the time between your brain clockin’ out and then gettin’ called back in to work, I guess."
    },
    {
      "character": "Yumi",
      "text": "Lasted a fuckin’ while this time. Guess it ain’t much compared to two months if that’s really what happened, though."
    },
    {
      "character": "Sensei",
      "text": "And you stayed with me?"
    },
    {
      "character": "Yumi",
      "text": "Looks that way. Ain’t like I had anything else going on after Chika kicked me out."
    },
    {
      "character": "Yumi",
      "text": "But just because I didn’t leave you in some dried-up aqueduct with a decomposing chicken doesn’t mean I suddenly like you."
    },
    {
      "character": "Sensei",
      "text": "Really? Because that’s my go-to benchmark for deciding whether or not I’m close to someone."
    },
    {
      "character": "Yumi",
      "text": "Ha ha ha. Eat an entire bag of dicks."
    },
    {
      "character": "Sensei",
      "text": "Why {i}here?{/i}"
    },
    {
      "character": "Yumi",
      "text": "Fuck if I know. You kept sayin’ some shit about a box and, before I knew it, you were draggin’ me all the way across town and unlocking the gate."
    },
    {
      "character": "Yumi",
      "text": "Fine by me since there’s food here and shit. But I ain’t sure if it’s a good look for you to be wanderin’ around the halls with a delinquent after hours."
    },
    {
      "character": "Sensei",
      "text": "You’re no longer a delinquent, though. Auto-pilot Yumi reformed herself during your two months of absence."
    },
    {
      "character": "Yumi",
      "text": "You say that as if you were there."
    },
    {
      "character": "Sensei",
      "text": "I kind of wish I was. Prefect Yumi is a sight I don’t think I’d ever be able to see otherwise."
    },
    {
      "character": "Yumi",
      "text": "No one said anything about bein’ a prefect. For all we know, I was still an asshole. Just a...more present asshole, I guess."
    },
    {
      "character": "Sensei",
      "text": "Did I say anything else about a box?"
    },
    {
      "character": "Yumi",
      "text": "You actually have an idea of what that means? Cause I kinda figured it was just mindless blackout shit."
    },
    {
      "character": "Sensei",
      "text": "Yes and no. It’s hard to explain."
    },
    {
      "character": "Yumi",
      "text": "Yeah, what else is fuckin’ new? This has quickly become the weirdest week ever and that’s in no small part to gettin’ dragged along in a day of the life of the world’s most open sex offender."
    },
    {
      "character": "Sensei",
      "text": "This is probably the first full day we’ve spent together, isn’t it?"
    },
    {
      "character": "Yumi",
      "text": "Depends on whether or not you count the last three hours as “you.” "
    },
    {
      "character": "Yumi",
      "text": "Also, don’t go makin’ it sound like this was enjoyable for either one of us. Woulda had more fun stayin’ at home helpin’ Chika keep her sister alive."
    },
    {
      "character": "Sensei",
      "text": "Go do that then. I can survive without a chaperone."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "If I go...what’ll happen if you zone out again?"
    },
    {
      "character": "Sensei",
      "text": "Are you actually worried about me?"
    },
    {
      "character": "Yumi",
      "text": "N-No! Why the fuck would I ever worry about {i}you?!{/i} I just meant I...I don’t really care about us bein’ alone anymore. I can hold my own if you decide to get all fucking...well...you know how you get."
    },
    {
      "character": "Yumi",
      "text": "Plus, we...kinda left off at a weird spot and...guess I’m still a little interested in whatever this whole memory shit is."
    },
    {
      "character": "Yumi",
      "text": "I’m just hangin’ around ‘cause I want answers. And if anybody’s got answers, it’s you."
    },
    {
      "character": "Sensei",
      "text": "What made you change your mind? Because it seemed like you were barely even listening earlier."
    },
    {
      "character": "Yumi",
      "text": "You just suck at explainin’ shit. Obviously I’m gonna be interested if weird, supernatural-ish shit starts happenin’ to me. I just ain’t sure if we can, like...do anything about it yet."
    },
    {
      "character": "Yumi",
      "text": "But if you’ve got ideas...I can, like...listen or whatever. Even if you’re just fuckin’ with me. Which you probably are. But at least it’s a little...entertaining, I guess."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You’re hungry, right?"
    },
    {
      "character": "Yumi",
      "text": "Kind of. Was too busy makin’ sure you didn’t walk into oncoming traffic to stop and eat."
    },
    {
      "character": "Sensei",
      "text": "Then how about we continue this conversation in the cafeteria?"
    },
    {
      "character": "narrator",
      "text": "Something feels different."
    },
    {
      "character": "narrator",
      "text": "Dangerous, even."
    },
    {
      "character": "narrator",
      "text": "But the danger surprisingly does not lie in my own hands and their ability to effortlessly pluck the petals from premature flowers."
    },
    {
      "character": "narrator",
      "text": "It lies in the air."
    },
    {
      "character": "narrator",
      "text": "I can feel it becoming tangible...twisting into the shape of hands."
    },
    {
      "character": "narrator",
      "text": "I can see their fingers elongating...tightly constricting our necks."
    },
    {
      "character": "narrator",
      "text": "All that’s left is to patiently wait and see which one of us chokes first."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I hope it’s her."
    },
    {
      "character": "narrator",
      "text": "It would be easier to take her home if she were unconscious."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "This place always feels so different at night..."
    },
    {
      "character": "Yumi",
      "text": "Takes a lot to creep me out but, not gonna lie, this shit comes close."
    },
    {
      "character": "Sensei",
      "text": "It doesn’t take a lot to creep you out. I successfully creep you out every single day."
    },
    {
      "character": "Yumi",
      "text": "Yeah, the thought of getting raped will do that."
    },
    {
      "character": "Sensei",
      "text": "I wouldn’t-"
    },
    {
      "character": "Yumi",
      "text": "Weirdly enough, shit gets even creepier when you turn the lights {i}on.{/i} "
    },
    {
      "character": "Yumi",
      "text": "Think it’s probably cause it feels less like sneakin’ in and more like everybody’s just...gone. Like the whole world’s in the process of vanishing or some shit."
    },
    {
      "character": "Sensei",
      "text": "Well, I can definitely relate to that."
    },
    {
      "character": "Yumi",
      "text": "You come here often? At night, I mean."
    },
    {
      "character": "Sensei",
      "text": "Are you hitting on me?"
    },
    {
      "character": "Yumi",
      "text": "No, but I {i}will{/i} hit you if you say that again."
    },
    {
      "character": "Sensei",
      "text": "Every once in a while, I’ll show up. I don’t think it’s ever really been intentional, though."
    },
    {
      "character": "Yumi",
      "text": "You mean with your blackouts? They lead you here often?"
    },
    {
      "character": "Sensei",
      "text": "Either them or a small girl with a ponytail."
    },
    {
      "character": "Yumi",
      "text": "Your niece’s friend? The fuck would {i}she{/i} have to do here so late at night?"
    },
    {
      "character": "Sensei",
      "text": "Either she has a very strange hobby or it has something to do with why time is stuck-"
    },
    {
      "character": "Yumi",
      "text": "Wait. Hold that thought. Do you want food or some shit? Because I’ve gotta feeling this is gonna be a long ass explanation and I ain’t gonna be able to listen without something to eat."
    },
    {
      "character": "Sensei",
      "text": "I’m-"
    },
    {
      "character": "Yumi",
      "text": "Fuck it. I’ll just pick something out for you. You’ve treated me to dinner during the job search BS, so I’ve got you this one time."
    },
    {
      "character": "Sensei",
      "text": "Well, thank you for treating me to a meal that I do not want with money you do not have to use."
    },
    {
      "character": "Yumi",
      "text": "You should really say thank you when people do nice things for you, prick. "
    },
    {
      "character": "narrator",
      "text": "Yumi disappears into the kitchen, but doesn’t take it upon herself to kill the darkness as the only light I can make out from here is the faint glow of a refrigerator door opening."
    },
    {
      "character": "narrator",
      "text": "I can tell from the way she moves that she really has done this before, but I’m not sure if I should be thankful I haven’t bumped into her here or...disappointed? Is that the right word?"
    },
    {
      "character": "narrator",
      "text": "If I had crossed paths with her while on one of several trips with Maya, maybe it wouldn’t have taken so long to reel Yumi into this segment of the hidden world?"
    },
    {
      "character": "narrator",
      "text": "After all, she does seem at least slightly central to some “deeper” aspect of my life given how frequently I lose my mind around her..."
    },
    {
      "character": "narrator",
      "text": "But would that alone have been enough to convince her to hear me out? "
    },
    {
      "character": "narrator",
      "text": "And will she hear anything at all when my half-baked attempts at explaining things add up to no more than just “your memory is broken but so is mine. Let’s have a sleepover?”"
    },
    {
      "character": "narrator",
      "text": "I have no idea what I’m doing...nor any idea of what I even want Yumi’s role to be if things {i}do{/i} continue to progress like this."
    },
    {
      "character": "narrator",
      "text": "All I know is I’d feel a little emptier if the one segment of common ground we’ve found ruptured and split."
    },
    {
      "character": "narrator",
      "text": "When she returns, I think about what I would have done if I never encountered Maya on the rooftop that night so long ago."
    },
    {
      "character": "narrator",
      "text": "Would I have felt lonely?"
    },
    {
      "character": "narrator",
      "text": "Would I have maintained the steady pursuit of fucking my entire classroom — completely disregarding how empty it would have felt apart from the momentary warmth?"
    },
    {
      "character": "narrator",
      "text": "Where would it have ended?"
    },
    {
      "character": "narrator",
      "text": "I think for another moment about what would have become of the other {i}me’s{/i} that never felt the first traces of waking up...but I have no reason to brag when I’ve only just begun to open my eyes."
    },
    {
      "character": "narrator",
      "text": "When will it end?"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Just what is the point of all of this?"
    },
    {
      "character": "Yumi",
      "text": "Uhh...hello?"
    },
    {
      "character": "Sensei",
      "text": "Hi."
    },
    {
      "character": "Yumi",
      "text": "Okay, good. Wasn’t sure if you were “there” again or not. "
    },
    {
      "character": "Sensei",
      "text": "I am. And thanks again for the free food that I didn’t want."
    },
    {
      "character": "Yumi",
      "text": "You sure? Cause you haven’t eaten all day either. Been with you the whole time."
    },
    {
      "character": "Sensei",
      "text": "Ami gets mad if I don’t eat the dinner she makes for me every night, so I’ll hold out if it means not getting an earful from her in the morning."
    },
    {
      "character": "Yumi",
      "text": "Damn. She’s got you even more whipped than I thought."
    },
    {
      "character": "Yumi",
      "text": "She involved in all this weird, time-related stuff too? Or is that reserved for just you and Ponytail?"
    },
    {
      "character": "Sensei",
      "text": "Ami’s unrelated. It’s just Maya, Ayane, and me right now."
    },
    {
      "character": "Yumi",
      "text": "Huh. Guess that helps explain why the blonde one’s so fuckin’ obsessed with you and shit."
    },
    {
      "character": "Sensei",
      "text": "She was like that before- actually, yes. That is why she loves me."
    },
    {
      "character": "Sensei",
      "text": "It’s hard not growing close to someone when you live through the apocalypse together."
    },
    {
      "character": "Yumi",
      "text": "Apocalypse? The fuck is this about an apocalypse? I thought we just had some disease or that time was, like...glitching out or some shit. Nobody said anything about an apocalypse."
    },
    {
      "character": "Sensei",
      "text": "That’s just sort of how we started referring to it. "
    },
    {
      "character": "Sensei",
      "text": "You’ll get a more in-depth answer if you decide you really {i}do{/i} want to look more into this, but the bare-bones explanation is that the world is going to end soon and only a few of us are going to remember it."
    },
    {
      "character": "Yumi",
      "text": "The fuck do you mean it’s going to {i}end?{/i} How can you stay so calm while saying that shit?"
    },
    {
      "character": "Sensei",
      "text": "Because it’s going to start again right afterward. At the same place in the school year, but not the same place in time. Do you understand?"
    },
    {
      "character": "Yumi",
      "text": "No. {i}Fuck{/i} no. Am I being Punk’d? Are there cameras here or some shit? "
    },
    {
      "character": "Sensei",
      "text": "I really hope not. My job would be in even greater jeopardy than it already is."
    },
    {
      "character": "Yumi",
      "text": "Apocalypse...a new world...reliving the same school year?"
    },
    {
      "character": "Yumi",
      "text": "How...how the fuck am I supposed to believe that?"
    },
    {
      "character": "Sensei",
      "text": "The only way to believe it is to see it for yourself, I think. "
    },
    {
      "character": "Yumi",
      "text": "And if I..."
    },
    {
      "character": "Yumi",
      "text": "If I sleep with you, I’ll somehow-"
    },
    {
      "character": "Sensei",
      "text": "I’m going to stop you right there because that is definitely not what I was getting at when I suggested that you sleep over my house."
    },
    {
      "character": "Yumi",
      "text": "Be a little more honest about that next time! Of course I was gonna think that’s what you were tryin’ to get at! What kind of grown man just has a normal sleepover with teenage girls?!"
    },
    {
      "character": "Sensei",
      "text": "I’m not the leader of a sex cult, Yumi. I’m just some guy with advanced knowledge of how the world works who is trying to shepherd others into understanding as well."
    },
    {
      "character": "Yumi",
      "text": "That sounds exactly like what the leader of a sex cult would say!"
    },
    {
      "character": "Sensei",
      "text": "You don’t have to sleep with me. You literally just have to show up and hang out at my place so we can all monitor each other and discuss what’s been going on."
    },
    {
      "character": "Sensei",
      "text": "Like I said, you’re one of the only people who has ever been able to grasp that things aren’t exactly as they seem. So we want to use you as a sort of...test subject, I guess."
    },
    {
      "character": "Yumi",
      "text": "And that’s supposed to convince me?!"
    },
    {
      "character": "Sensei",
      "text": "What {i}would{/i} convince you? Because if honesty doesn’t work, I’m not really sure what else to do. I’m not going to force you."
    },
    {
      "character": "Yumi",
      "text": "I-"
    },
    {
      "character": "Yumi",
      "text": "Hah..."
    },
    {
      "character": "Yumi",
      "text": "How the fuck would I explain that to Chika?"
    },
    {
      "character": "Yumi",
      "text": "I get that you ain’t just pervin’ out on me this time, but I’ve got no idea how to tell her that I’m stayin’ at your place even if I {i}do{/i} decide to."
    },
    {
      "character": "Sensei",
      "text": "Then don’t tell her."
    },
    {
      "character": "Yumi",
      "text": "She’s my best friend and she’s...fuckin’ {i}in love{/i} with you for whatever reason. I can’t just ignore that because it’s convenient."
    },
    {
      "character": "Sensei",
      "text": "Convenience doesn’t have anything to do with it, Yumi."
    },
    {
      "character": "Sensei",
      "text": "I’m obviously not one to model your priorities after, but I don’t think it’s all that far-fetched to say getting to the bottom of a time loop is a little more important than {i}love.{/i}"
    },
    {
      "character": "Yumi",
      "text": "Doubt Chika would agree."
    },
    {
      "character": "Sensei",
      "text": "Chika probably won’t even remember once everything is said and done. But I guess I can’t guarantee that as it seems the memories that {i}do{/i} carry over are very...inconsistent."
    },
    {
      "character": "Yumi",
      "text": "Inconsistent how?"
    },
    {
      "character": "Sensei",
      "text": "Inconsistent like...some memories are just omitted if they have anything to do with time or...events surrounding the whole world-resetting ordeal."
    },
    {
      "character": "Yumi",
      "text": "But memories like being sexually assaulted by a teacher get to stay? Sounds fair."
    },
    {
      "character": "Yumi",
      "text": "Figures the world would go out of its way to make my life even shittier. Ain’t like it’s done enough of that already."
    },
    {
      "character": "Yumi",
      "text": "Whether it be deadbeat parents...or growin’ up too mean to get anybody to like me...or havin’ a teacher who openly admits to beating off to his students..."
    },
    {
      "character": "Yumi",
      "text": "Or how I...how despite that, I..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I get it."
    },
    {
      "character": "Sensei",
      "text": "You don’t have to come."
    },
    {
      "character": "Sensei",
      "text": "I’ll tell Maya and Ayane that-"
    },
    {
      "character": "Yumi",
      "text": "I’ll...do it."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "I’ll do it, but...I still ain’t sure what I’m gonna say to Chika. And if you do anything to make me feel even slightly uncomfortable while I’m there, I’m noping the fuck out. Got it?"
    },
    {
      "character": "Sensei",
      "text": "...Yeah."
    },
    {
      "character": "Sensei",
      "text": "That’s fine."
    },
    {
      "character": "Yumi",
      "text": "Cool."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "Anyway, I ain’t really hungry anymore, so...I’m gonna, like...get rid of all this shit so nobody knows anyone was here when they weren’t supposed to be."
    },
    {
      "character": "Yumi",
      "text": "I’ll be fucked out of a bunch of meals in the future if security suddenly tightens and...yeah. I’ll clear your tray too, I guess."
    },
    {
      "character": "Sensei",
      "text": "Yumi-"
    },
    {
      "character": "Yumi",
      "text": "How about we just...shut the fuck up for a little while, okay?"
    },
    {
      "character": "narrator",
      "text": "Yumi clears everything off of the table and, for the next ten minutes, we keep our lips sealed."
    },
    {
      "character": "narrator",
      "text": "But something we find in the hallway beckons us to part them."
    },
    {
      "character": "Yumi",
      "text": "What the...fuck?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "That...wasn’t there the whole time, was it? Didn’t we come down this hallway on the way to the cafeteria?"
    },
    {
      "character": "Sensei",
      "text": "We did..."
    },
    {
      "character": "Yumi",
      "text": "Are we...not alone in here? "
    },
    {
      "character": "Yumi",
      "text": "Somebody’s gotta be playin’ a prank on us, right?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Yumi",
      "text": "You said Ponytail or...uhh...{i}Maya{/i} or whatever comes here too, right? Would {i}she{/i} do something like this?"
    },
    {
      "character": "Yumi",
      "text": "Cause this ain’t-"
    },
    {
      "character": "Yumi",
      "text": "Yo! What are you doing?! There could be, like...a bomb in there or some shit!"
    },
    {
      "character": "Sensei",
      "text": "I have to move it."
    },
    {
      "character": "Sensei",
      "text": "If I don’t move it, we can’t leave."
    },
    {
      "character": "Yumi",
      "text": "We can just walk around it, you fucking idiot! It ain’t like it’s-"
    },
    {
      "character": "Sensei",
      "text": "{b}Lucy, I’m hooooooome!{/b}"
    },
    {
      "character": "Sensei",
      "text": "{b}And I brought a PRIIIIIIIIIIZE!{/b}"
    },
    {
      "character": "narrator",
      "text": "THE DAY ENDS"
    },
    {
      "character": "narrator",
      "text": "A NEW ONE BEGINS"
    },
    {
      "character": "narrator",
      "text": "And I know what it is I have to do."
    }
  ],
  "state_changes": {
    "yumi_love +": {
      "from": 1,
      "to": 3
    },
    "day": {
      "from": 3,
      "to": 4
    },
    "yumislumber3": {
      "from": null,
      "to": true
    }
  }
}