{
  "event_id": 165,
  "event_label": "amispecial50mainp2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Let me tell you a story."
    },
    {
      "character": "narrator",
      "text": "A long time ago, before either one of us existed, there was a seed."
    },
    {
      "character": "narrator",
      "text": "There was also a light."
    },
    {
      "character": "narrator",
      "text": "The light nourished the seed. Then it grew into some other thing and another thing showed up and then more stuff happened and here we are."
    },
    {
      "character": "narrator",
      "text": "It’s all very difficult to follow."
    },
    {
      "character": "narrator",
      "text": "But the important thing to take away from all of it is that there was a very specific order events needed to occur in for us to make it to where we are today."
    },
    {
      "character": "narrator",
      "text": "But what if that light had never appeared?"
    },
    {
      "character": "narrator",
      "text": "What if that seed was never nourished?"
    },
    {
      "character": "narrator",
      "text": "We’re fragile things, you and me. "
    },
    {
      "character": "narrator",
      "text": "I may not look the part, but I am no more or less mortal than you."
    },
    {
      "character": "narrator",
      "text": "If you pinch me, I will scream. And if you cut my belly open, the same stream of colors would pour from {i}my{/i} body as yours if I were to return the favor and open you the same way."
    },
    {
      "character": "narrator",
      "text": "All it takes for us to disappear is one little mistake."
    },
    {
      "character": "narrator",
      "text": "And it’s scary enough going outside knowing that this mistake does not even have to rest in {i}your{/i} hands...and that your life could be cut short by someone {i}else{/i} tripping over their own eight feet. "
    },
    {
      "character": "narrator",
      "text": "How terribly unfair is that?"
    },
    {
      "character": "narrator",
      "text": "Why would anyone ever go outside in the first place knowing everything they think and feel could come crashing down at any moment?"
    },
    {
      "character": "narrator",
      "text": "It all gets more complicated when you realize that simply isolating yourself won’t help either."
    },
    {
      "character": "narrator",
      "text": "Time moves in both ways."
    },
    {
      "character": "narrator",
      "text": "There are things happening in every direction, and every single one of them could impact where you’ll be tomorrow and who you’ll see the next time you open your eyes."
    },
    {
      "character": "narrator",
      "text": "Which is why we should cherish the dark."
    },
    {
      "character": "narrator",
      "text": "For if there is no light, and there is no seed — there would have never been a you or me."
    },
    {
      "character": "narrator",
      "text": "Our fragile timeline would snap like an old bridge and everyone we know, currently trapped between the wooden stakes holding it up labeled {i}past{/i} and {i}future{/i}, would plummet to their deaths."
    },
    {
      "character": "narrator",
      "text": "But that’s just a metaphor."
    },
    {
      "character": "narrator",
      "text": "It would be more like never existing in the first place."
    },
    {
      "character": "narrator",
      "text": "We’d feel no pain as we’d have never developed the ability to feel it."
    },
    {
      "character": "narrator",
      "text": "There would be no lingering regret of a future unexplored because we’d never be ordained to explore it at all."
    },
    {
      "character": "narrator",
      "text": "We’d just be energy, or a lack thereof — waiting for whatever we’re supposed to cite as the creator to just press the start button so we can begin our long and painful journey."
    },
    {
      "character": "narrator",
      "text": "In a sense..."
    },
    {
      "character": "narrator",
      "text": "That makes you a bit of a god too, doesn’t it?"
    },
    {
      "character": "narrator",
      "text": "What if we’re {i}all{/i} gods? Packed to the gills with divine blood and celestial plasma- all simultaneously pressing “Start” but spawning in different locations at different stages in life."
    },
    {
      "character": "narrator",
      "text": "These are questions I can only pose as the dark was killed by what came after."
    },
    {
      "character": "narrator",
      "text": "But when I go to sleep at night, I dream of a world where it wasn’t."
    },
    {
      "character": "narrator",
      "text": "And those dreams are so peaceful-"
    },
    {
      "character": "narrator",
      "text": "Because it’s more like they’re not even happening."
    },
    {
      "character": "narrator",
      "text": "Sometimes, it feels like there’s a little too much truth floating around."
    },
    {
      "character": "narrator",
      "text": "So much, in fact, that if you were to spend the entirety of your life doing nothing but collecting information, you’d {i}still{/i} know nothing at all when your time here has come and gone."
    },
    {
      "character": "narrator",
      "text": "It’s no different for those of us who can never expire."
    },
    {
      "character": "narrator",
      "text": "I, too, often feel that it’s all so overwhelming. "
    },
    {
      "character": "narrator",
      "text": "Yet I remain here amidst the Nothing as it is my job to think."
    },
    {
      "character": "narrator",
      "text": "It goes deeper than you know."
    },
    {
      "character": "narrator",
      "text": "For every question answered, there will be ten more asked."
    },
    {
      "character": "narrator",
      "text": "With that in mind, would it not be better to wish that we were all just gone?"
    },
    {
      "character": "narrator",
      "text": "Only in the light will you be given a mission."
    },
    {
      "character": "narrator",
      "text": "And only in the dark will it be fulfilled."
    },
    {
      "character": "narrator",
      "text": "It’s such a shame that these two cannot co-exist."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "Tell me-"
    },
    {
      "character": "narrator",
      "text": "And I only ask this because I’ve been wondering for quite some time-"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I should answer the door."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "What the fuck are you smiling about?! I’m trying to have a serious conversation with you!"
    },
    {
      "character": "Ami",
      "text": "I’m obviously smiling because it looks like you two are still my friends after all! Yay!"
    },
    {
      "character": "Ami",
      "text": "But you might want to keep it {i}juuuuuuuuust{/i} a little bit quieter or you’ll wake Sensei up. And he needs his sleep or he’ll be grumpy all day."
    },
    {
      "character": "Sensei",
      "text": "I’m already awake, Ami."
    },
    {
      "character": "Ami",
      "text": "Oh, good morning. I just made some coffee with our brand new 10-cup Chemex Vase that you can help yourself to. Sorry Maya’s such a loud-mouth and wound up waking you up. I tried to get her to be quiet."
    },
    {
      "character": "narrator",
      "text": "Ayane quickly retreats to my side as soon as I-"
    },
    {
      "character": "Ami",
      "text": "Ayane, what do you think you’re-"
    },
    {
      "character": "Maya",
      "text": "Ami! Talk to me! {i}I’m{/i} the one who’s pissed off at you right now, not Ayane!"
    },
    {
      "character": "Ami",
      "text": "Sorry, did you say {i}you’re{/i} pissed off at me? Shouldn’t it be the other way around?"
    },
    {
      "character": "Maya",
      "text": "After you called us out in the middle of the night and ditched us? No. It probably shouldn’t. And I think it’s pretty fucking normal that we’re mad at you about that."
    },
    {
      "character": "Ami",
      "text": "{i}I{/i} ditched you?! Are you kidding?! You guys called {i}me{/i} and told me to meet you in the Old District! Even after I said I didn’t want to!"
    },
    {
      "character": "Maya",
      "text": "We...what? No, that’s-"
    },
    {
      "character": "Ami",
      "text": "Do you have any idea how lost I was?! It’s a miracle Sensei was able to find me! "
    },
    {
      "character": "Maya",
      "text": "Bullshit! You’re the one who called me and told me to meet you at the shrine!"
    },
    {
      "character": "Ami",
      "text": "Why would I ever ask to meet you at the shrine? That’s stupid. If you’re going to come up with a lie, at least make it a believable one."
    },
    {
      "character": "Maya",
      "text": "It’s more believable than me asking you to meet me in the Old District when you know I can’t even go there!"
    },
    {
      "character": "Ami",
      "text": "Why not?"
    },
    {
      "character": "Maya",
      "text": "Why not what?"
    },
    {
      "character": "Ami",
      "text": "Why can’t you go there, Maya? I don’t think you’ve ever told me before."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "I’m a good friend, so I never bothered prying. But if you’re going to use that as an excuse, you should at least tell me {i}why,{/i} right?"
    },
    {
      "character": "Ami",
      "text": "Because if you {i}don’t,{/i} it’s just going to sound like you’re making things up. And you’d {i}never{/i} do that, right?"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh! I know! How about we make it into a little game! I’ll confess one thing, and then you can confess another! It’ll be a good way for us to show each other we still value our friendship!"
    },
    {
      "character": "Ami",
      "text": "You start! Why can’t you go to the Old District?"
    },
    {
      "character": "Maya",
      "text": "What do you think you’re doing?"
    },
    {
      "character": "Ami",
      "text": "Fine! {i}I’ll{/i} start!"
    },
    {
      "character": "Ami",
      "text": "Sometimes, I try on your clothes while you’re not around and pretend to be you! And I’m happy to say that my Maya impression is actually getting really good!"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Your turn!"
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Ayane, is everything-"
    },
    {
      "character": "Ayane",
      "text": "Mhm. All good. Just...a little headache. That’s all."
    },
    {
      "character": "Sensei",
      "text": "Are you sure that’s-"
    },
    {
      "character": "Ayane",
      "text": "Mhm! Totally sure! Nothing to worry about here! Just...getting my daily dose of Sensei!"
    },
    {
      "character": "Ami",
      "text": "Ayane, I’m really going to need you to-"
    },
    {
      "character": "Maya",
      "text": "Ami! Come on!"
    },
    {
      "character": "Ami",
      "text": "Jeez, you’re really bad at this game."
    },
    {
      "character": "Maya",
      "text": "It’s not a game! And I have no idea what you’re trying to pull here by pretending {i}we’re{/i} the ones who ditched you, but it’s two against one here and you’re not fooling anybody!"
    },
    {
      "character": "Ami",
      "text": "It’s {i}always{/i} two against one lately! And I don’t know what it is that compelled you guys to stop treating me like a friend, but it’s not fair! I didn’t do anything to you! Ever!"
    },
    {
      "character": "Ami",
      "text": "If you wanna weed me out, that’s one thing! But if you think I’m gonna let you {i}bully{/i} me and pick on me by...leading me on and stuff, then you can get the heck out of my house! "
    },
    {
      "character": "Maya",
      "text": "{i}Bully{/i} you?...What the fuck are you talking about? We haven’t done anything like that."
    },
    {
      "character": "Ami",
      "text": "Liar! Liar! Liar! Liar! Liar! Liar! Liar! Liar! "
    },
    {
      "character": "Ami",
      "text": "You guys are picking on me because you don’t like how close I am to Sensei and you’re trying to take him away! But I won’t let you! He’s mine and he sees everything I do! He’ll be on my side no matter what!"
    },
    {
      "character": "Ami",
      "text": "Right, Sensei?!"
    },
    {
      "character": "Ayane",
      "text": "Nh!"
    },
    {
      "character": "Sensei",
      "text": "Ami, I get that you’re upset, but can you stop yelling? I’m pretty sure you’re scaring Ayane."
    },
    {
      "character": "Ami",
      "text": "{i}Scaring{/i} her? I don’t think that’s true. She’s probably just being manipulated by Maya into thinking I’m the bad guy when I’m not even {i}that{/i} mad at her. {i}Maya’s{/i} the one who called me last night after all."
    },
    {
      "character": "Ami",
      "text": "So if Ayane wants to apologize for ditching me, I’ll forgive her right now since I’m such a good person!"
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Ayaneeeeeeeee?"
    },
    {
      "character": "Ayane",
      "text": "H...Heeeeey Ami...Good morning..."
    },
    {
      "character": "Ami",
      "text": "Wow, you really {i}do{/i} look scared. How come? Don’t you, like...know karate and stuff? Shouldn't {i}I{/i} be the one afraid of {i}you?{/i}"
    },
    {
      "character": "Ayane",
      "text": "I’m not afraid! I just...you know me! Always wanting to be close to Sensei and...that’s what I’m doing now."
    },
    {
      "character": "Ami",
      "text": "Is that {i}really{/i} all you're doing?"
    },
    {
      "character": "Maya",
      "text": "Leave Ayane out of this! I’m the one yelling at you, not her!"
    },
    {
      "character": "Ami",
      "text": "Nobody should be yelling at me since I’m a good girl who never does anything wrong."
    },
    {
      "character": "Ami",
      "text": "All I wanted was to be friends with you and live happily ever after, but now you’re trying to force me out. You can’t blame me for being a little upset about that, can you?"
    },
    {
      "character": "Maya",
      "text": "For the last time, no one is trying to force you out!"
    },
    {
      "character": "Ami",
      "text": "Then how come you guys are always hanging out with Sensei without me? He’s {i}my{/i} uncle, you know. It’s really weird if other teenagers are just spending their free time hanging out with him."
    },
    {
      "character": "Sensei",
      "text": "Ami, it’s up to me how I spend my time. Don’t take my decisions out on them."
    },
    {
      "character": "Ami",
      "text": "So {i}you’re{/i} the one deciding to hang out with my friends without me? It’s not just them trying to steal you?"
    },
    {
      "character": "Sensei",
      "text": "If I say yes, will you leave them alone?"
    },
    {
      "character": "Ami",
      "text": "You say that like I’m tormenting them. They’re the ones who showed up here. I was just trying to be a good niece and make breakfast like I always do."
    },
    {
      "character": "Ami",
      "text": "If I really wanted to torment them, I wouldn’t wait for them to find me, would I?"
    },
    {
      "character": "Sensei",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "When have I ever gone out of my way to do {i}anything{/i} mean to Ayane or Maya? I just want them to love me as much as I love them."
    },
    {
      "character": "Sensei",
      "text": "Then just...put all of this behind you for now. "
    },
    {
      "character": "Ami",
      "text": "You’re...gonna forgive them for leading me to the middle of nowhere that easily? Really?"
    },
    {
      "character": "Maya",
      "text": "We didn’t do-"
    },
    {
      "character": "Sensei",
      "text": "Maya, let me handle this."
    },
    {
      "character": "Sensei",
      "text": "I don’t care who called who or...who {i}ditched{/i} who, but something like that is too small to kill a friendship over when you’ve all known each other for years."
    },
    {
      "character": "Sensei",
      "text": "So just put it behind you for now and...try to move on. And know that Maya and Ayane probably wouldn’t have shown up here if they {i}didn’t{/i} care about you. They came here {i}because{/i} they cared."
    },
    {
      "character": "Ami",
      "text": "Mm...I guess I didn’t really think of it like that..."
    },
    {
      "character": "Ami",
      "text": "I just don’t want us growing apart and it really feels like they don’t want me as a part of the group sometimes..."
    },
    {
      "character": "Ami",
      "text": "I don’t mind apologizing and trying to move on, but...it’d be nice to hear them say they love me at least."
    },
    {
      "character": "Ami",
      "text": "If they can do that...I can probably convince myself they don’t mean any harm."
    },
    {
      "character": "Maya",
      "text": "I {i}do{/i} love you, Ami. And I hope this really {i}was{/i} just...some miraculous misunderstanding, but-"
    },
    {
      "character": "Ami",
      "text": "I love you too, Maya...I’m sorry for getting mad."
    },
    {
      "character": "Maya",
      "text": "Don’t..."
    },
    {
      "character": "Maya",
      "text": "Don’t...worry about it?..."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Ayane? Do you-"
    },
    {
      "character": "Ami",
      "text": "...Ayane?"
    },
    {
      "character": "Ayane",
      "text": "Mhm. I love you, Ami. A lot."
    },
    {
      "character": "Ami",
      "text": "You don’t really look like-"
    },
    {
      "character": "Sensei",
      "text": "Just leave it for now, Ami. We all love you."
    },
    {
      "character": "Ami",
      "text": "Okay..."
    },
    {
      "character": "Ami",
      "text": "If you say so, Sensei."
    },
    {
      "character": "Ami",
      "text": "But I’ll be keeping a close eye on everybody to make sure of that, okay?"
    },
    {
      "character": "narrator",
      "text": "I actually manage to deescalate a situation for once and send Maya and Ayane on their way."
    },
    {
      "character": "narrator",
      "text": "And while I can’t help but feel like I should set up some kind of meeting with them to talk about this in the future, I realize that’s exactly what Ami has a problem with in the first place."
    },
    {
      "character": "narrator",
      "text": "They might not be trying to “steal me” from her or anything like that, but I can only imagine how it must feel to watch everyone you love have fun without you."
    },
    {
      "character": "narrator",
      "text": "Maybe this whole...Ami-reset situation could use a bit of a reevaluation on Maya’s end...Especially since she still hasn’t made it apparent what the big deal is when it comes to including her."
    },
    {
      "character": "narrator",
      "text": "If we could actually involve Ami in some way...that might work wonders in getting her to go back to her normal, cheerful self."
    },
    {
      "character": "narrator",
      "text": "I love my niece. She’s one of the most amazing aspects of my life."
    },
    {
      "character": "narrator",
      "text": "But even I know when enough is enough."
    },
    {
      "character": "narrator",
      "text": "And she’s slowly turning into something that will be much harder to love."
    },
    {
      "character": "Ami",
      "text": "So...I guess I should be getting back to breakfast now, huh? "
    },
    {
      "character": "Sensei",
      "text": "Ami...I think we need to have a little talk."
    },
    {
      "character": "Ami",
      "text": "Don’t worry, I’m not pregnant. I already checked."
    },
    {
      "character": "Sensei",
      "text": "What? No."
    },
    {
      "character": "Sensei",
      "text": "It’s not that. I just..."
    },
    {
      "character": "Sensei",
      "text": "I think you need to give me a little more space."
    },
    {
      "character": "Ami",
      "text": "Sure."
    },
    {
      "character": "Sensei",
      "text": "I get that you’re dependent on me and everything, but-"
    },
    {
      "character": "Ami",
      "text": "Okay."
    },
    {
      "character": "Sensei",
      "text": "No, listen. I get that you’ve essentially centered your entire life around me and that...me {i}not{/i} going along with that makes you feel insignificant-"
    },
    {
      "character": "Ami",
      "text": "Whatever you want."
    },
    {
      "character": "Sensei",
      "text": "But that’s not what I’m trying to do. I just need to be able to exist on my own now that I’m finally learning to...function as an adult and-"
    },
    {
      "character": "Ami",
      "text": "You can have space."
    },
    {
      "character": "Sensei",
      "text": "Can you at least let me finish before you completely reject- Wait, what?"
    },
    {
      "character": "Ami",
      "text": "I said you can have space. I get it."
    },
    {
      "character": "Ami",
      "text": "I’m too clingy. And I’ll try and be {i}less{/i} clingy for your sake since that’s what you want from me."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Can I feel your forehead?"
    },
    {
      "character": "Ami",
      "text": "Sensei, I’m not sick. I get it. "
    },
    {
      "character": "Ami",
      "text": "Do whatever you want. I know you love me enough to not make any...stupid mistakes that will hurt me or anything."
    },
    {
      "character": "Ami",
      "text": "Plus, spending a little less time thinking about you will give me a chance to focus on other stuff for a little while."
    },
    {
      "character": "Sensei",
      "text": "Ami, please let me feel your forehead."
    },
    {
      "character": "Ami",
      "text": "I know it’s probably not my place to ask for anything here since...this is all kind of the result of me just being a little too attached in the first place, but..."
    },
    {
      "character": "Ami",
      "text": "Would you mind if I asked for a {i}teensy{/i} little favor in exchange for more of this “space” that you want all of a sudden?"
    },
    {
      "character": "Sensei",
      "text": "How “teensy” are we talking here?"
    },
    {
      "character": "Ami",
      "text": "Really teensy."
    },
    {
      "character": "Sensei",
      "text": "Then...what is it?"
    }
  ],
  "state_changes": {
    "amispecial50mainp2": {
      "from": null,
      "to": true
    },
    "day": {
      "from": 4,
      "to": 7
    }
  }
}