{
  "event_id": 168,
  "event_label": "makotowinterbeach4",
  "dialogue": [
    {
      "character": "narrator",
      "text": "Morning comes before any of us want it to. "
    },
    {
      "character": "narrator",
      "text": "But I suppose that’s just how vacations always end."
    },
    {
      "character": "narrator",
      "text": "Even if those vacations happen to last no longer than a day. "
    },
    {
      "character": "narrator",
      "text": "We pack our things and head for the bus stop."
    },
    {
      "character": "narrator",
      "text": "It arrives roughly seven minutes later."
    },
    {
      "character": "narrator",
      "text": "Makoto sits next to me once we board. "
    },
    {
      "character": "narrator",
      "text": "Miku sits in the row across from us despite how our current bench could easily fit three people."
    },
    {
      "character": "narrator",
      "text": "She doesn’t say much all morning."
    },
    {
      "character": "narrator",
      "text": "The bus drives slightly over the speed limit, making the clouds work mildly harder to keep up with us."
    },
    {
      "character": "narrator",
      "text": "On the way home, I notice the mangled corpse of a tanuki decaying along the side of the road."
    },
    {
      "character": "narrator",
      "text": "No one else notices it. "
    },
    {
      "character": "narrator",
      "text": "And if they do, they elect to remain silent instead of pointing out the beautiful yet grotesque concept of life spawning from death."
    },
    {
      "character": "narrator",
      "text": "I focus on the yellowish mound of wriggling larvae on top of the corpse, trying desperately to live and not become the breakfast of a touring bird."
    },
    {
      "character": "narrator",
      "text": "As the bus moves further away, I spot a buzzard."
    },
    {
      "character": "narrator",
      "text": "I accept that death comes for everyone and everything."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Miku winds up getting off the bus several stops before Makoto and me."
    },
    {
      "character": "narrator",
      "text": "I expected Makoto to get off as well, but it appears that one night alone was not enough to clear her mind of the things she’d locked away in it."
    },
    {
      "character": "narrator",
      "text": "She requires, at the very least, one more morning in order to do that."
    },
    {
      "character": "narrator",
      "text": "And with Ami at work and not able to run interference between the two of us, it makes complete sense to invite her over and see what happens next."
    },
    {
      "character": "narrator",
      "text": "I doubt it will be anything exciting."
    },
    {
      "character": "narrator",
      "text": "Today is already off to a bad start."
    },
    {
      "character": "narrator",
      "text": "But I suppose it’s time to see how much worse it is going to get."
    },
    {
      "character": "Makoto",
      "text": "I obviously can’t speak for you, but {i}I{/i} had a good time yesterday."
    },
    {
      "character": "Makoto",
      "text": "And you managed to make it through the entire night without [molesting] me, so I’d be lying if I said I wasn’t a little impressed."
    },
    {
      "character": "Sensei",
      "text": "Does this mean I get an ice pop?"
    },
    {
      "character": "Makoto",
      "text": "Do you want one?"
    },
    {
      "character": "Sensei",
      "text": "Obviously. When do I ever {i}not{/i} want one?"
    },
    {
      "character": "Makoto",
      "text": "Then...how about I tell you a secret?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Why do I feel like this secret isn’t going to be the type of reward I’m looking for?"
    },
    {
      "character": "Makoto",
      "text": "Because despite our obvious progress, I still feel a shadow lurking somewhere in the background."
    },
    {
      "character": "Makoto",
      "text": "And I’m afraid that as soon as I go back to my dorm, the shadow will fuse with you and turn you back into the same guy who gets off on picking on me."
    },
    {
      "character": "Sensei",
      "text": "It’s my shadow. It’s already fused with me."
    },
    {
      "character": "Makoto",
      "text": "I suppose that’s true. But sometimes, when the light is angled just perfectly, it moves really far away. "
    },
    {
      "character": "Makoto",
      "text": "And, forgive my inadequacy when it comes to poetry, but I would very much like to be that light this morning."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Is everything okay? You’re acting a little...unusual right now."
    },
    {
      "character": "Makoto",
      "text": "Is that genuine concern or do you just feel obligated to say that?"
    },
    {
      "character": "Sensei",
      "text": "A little of both."
    },
    {
      "character": "Makoto",
      "text": "I see."
    },
    {
      "character": "Makoto",
      "text": "Everything is okay."
    },
    {
      "character": "Sensei",
      "text": "Good. Because-"
    },
    {
      "character": "Makoto",
      "text": "But only because I force everything to be okay."
    },
    {
      "character": "Sensei",
      "text": "Oh."
    },
    {
      "character": "Sensei",
      "text": "Is this where the secret comes into play?"
    },
    {
      "character": "Makoto",
      "text": "This is where the secret comes into play."
    },
    {
      "character": "narrator",
      "text": "Makoto takes a deep breath and closes her eyes for a moment."
    },
    {
      "character": "narrator",
      "text": "If this were a normal morning, she’d be breathing in the scent of french toast or an omelette made with an ungodly amount of meat in it."
    },
    {
      "character": "narrator",
      "text": "But, as I walked out on the girl who would normally make those things in favor of spending time with Makoto yesterday, there is no scent at all."
    },
    {
      "character": "narrator",
      "text": "She breathes in plain air."
    },
    {
      "character": "narrator",
      "text": "It fills her lungs and I watch as her chest expands and contracts."
    },
    {
      "character": "narrator",
      "text": "She remains silent for a moment before confessing something to me."
    },
    {
      "character": "Makoto",
      "text": "I’ve been having some pretty strange dreams lately, Sensei."
    },
    {
      "character": "Makoto",
      "text": "They come out of nowhere. Sometimes, when I’m not even sleeping."
    },
    {
      "character": "narrator",
      "text": "I've heard this before."
    },
    {
      "character": "Makoto",
      "text": "I very rarely make it out of those dreams."
    },
    {
      "character": "Makoto",
      "text": "They’re always the kind that end with you on the brink of death. When the moment death comes is the moment that wakes you."
    },
    {
      "character": "Makoto",
      "text": "You know the kind of dreams I’m talking about, right?"
    },
    {
      "character": "Sensei",
      "text": "Of course. That phenomenon of waking up just as you’re about to die in a dream isn’t exactly uncommon."
    },
    {
      "character": "Makoto",
      "text": "I know. It’s a direct result of the combination of REM sleep with the flood of adrenaline that comes from being inserted into a stressful or terrifying situation."
    },
    {
      "character": "Makoto",
      "text": "But a more interesting phenomenon is when every single journey through REM sleep yields the same exact dream."
    },
    {
      "character": "Makoto",
      "text": "It turns something so obviously fake into something that feels just as real as waking up and starting your morning routine."
    },
    {
      "character": "Makoto",
      "text": "For me, that routine is brewing a pot of coffee, taking a shower, straightening out my uniform, and then texting my mother to say good morning."
    },
    {
      "character": "Makoto",
      "text": "But lately, that routine has started to become weighed down by the excruciatingly dark undertones of myself and a blanket of stars not at all dissimilar from what we saw on the beach last night."
    },
    {
      "character": "Sensei",
      "text": "Well, yes. The night sky is dark by nature. I wouldn’t exactly say that’s a dark undertone, though."
    },
    {
      "character": "Makoto",
      "text": "By itself, no. But when you start having the same dream over and over and over again, you start having time to analyze different aspects of it."
    },
    {
      "character": "Makoto",
      "text": "The dream is not just of the sky itself but of me as I swim through it."
    },
    {
      "character": "Makoto",
      "text": "The only issue is, you can’t swim through the sky. And so logic dictates that I would have to be falling."
    },
    {
      "character": "Sensei",
      "text": "Or flying, since it’s a dream and logic doesn’t influence dreams."
    },
    {
      "character": "Makoto",
      "text": "To say it doesn’t influence them is a bit of a reach, don’t you think?"
    },
    {
      "character": "Makoto",
      "text": "Pretty much everything we see is tied to logic in one way or another. Things very rarely happen without reason."
    },
    {
      "character": "Makoto",
      "text": "And so, as someone who spends far too much time bathing in this aspect of human thought, it’s easy for me to understand what’s happening in those dreams of mine."
    },
    {
      "character": "Sensei",
      "text": "Which is?"
    },
    {
      "character": "Makoto",
      "text": "I’m jumping, idiot."
    },
    {
      "character": "Makoto",
      "text": "I’m having recurring dreams about jumping off of something, somewhere. "
    },
    {
      "character": "Makoto",
      "text": "And I believe that the reason for this is that there has been something dark growing inside of me for a very long time."
    },
    {
      "character": "Makoto",
      "text": "My own shadow, I suppose."
    },
    {
      "character": "Makoto",
      "text": "Just mine compels me to think about things like jumping out of a moving car on the highway or taking a few extra painkillers just to see what would happen."
    },
    {
      "character": "Sensei",
      "text": "That...definitely sounds a little worse than what my apparent shadow makes me do."
    },
    {
      "character": "Makoto",
      "text": "Worse, sure. But I’m stronger than you and would never let something like that overtake me the same way you let {i}yours{/i} overtake {i}you{/i}."
    },
    {
      "character": "Makoto",
      "text": "No matter how many times I have that dream, I’ll never try to reenact it."
    },
    {
      "character": "Makoto",
      "text": "I’m smart. I have a bright future ahead of me. I have a wonderful best friend. And I like to think I’m at least decently attractive."
    },
    {
      "character": "Sensei",
      "text": "You’re very attractive, Makoto."
    },
    {
      "character": "Makoto",
      "text": "You’re only saying that because you want another ice pop."
    },
    {
      "character": "Sensei",
      "text": "Well, yeah. But also because it’s true."
    },
    {
      "character": "Sensei",
      "text": "But why spend time thinking about all of those things when, comparatively, your situation isn’t all that bad?"
    },
    {
      "character": "Makoto",
      "text": "I’ve explained something like that to you in the past, haven’t I?"
    },
    {
      "character": "Makoto",
      "text": "What was my reasoning back then?"
    },
    {
      "character": "Sensei",
      "text": "I think it was something like “That's just the way it is.”"
    },
    {
      "character": "Makoto",
      "text": "Then that’s my reasoning this time, too."
    },
    {
      "character": "Makoto",
      "text": "Not everyone has complete control over their emotions the way you do, Sensei."
    },
    {
      "character": "Makoto",
      "text": "There are some people out there who would laugh in the face of all that I go through if it happened to them."
    },
    {
      "character": "Makoto",
      "text": "But the amount of effort I put into hiding that part of me really only makes me more tired at the end of the day."
    },
    {
      "character": "Makoto",
      "text": "Mix that with an onslaught of dreams that feel more like memories of horrible things and you have one unhappy Makoto."
    },
    {
      "character": "Makoto",
      "text": "And, it might not always work, but the best medicine for an unhappy Makoto is someone who can constantly remind her that her troubles are nothing but troubles."
    },
    {
      "character": "Makoto",
      "text": "And most troubles go away with time."
    },
    {
      "character": "Makoto",
      "text": "Dreams, too."
    },
    {
      "character": "Makoto",
      "text": "I don’t want to die, Sensei."
    },
    {
      "character": "Makoto",
      "text": "And it’s not that I don’t want to die. I don’t want to think about dying. And, at this point, it’s become almost an inevitability."
    },
    {
      "character": "Makoto",
      "text": "I’ll never give into something just because of an inevitability, though. So I guess that's one area where I could be considered an idiot."
    },
    {
      "character": "Makoto",
      "text": "But the fact that part of me is there at all is just..."
    },
    {
      "character": "Sensei",
      "text": "Scary."
    },
    {
      "character": "Makoto",
      "text": "Not even that."
    },
    {
      "character": "Makoto",
      "text": "It’s just...exhausting."
    },
    {
      "character": "Makoto",
      "text": "I’m so tired."
    },
    {
      "character": "Sensei",
      "text": "Well then wake up, loser."
    },
    {
      "character": "Makoto",
      "text": "Oh, would you look at that. I’m perfectly fine, now."
    },
    {
      "character": "Makoto",
      "text": "Thank you so much for listening to me, Sensei."
    },
    {
      "character": "Sensei",
      "text": "Any time, Makoto."
    },
    {
      "character": "Sensei",
      "text": "You know that a big part of why I say things like this to you is because I think you can handle it, right?"
    },
    {
      "character": "Makoto",
      "text": "Obviously, but even I have limits."
    },
    {
      "character": "Makoto",
      "text": "And so I figured coming out and trying to properly explain more about the things I’m feeling to you would help."
    },
    {
      "character": "Makoto",
      "text": "The issue with that is that even though I can try to explain those things, I feel like I can’t even come close to properly doing them justice."
    },
    {
      "character": "Makoto",
      "text": "All of those dreams and all of those things that I see, even though I {i}know{/i} they’re dreams, still feel like more."
    },
    {
      "character": "Makoto",
      "text": "I know I’ve already compared them to memories, but...even that word doesn’t really apply."
    },
    {
      "character": "Makoto",
      "text": "But I’m sure that this combined with everything else I’ve forced onto you over the last 24 hours doesn’t exactly allude to my expected stability, does it?"
    },
    {
      "character": "Sensei",
      "text": "Oh, I’ve already given up on expecting stability from you."
    },
    {
      "character": "Makoto",
      "text": "Is that an insult?"
    },
    {
      "character": "Sensei",
      "text": "More of an evaluation."
    },
    {
      "character": "Sensei",
      "text": "You have depression, right?"
    },
    {
      "character": "Makoto",
      "text": "Probably. Over 10%% of all people are expected to have some sort of mental disorder. It would make sense if that was the reason behind all of this."
    },
    {
      "character": "Sensei",
      "text": "That number definitely seems higher than 10%% based on all of the people I find myself associating with on a daily basis."
    },
    {
      "character": "Makoto",
      "text": "We really don’t have the most...stable class, do we?"
    },
    {
      "character": "Sensei",
      "text": "Not even close."
    },
    {
      "character": "Sensei",
      "text": "But what I’m saying is that you don’t really need to worry about how you look to me or anyone else."
    },
    {
      "character": "Sensei",
      "text": "Like, if you ever want to show up to[school] some time and skip out on doing my work for me, just tell me."
    },
    {
      "character": "Makoto",
      "text": "And if I ask to just...{i}always{/i} skip out on your work?"
    },
    {
      "character": "Sensei",
      "text": "Well that would just be irresponsible if you want me to keep teaching."
    },
    {
      "character": "Makoto",
      "text": "Right...that would be completely irresponsible of {i}me...{/i}"
    },
    {
      "character": "Sensei",
      "text": "There you go. Now you’re starting to get it."
    },
    {
      "character": "Makoto",
      "text": "What I’m confused about, though, is that if you don’t expect stability from me...what do you expect?"
    },
    {
      "character": "Makoto",
      "text": "Because all this time I’ve been citing myself as the cool, calm, collected one."
    },
    {
      "character": "Sensei",
      "text": "I expect literally nothing from you."
    },
    {
      "character": "Makoto",
      "text": "Well that's just plain rude."
    },
    {
      "character": "Sensei",
      "text": "Do you want to sit behind my desk from now on? Will that make you feel better?"
    },
    {
      "character": "Makoto",
      "text": "Can I?!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Does that...really make you that excited?"
    },
    {
      "character": "Makoto",
      "text": "Forgive the pun but, depressingly so!"
    },
    {
      "character": "Makoto",
      "text": "And...since we’re already on the topic of things that would make me feel better..."
    },
    {
      "character": "Makoto",
      "text": "Could I ask you to...maybe be a little more honest with me from now on?"
    },
    {
      "character": "Sensei",
      "text": "Honest about what, exactly?"
    },
    {
      "character": "Makoto",
      "text": "Honest about the things that I already know you’re doing but you’ve yet to come out and admit to."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Okay, fine. {i}I{/i} am the one who has been hiding the various soups."
    },
    {
      "character": "Makoto",
      "text": "Why would you do this?"
    },
    {
      "character": "Sensei",
      "text": "I just had so many of them. It got out of control."
    },
    {
      "character": "Makoto",
      "text": "Nothing is truly certain unless you see it with your own eyes or hear it with your own ears."
    },
    {
      "character": "Makoto",
      "text": "And even then, there’s the possibility of what you see or hear being an object of delusion."
    },
    {
      "character": "Makoto",
      "text": "So nothing is ever certain as a whole."
    },
    {
      "character": "Makoto",
      "text": "But there are some things that are a lot easier to accept once they’re out in the open."
    },
    {
      "character": "Makoto",
      "text": "So...I won’t say something like “I’ll be happy with just knowing” because that would make me a liar."
    },
    {
      "character": "Makoto",
      "text": "But I’d probably be able to fall asleep a little better."
    },
    {
      "character": "Makoto",
      "text": "And that would be a...good start."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I already told you I did it. What else you do want to know?"
    },
    {
      "character": "Makoto",
      "text": "Can I...ask you how many or would that be pushing it?"
    },
    {
      "character": "Sensei",
      "text": "That would be pushing it."
    },
    {
      "character": "Sensei",
      "text": "Accept your victory and move on with whatever solace that was able to provide."
    },
    {
      "character": "Makoto",
      "text": "It feels out of place to say it in this context...but thank you."
    },
    {
      "character": "Makoto",
      "text": "Thank you for trusting me and thank you for not viewing me as a wicked witch."
    },
    {
      "character": "Makoto",
      "text": "And again, thank you for not [molesting] me in the middle of the night."
    },
    {
      "character": "Makoto",
      "text": "I realize that was probably the hardest for you out of all of those things."
    },
    {
      "character": "Sensei",
      "text": "Is there any chance for a...second reward?"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Right now? Seriously?"
    },
    {
      "character": "Sensei",
      "text": "Ice pop! Ice pop! Ice pop!"
    },
    {
      "character": "Makoto",
      "text": "...Fine."
    },
    {
      "character": "narrator",
      "text": "{i}Makoto’s affection has increased to [makoto_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "makoto_love +": {
      "from": 1,
      "to": 5
    },
    "makotowinterbeach4": {
      "from": null,
      "to": true
    },
    "makotobeachticket": {
      "from": null,
      "to": false
    }
  }
}