{
  "event_id": 249,
  "event_label": "mikuinvite1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I tap on Miku’s name in my phone and wait for her to answer."
    },
    {
      "character": "narrator",
      "text": "Now that things have calmed down for the time being, I feel that it’s finally safe for me to invite her over so we continue progressing our...{i}relationship{/i} in a much more private manner."
    },
    {
      "character": "narrator",
      "text": "Hopefully in a way that leads to me receiving some form of {i}fully-conscious{/i} satisfaction this time. Or, at the bare minimum, something more exciting than fingering her until she cries again."
    },
    {
      "character": "narrator",
      "text": "And while that’s cool and all, it would be nice to shake things up in a manner more intimate than letting her dry hump me in bed next to her friend."
    },
    {
      "character": "narrator",
      "text": "If she {i}wants{/i} to do that again, I’m not opposed. I should just probably get permission from Makoto first so I don’t have to go through another intervention."
    },
    {
      "character": "Miku",
      "text": "Hiyo, Sensei! What’cha up to?"
    },
    {
      "character": "Sensei",
      "text": "Oh, you know. Just letting my imagination run wild. You?"
    },
    {
      "character": "Miku",
      "text": "Just hangin’ with Makoto. Wanna say hi?"
    },
    {
      "character": "Sensei",
      "text": "Yeah. Put her on for a second."
    },
    {
      "character": "Miku",
      "text": "Roger that! Please hold. {i}Makoto! Your boyfriend wants to talk!{/i}"
    },
    {
      "character": "Makoto",
      "text": "{i}To me? Really? Why?{/i}"
    },
    {
      "character": "Miku",
      "text": "{i}Maybe to confess his undying love? Come find out!{/i}"
    },
    {
      "character": "Makoto",
      "text": "Uhh...hello?"
    },
    {
      "character": "Sensei",
      "text": "Hey. I was just wondering if I could have permission to bone your roommate."
    },
    {
      "character": "Makoto",
      "text": "{i}Here, Miku. You can have the phone back.{/i}"
    },
    {
      "character": "Miku",
      "text": "{i}Huh? Already? That was quick.{/i}"
    },
    {
      "character": "Miku",
      "text": "Sensei? Makoto looks friggin’ pissed. What did you say to her?"
    },
    {
      "character": "Sensei",
      "text": "Just something that needed to be said. Don’t worry about it. Anyway, do you want to come over?"
    },
    {
      "character": "Miku",
      "text": "Sure! When?"
    },
    {
      "character": "Sensei",
      "text": "Now."
    },
    {
      "character": "Miku",
      "text": "Like...{i}now{/i} now? "
    },
    {
      "character": "Sensei",
      "text": "Does that work for you?"
    },
    {
      "character": "Miku",
      "text": "I mean...I’ve gotta bring Makoto. We had plans and stuff."
    },
    {
      "character": "Sensei",
      "text": "Gotcha. Can you put her on again?"
    },
    {
      "character": "Miku",
      "text": "{i}Makoto! Round two!{/i}"
    },
    {
      "character": "Makoto",
      "text": "{i}Ugh! What now?{/i}"
    },
    {
      "character": "Makoto",
      "text": "Hello?"
    },
    {
      "character": "Sensei",
      "text": "How do you feel about threesomes?"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Are you seriously asking me that right now? Have you not already done enough?"
    },
    {
      "character": "Sensei",
      "text": "I just want to know more about you."
    },
    {
      "character": "Makoto",
      "text": "I think you know more than enough by now, thank you."
    },
    {
      "character": "Sensei",
      "text": "It would sure be swell if you were into them as much as I am."
    },
    {
      "character": "Makoto",
      "text": "{i}Take it back. I can’t handle this today.{/i}"
    },
    {
      "character": "Miku",
      "text": "Jeez, Sensei. You’re really strikin’ out today, aren’t ya?"
    },
    {
      "character": "Sensei",
      "text": "It unfortunately appears that way. I’ll get her to come around, though."
    },
    {
      "character": "Miku",
      "text": "Oh she’s come plenty of rounds if you know what I’m sayin’. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Get it? Cause you give her orgasms and stuff. "
    },
    {
      "character": "Sensei",
      "text": "Have I unlocked a new side of you?"
    },
    {
      "character": "Miku",
      "text": "Probably! I’ll start gettin’ ready and the two of us’ll drop by your house in like...an hour? That work?"
    },
    {
      "character": "Sensei",
      "text": "Sure. I hope Makoto is prepared. She seems a little confrontational today."
    },
    {
      "character": "Makoto",
      "text": "{i}Go to Hell! I can hear you!{/i}"
    },
    {
      "character": "Sensei",
      "text": "See?"
    },
    {
      "character": "Miku",
      "text": "Hahah! I’m sure she’ll be fine once we get there. But I’m gonna go shower and stuff, so...bye! See you soon!"
    },
    {
      "character": "narrator",
      "text": "Miku hangs up the phone and..."
    },
    {
      "character": "narrator",
      "text": "And I am left on my own to prepare for a threesome that will almost definitely not happen."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Heeeey. Haven’t been here in a hot minute. "
    },
    {
      "character": "Miku",
      "text": "You still lettin’ girls sneak into your room to ride your junk while you’re asleep?"
    },
    {
      "character": "Sensei",
      "text": "On occasion. Interesting choice of ice breaker, Miku."
    },
    {
      "character": "Miku",
      "text": "Yeah...I ain’t really used to this whole “boy house” thing after my sexual awakening. Not gonna lie. Feels kinda lewd."
    },
    {
      "character": "Makoto",
      "text": "I hate you."
    },
    {
      "character": "Sensei",
      "text": "So that’s a no to the threesome, huh?"
    },
    {
      "character": "Makoto",
      "text": "I hate you a lot."
    },
    {
      "character": "Miku",
      "text": "What’s this about a threesome?"
    },
    {
      "character": "Makoto",
      "text": "Miku. Don’t."
    },
    {
      "character": "Miku",
      "text": "I mean, I guess if I’m gonna have one, doin’ it with you would probably be best. I still don’t really know what I’m doin’, though. Ya might have to show me the ropes."
    },
    {
      "character": "Makoto",
      "text": "Look at what you’ve done to my sweet, innocent friend! She’s turning into my mom and I would literally die if I suddenly had two of them!"
    },
    {
      "character": "Sensei",
      "text": "There goes my secret dream of her ending up with Haruka."
    },
    {
      "character": "Sensei",
      "text": "Besides, I doubt it was {i}me{/i} who did this to her. This side of Miku has probably been buried deep down her entire life. Right, Miku?"
    },
    {
      "character": "Miku",
      "text": "Hm? Oh, no. This is your fault. I have seen the light."
    },
    {
      "character": "Makoto",
      "text": "Sensei!"
    },
    {
      "character": "Sensei",
      "text": "I did not mean for this to happen...but I am glad it did."
    },
    {
      "character": "Makoto",
      "text": "Yeah, until she starts running her mouth about it to everyone else! "
    },
    {
      "character": "Makoto",
      "text": "You know Miku’s attention span is...inadequate! It’s only a matter of time until she forgets this is something that’s meant to be kept {i}secret!{/i}"
    },
    {
      "character": "Sensei",
      "text": "That’s fair. Ami could have been home and listening in on this entire conversation. You’re lucky she’s not."
    },
    {
      "character": "Miku",
      "text": "If Ami was home, she woulda popped out of her room the second I talked about ridin’ your junk."
    },
    {
      "character": "Miku",
      "text": "Also, you guys ain’t givin’ me enough credit! I ain’t gonna go around blabbin’ about this to everybody! I‘m too young to die! "
    },
    {
      "character": "Makoto",
      "text": "Just..."
    },
    {
      "character": "Makoto",
      "text": "Listen, I get that you’re excited to be, umm...{i}learning about your body-{/i}"
    },
    {
      "character": "Miku",
      "text": "Oh, come on! Please don’t go into teacher mode in front of my friend-with-benefits. You’re gonna take all the benefits away."
    },
    {
      "character": "Makoto",
      "text": "...but, you need to be careful. This man is relentless. He will use you and cast you aside for someone else before you even know it."
    },
    {
      "character": "Sensei",
      "text": "Hi. Still here."
    },
    {
      "character": "Miku",
      "text": "Ain’t that a little hyper-critical? "
    },
    {
      "character": "Makoto",
      "text": "A little...{i}what?{/i}"
    },
    {
      "character": "Miku",
      "text": "Uhh..."
    },
    {
      "character": "Miku",
      "text": "Hippo...criminal?"
    },
    {
      "character": "Miku",
      "text": "No...I’m pretty sure “critical” is in there somewhere and..."
    },
    {
      "character": "Miku",
      "text": "A-hah! It’s hippie-critical, ain’t it?! Cause they were always sayin’ stuff that didn’t make much sense! See! I ain’t dumb!"
    },
    {
      "character": "Makoto",
      "text": "Is this really a creature you think you should be making sexual contact with?"
    },
    {
      "character": "Sensei",
      "text": "I may be currently rethinking my decision. That much I will admit."
    },
    {
      "character": "Makoto",
      "text": "{i}Regardless,{/i} the reason I accompanied Miku here instead of letting her run off alone was precisely so something like that would {i}not{/i} happen."
    },
    {
      "character": "Sensei",
      "text": "So, in other words, you were jealous."
    },
    {
      "character": "Makoto",
      "text": "That...may have played some role as well, I will admit. "
    },
    {
      "character": "Makoto",
      "text": "But the gist is that nothing like that will be happening today because we are {i}both{/i} here and singling out {i}one{/i} of us for...things...would be unfair."
    },
    {
      "character": "Sensei",
      "text": "So if I wanted to single out {i}you{/i} instead..."
    },
    {
      "character": "Makoto",
      "text": "Obviously, Miku would never agree to such-"
    },
    {
      "character": "Miku",
      "text": "I can wait out here. Feels like you need it more than me. Knock ‘im dead, Makoto. "
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "I...suppose letting you get it out of your system may be of {i}some{/i} benefit to us."
    },
    {
      "character": "Miku",
      "text": "I’m telling ya, Sensei. You’ve got a magic wiener. It’s the only explanation."
    },
    {
      "character": "Sensei",
      "text": "Listen, we don’t {i}need{/i} to do anything like that today if it will exclude one of you. I called Miku because I wanted to invite her over. Making her wait out here would be flat out rude."
    },
    {
      "character": "Makoto",
      "text": "As if being rude was ever an actual concern of yours..."
    },
    {
      "character": "Miku",
      "text": "If we ain’t gonna bump uglies, whaddya wanna do instead? Jump on Ami’s bed? Microwave stuff we ain’t supposed to microwave? Oooh, you got any games we could play?"
    },
    {
      "character": "Sensei",
      "text": "I have the 1999 PC classic, Rollercoaster Tycoon."
    },
    {
      "character": "Miku",
      "text": "I {i}love{/i} the 1999 PC classic, Rollercoaster Tycoon!"
    },
    {
      "character": "Makoto",
      "text": "Why are you guys saying it like that?"
    },
    {
      "character": "Miku",
      "text": "Where’d you get a copy? That’s a piece of vintage memorabilia, ya know."
    },
    {
      "character": "Sensei",
      "text": "Io found the time to drop it off between pretending to be a pharmacist and slinging you pills. "
    },
    {
      "character": "Makoto",
      "text": "Between {i}what?{/i}"
    },
    {
      "character": "Miku",
      "text": "{i}Shh!{/i}"
    },
    {
      "character": "Makoto",
      "text": "Miku, what-"
    },
    {
      "character": "Miku",
      "text": "Oh, Sensei! That’s a funny joke you just made! Anyway, time to go into your room and see what kind of stuff you’re hiding from us!"
    },
    {
      "character": "Miku",
      "text": "It’s this one, right? Hope you don’t mind me looking through your stuff!"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "I’m sorry, I think I misheard you. Something about...pills? And...Io pretending to be a pharmacist?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Sensei, if you know something-"
    },
    {
      "character": "Sensei",
      "text": "It was just a tasteless joke. It didn’t actually mean anything."
    },
    {
      "character": "Makoto",
      "text": "That just seems like such a random and uncalled for-"
    },
    {
      "character": "Sensei",
      "text": "Come on. Let’s go make sure Miku doesn’t find my secret porn stash and unlock an even dirtier section of her brain."
    },
    {
      "character": "Makoto",
      "text": "...Yeah."
    },
    {
      "character": "Makoto",
      "text": "Okay..."
    },
    {
      "character": "narrator",
      "text": "I wanted to tell Makoto."
    },
    {
      "character": "narrator",
      "text": "And in hindsight, I probably should have."
    },
    {
      "character": "narrator",
      "text": "But sometimes the “right” thing to do isn’t as easy as the other options. "
    },
    {
      "character": "narrator",
      "text": "And sometimes, in order to save someone, you must sacrifice something else."
    },
    {
      "character": "narrator",
      "text": "Besides, it’s quite possible she doesn’t need saving in the first place."
    },
    {
      "character": "narrator",
      "text": "It’s quite possible that whatever Io is doing will work for Miku...and that there’s no real risk involved at all."
    },
    {
      "character": "narrator",
      "text": "But..."
    },
    {
      "character": "narrator",
      "text": "If that were the case, Makoto would know."
    },
    {
      "character": "narrator",
      "text": "And the fact that she doesn’t tells me Miku’s hiding it from her on purpose."
    },
    {
      "character": "narrator",
      "text": "At what point is it okay to begin distributing information that doesn’t belong to you? And how can you package it up to make it seem like you’re doing it with good intentions?"
    },
    {
      "character": "narrator",
      "text": "In all actuality, it’s not about wanting to save anyone at all. It’s about wanting to maintain the status quo — where everything is peaceful and you can stick your dick inside of as many teenagers as you want."
    },
    {
      "character": "narrator",
      "text": "The disruption of that pattern would shake my world to the core when my world was built upon that principle. "
    },
    {
      "character": "narrator",
      "text": "It is not my place to put Miku in hers, and it is not Makoto’s place to raze both of them in an endless pursuit of what is right."
    },
    {
      "character": "narrator",
      "text": "The three of us will stay like this so we may one day stay as something else."
    },
    {
      "character": "narrator",
      "text": "Something close to what the real me wants."
    },
    {
      "character": "narrator",
      "text": "Not whoever I’m becoming."
    },
    {
      "character": "Miku",
      "text": "Sensei, why the heck do you even own Mario Kart if you’re so friggin’ bad at it?"
    },
    {
      "character": "Sensei",
      "text": "I didn’t even realize I had this."
    },
    {
      "character": "Makoto",
      "text": "I fucking hate Waluigi. Get out of my way, you piece of shit. I hope the fishing line snaps the next time they reel you up. Asshole."
    },
    {
      "character": "Miku",
      "text": "Need some help figurin’ out the controls? I’ve heard it can be pretty tough for people your age to just start playin’ games this late in life."
    },
    {
      "character": "Sensei",
      "text": "I’m only 31, Miku. I’m still well below the median age in the country."
    },
    {
      "character": "Miku",
      "text": "Yeah, but Japan’s got a bazillion old people. You’re still kinda prehistoric by our standards, ya know."
    },
    {
      "character": "Miku",
      "text": "Even if half the class is apparently into that sort of thing."
    },
    {
      "character": "Makoto",
      "text": "It isn’t half the class. It’s the entire class. Everyone is fighting for Sensei’s affection- even the ones who deny it."
    },
    {
      "character": "Makoto",
      "text": "WALUIGI, YOU LANKY CUCK! I WILL FUCKING MURDER YOU!"
    },
    {
      "character": "Sensei",
      "text": "I’ll be fine figuring out the controls. Just promise not to laugh at me when I come in last place."
    },
    {
      "character": "Miku",
      "text": "I ain’t gonna laugh at ya, Sensei. It’s still just a game at the end of the day and havin’ fun will always be the most important thing."
    },
    {
      "character": "Makoto",
      "text": "FUCK! YOU!"
    },
    {
      "character": "Miku",
      "text": "Even if we’ve got people like Makoto who have trouble turning the competitive part of their brain off."
    },
    {
      "character": "Sensei",
      "text": "You’d think Kumon-mi High’s greatest athlete would be the {i}more{/i} competitive one, wouldn’t you?"
    },
    {
      "character": "Miku",
      "text": "I ain’t that special. 'Specially now that soccer’s gone."
    },
    {
      "character": "Miku",
      "text": "Swimming’s fun, I guess. Just doesn’t feel the same, though. Ain’t no crazy adrenaline rush that comes from a breakaway or anythin’ like that."
    },
    {
      "character": "Sensei",
      "text": "It...could come back one day. Right?"
    },
    {
      "character": "Miku",
      "text": "Soccer? Doubt it. We ain’t got the numbers for it and there ain’t any reason to form the team back up without anybody to play."
    },
    {
      "character": "Miku",
      "text": "It’s fine, though. Just gives me more time to focus on other things. "
    },
    {
      "character": "Sensei",
      "text": "Other things...like what?"
    },
    {
      "character": "Miku",
      "text": "I wonder."
    },
    {
      "character": "Makoto",
      "text": "Hey. What do you think you’re doing? Public displays of affection are rude even {i}if{/i} you’re only displaying said affection in front of your best friend."
    },
    {
      "character": "Miku",
      "text": "Guess I’m rude, then. Cause I ain’t got any intention of movin’ any time soon."
    },
    {
      "character": "Miku",
      "text": "You know he’s got a second shoulder open, don’t ya? Why don’t you rest your head a little too? "
    },
    {
      "character": "Miku",
      "text": "Ain’t a threesome like Sensei wanted but it still lets all of us be close together. "
    },
    {
      "character": "Makoto",
      "text": "You’re going to lose the race with that sort of mindset, Miku."
    },
    {
      "character": "Miku",
      "text": "You sure it ain’t you who’s gonna run out of gas first? Always keepin’ the pedal to the metal and whatnot. Just stay steady and keep your eyes on the prize, Makoto."
    },
    {
      "character": "Makoto",
      "text": "Nice try, but there is no gas in Mario Kart."
    },
    {
      "character": "Miku",
      "text": "Who says I’m still talkin’ about Mario Kart?"
    },
    {
      "character": "Sensei",
      "text": "What are those boxes? Do they slow you down if you hit them?"
    },
    {
      "character": "Miku",
      "text": "They’ve got power-ups and stuff inside. You smash ‘em and use whatever you get to mess with the other people on the track. "
    },
    {
      "character": "Sensei",
      "text": "I see..."
    },
    {
      "character": "Miku",
      "text": "Do ya? Cause it seems to me like you’re just starin’ at Makoto now."
    },
    {
      "character": "Sensei",
      "text": "That’s a new dress, isn’t it?"
    },
    {
      "character": "Makoto",
      "text": "Took you long enough."
    },
    {
      "character": "Sensei",
      "text": "It looks great. You’re beautiful."
    },
    {
      "character": "Makoto",
      "text": "Wha- huh?! Me?! You...really think so?! "
    },
    {
      "character": "Makoto",
      "text": "I got a little jealous that Miku had one and I didn’t so-"
    },
    {
      "character": "Sensei",
      "text": "That was Makoto I just hit, wasn’t it?"
    },
    {
      "character": "Miku",
      "text": "Yuuuup. Great strategy, Sensei."
    },
    {
      "character": "Miku",
      "text": "Takin’ somebody out IRL so you can hit ‘em in-game is a real power move."
    },
    {
      "character": "Makoto",
      "text": "You...fucking asshole! You distracted me! I’ll get you back for this!"
    },
    {
      "character": "Miku",
      "text": "Not if I have anything to do with it."
    },
    {
      "character": "Makoto",
      "text": "Wha- you too?! {i}Both{/i} of you are ganging up on me now?! What did I do to deserve this?!"
    },
    {
      "character": "Miku",
      "text": "Drive, Sensei! Drive! Show us how much all those years of wisdom are really worth!"
    },
    {
      "character": "Sensei",
      "text": "I think I just fell off."
    },
    {
      "character": "Miku",
      "text": "Baby steps, Sensei. Baby steps."
    },
    {
      "character": "narrator",
      "text": "The three of us sit in my room playing the same game for the next two hours."
    },
    {
      "character": "narrator",
      "text": "Makoto eventually falls asleep on my arm, prompting Miku to take it upon herself to talk more about how “cute” the two of us look together."
    },
    {
      "character": "narrator",
      "text": "It’s strange to me how she can still say something like that with a smile on her face."
    },
    {
      "character": "narrator",
      "text": "I find it cute how genuine the love she has for her best friend is. And while something like that {i}should{/i} feel ideal for me as Miku doesn’t intend to pose any sort of threat..."
    },
    {
      "character": "narrator",
      "text": "All I can think of is that I really wish she would."
    },
    {
      "character": "narrator",
      "text": "And that she’d look better in my eyes if she would just pull me a little closer to her."
    },
    {
      "character": "narrator",
      "text": "{i}Miku’s affection has increased to [miku_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Makoto’s affection has increased to [makoto_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "mikuinvite1": {
      "from": null,
      "to": true
    },
    "makoto_love +": {
      "from": 3,
      "to": 1
    }
  }
}