{
  "event_id": 255,
  "event_label": "mikuinvite2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I tap on Miku’s name in my phone and wait for her to answer."
    },
    {
      "character": "narrator",
      "text": "And if there is any justice in this world, I will soon find out that she is alone and capable of coming over without the sentient purity ring that is Makoto Miyamura wrapped around her finger."
    },
    {
      "character": "narrator",
      "text": "Unless Makoto has flipped stances in regard to her feelings on threesomes overnight. If that is the case, I will gladly welcome the two of them once again."
    },
    {
      "character": "narrator",
      "text": "The thing is, the chemistry brewing between Miku and me is still a little volatile. It’s new and different...and so I can’t be condemned for my desire to experiment a little more."
    },
    {
      "character": "narrator",
      "text": "And experimentation is never fun when it’s being supervised."
    },
    {
      "character": "narrator",
      "text": "I am an adult, and if I want to prey upon the naiveté of a young girl in the comfort of my own home, I should be allowed to- actually, no. Makoto is right."
    },
    {
      "character": "narrator",
      "text": "But that changes nothing because Makoto is almost always right and I’ve dodged most major consequences thus far. Further debauchery will not slow me down."
    },
    {
      "character": "Miku",
      "text": "Heeeeeeeeeeeeeey..."
    },
    {
      "character": "Sensei",
      "text": "That’s a weird way to say hello."
    },
    {
      "character": "Miku",
      "text": "Too many e’s?"
    },
    {
      "character": "Sensei",
      "text": "A few. What are you doing right now?"
    },
    {
      "character": "Miku",
      "text": "Uhh..."
    },
    {
      "character": "Miku",
      "text": "Would it be weird to say I’ve been waiting for you to invite me over?"
    },
    {
      "character": "Sensei",
      "text": "As in...you’re just sitting in your dorm room and waiting for me to give you the go ahead to come to my house?"
    },
    {
      "character": "Miku",
      "text": "I was also watchin’ TV and stuff, but yeah. "
    },
    {
      "character": "Sensei",
      "text": "That is kind of weird, I won’t lie."
    },
    {
      "character": "Miku",
      "text": "Well I’m kinda...you know. And Makoto’s at work right now, so..."
    },
    {
      "character": "Sensei",
      "text": "You realize you can call me as well, right? You don’t have to wait for me to give you the signal if there is sex involved."
    },
    {
      "character": "Miku",
      "text": "Ain’t that...exactly {i}when{/i} I’m supposed to wait for the signal? Don’t think it’s safe to just show up at your door and ask you to take my skirt off."
    },
    {
      "character": "Sensei",
      "text": "It is. Just make sure Ami’s not home."
    },
    {
      "character": "Miku",
      "text": "You’re playin’ a dangerous game, Sensei. I might wind up movin’ in if you go and tell me stuff like that."
    },
    {
      "character": "Sensei",
      "text": "I take it that means you’re coming over?"
    },
    {
      "character": "Miku",
      "text": "Heh. Coming."
    },
    {
      "character": "Sensei",
      "text": "Okay, if you really {i}are{/i} turning into Maki, you should try and suppress it so we can keep Makoto alive."
    },
    {
      "character": "Miku",
      "text": "The only thing {i}I’ll{/i} be suppressing is your giant boner."
    },
    {
      "character": "Sensei",
      "text": "I don’t think you understand what the meaning of “suppressing” is."
    },
    {
      "character": "Miku",
      "text": "Yeah, there’s a lot I don’t understand. But what I {i}do{/i} understand is that I’m feelin’ some kinda way and you’re the only person who knows how to do anything about it!"
    },
    {
      "character": "Sensei",
      "text": "I guess I’ll...see you soon then. "
    },
    {
      "character": "Miku",
      "text": "I guess you will..."
    },
    {
      "character": "narrator",
      "text": "I hang up the phone and marvel at the fact that Miku has gone from a girl with almost no sexual feelings whatsoever to one who sits around her dorm room and waits for me to invite her over."
    },
    {
      "character": "narrator",
      "text": "I guess that’s just the process for these girls, though. "
    },
    {
      "character": "narrator",
      "text": "And while I can paraphrase that to make it sound like I’m just helping them {i}learn more about themselves{/i} or whatever way you want to spin it that could justify what’s about to happen...I won’t."
    },
    {
      "character": "narrator",
      "text": "Right now, a high school freshman is on her way to my house because I am going to do things to her. And {i}she{/i} is going to do things to me."
    },
    {
      "character": "narrator",
      "text": "This is happening because I let it."
    },
    {
      "character": "narrator",
      "text": "And there is no way you can word it that makes it okay."
    },
    {
      "character": "narrator",
      "text": "Please."
    },
    {
      "character": "narrator",
      "text": "Stop watching me."
    },
    {
      "character": "Miku",
      "text": "Heeeeeeeeeey..."
    },
    {
      "character": "Sensei",
      "text": "Too many e’s again."
    },
    {
      "character": "Miku",
      "text": "Sorry if I took a little longer than you expected. I wanted to run but I didn’t wanna get all sweaty if we were gonna...you know. "
    },
    {
      "character": "Sensei",
      "text": "You know, I’ve turned a lot of girls on during my time here in Kumon-mi, but I think this might be the first time any of them have thought about literally running to me because of it."
    },
    {
      "character": "Miku",
      "text": "Something something...new Miku...something?"
    },
    {
      "character": "Sensei",
      "text": "You have such a way with words sometimes."
    },
    {
      "character": "Miku",
      "text": "And you’ve got such a way with...your...fingers?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Can you do the thing again?"
    },
    {
      "character": "Sensei",
      "text": "You literally just got here. We’re not even in the bedroom yet."
    },
    {
      "character": "Miku",
      "text": "We’re doing it in the bedroom?!"
    },
    {
      "character": "Sensei",
      "text": "Did you expect me to finger you on my kitchen table?"
    },
    {
      "character": "Miku",
      "text": "I...wouldn’t be against it."
    },
    {
      "character": "Sensei",
      "text": "Is there something wrong with my bedroom, Miku?"
    },
    {
      "character": "Miku",
      "text": "No! It’s just...you know. It feels more serious that way. And I still ain’t ready to, like...go all the way just yet. So I didn’t wanna make it feel like that’s what I was bankin’ on."
    },
    {
      "character": "Sensei",
      "text": "So you’re horny enough to almost run to my house to get fingered, but not horny enough to have sex with me?"
    },
    {
      "character": "Miku",
      "text": "I don’t think the horny part’s the problem. The problem’s that I’m half your size and kinda sensitive down there. I ain’t really interested in gettin’ split in half just yet."
    },
    {
      "character": "Sensei",
      "text": "That’s fine. I won’t rush you if that’s what you’re worried about. It’d be nice to have {i}something{/i} done for me eventually, though."
    },
    {
      "character": "Miku",
      "text": "Like what?"
    },
    {
      "character": "Miku",
      "text": "You want me to try puttin’ my fingers inside of you next?"
    },
    {
      "character": "Sensei",
      "text": "Don’t even joke about that."
    },
    {
      "character": "Miku",
      "text": "I ain’t jokin’. I’ve heard Maki say that kinda thing’s totally normal."
    },
    {
      "character": "Sensei",
      "text": "That is not the scene I want to happen right now."
    },
    {
      "character": "Miku",
      "text": "Well, what {i}do{/i} you want? Cause I might be horny as heck, but I still know that fair is fair and I’m the only one who’s gotten some so far."
    },
    {
      "character": "Sensei",
      "text": "Do you want to talk more about that in my bedroom?"
    },
    {
      "character": "Miku",
      "text": "You and that heckin’ bedroom, man. Whaddya got against the kitchen table?"
    },
    {
      "character": "Sensei",
      "text": "For starters, the fact that I eat off of it."
    },
    {
      "character": "Miku",
      "text": "And I eat off of my bed but ya don’t see me makin’ ya finger me on the floor."
    },
    {
      "character": "Sensei",
      "text": "Why are you eating off of your bed?"
    },
    {
      "character": "Miku",
      "text": "It just happens sometimes, okay? But I ain’t here to talk about food- I’m here to do sexy stuff with my teacher. And if that kinda stuff {i}has{/i} to happen in your room, then...fine."
    },
    {
      "character": "Miku",
      "text": "But I really ain’t ready to go all the way yet. For real. I need more...practice first."
    },
    {
      "character": "Sensei",
      "text": "I’m sure we can figure something out..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Miku entangles her arm with mine and I wind up walking her into my room like I’m some sort of escort. Or...{i}she’s{/i} some kind of escort. "
    },
    {
      "character": "narrator",
      "text": "I don’t know. I’ve never needed to resort to that before. But I’m sure this is how things would look if one of us was an escort."
    },
    {
      "character": "narrator",
      "text": "Despite her clear nervousness, she puts on a smile — likely because she still thinks she’s about to be fingered until my bedsheets are a soaking mess. But that is not the case."
    },
    {
      "character": "narrator",
      "text": "Or...at least it’s not the case {i}yet.{/i} "
    },
    {
      "character": "narrator",
      "text": "We’ll get there later, I’m sure. But for now, I really would like to capitalize on her ability to recognize when {i}fair is fair.{/i}"
    },
    {
      "character": "Sensei",
      "text": "So..."
    },
    {
      "character": "Miku",
      "text": "Soooo..."
    },
    {
      "character": "Sensei",
      "text": "You ready to try something a little different?"
    },
    {
      "character": "Miku",
      "text": "Mhm..."
    },
    {
      "character": "Miku",
      "text": "You’ll take it easy on me, right? I obviously wanna do somethin’ for {i}you{/i} when you’ve helped me a bunch of times, but I still ain’t really sure what’s goin’ on just yet."
    },
    {
      "character": "Sensei",
      "text": "Thankfully, we’re in a good environment for me to teach you."
    },
    {
      "character": "Miku",
      "text": "Teach?! Was this just a trap all along?! Did Makoto put you up to this?!"
    },
    {
      "character": "Sensei",
      "text": "Wow. You don’t even understand context, do you?"
    },
    {
      "character": "Miku",
      "text": "Oh. You mean {i}sex-{/i}teach. My bad. My brain sucks even more when I’m nervous and it gets harder for me to understand stuff right away."
    },
    {
      "character": "Miku",
      "text": "But yes. Please teach me. I can’t promise I’ll be any good at what you want, but I’ll do my best."
    },
    {
      "character": "Sensei",
      "text": "Good. Because there’s a reward in store for you when you succeed."
    },
    {
      "character": "Miku",
      "text": "Thank friggin’ God because I’ve been tryin’ to do it myself all day and it just ain’t the same."
    },
    {
      "character": "Miku",
      "text": "So, what’s on the menu? What can your old pal Miku do for ya this fine evening?"
    },
    {
      "character": "Sensei",
      "text": "You can start by not referring to yourself as my “old pal” right before we make sexual contact."
    },
    {
      "character": "Miku",
      "text": "Are we not friends anymore? I ain’t your girlfriend, am I?"
    },
    {
      "character": "Sensei",
      "text": "That’s not what I- you know what? Forget it. Kneel down by the foot of the bed. "
    },
    {
      "character": "Miku",
      "text": "Should I take my clothes off? "
    },
    {
      "character": "Sensei",
      "text": "Stay the way you are now, actually..."
    },
    {
      "character": "Sensei",
      "text": "I like that dress."
    },
    {
      "character": "Sensei",
      "text": "I want to ruin it."
    },
    {
      "character": "Miku",
      "text": "Whaaat? No! I like this dress. It’s the only thing that makes me feel girly."
    },
    {
      "character": "Sensei",
      "text": "That’s precisely why I want you to keep it on. "
    },
    {
      "character": "Sensei",
      "text": "You’re cute dressed like that. Well, you’re cute always. But there’s something particularly alluring about the prospect of you sucking me off while you’re dressed that way."
    },
    {
      "character": "Miku",
      "text": "...Okay."
    },
    {
      "character": "Miku",
      "text": "Just...remember. Take it easy on me, please. "
    },
    {
      "character": "Miku",
      "text": "I’m still really nervous..."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Miku crouches down at the foot of the bed like I asked and waits patiently as I get into position in front of her."
    },
    {
      "character": "narrator",
      "text": "I gesture her to slide forward, gently grabbing the back of her head and angling her closer to my dick, hoping she’ll take the initiative required to remove it from the fleeting residence that is my pants."
    },
    {
      "character": "narrator",
      "text": "Instead of doing anything, however, she simply looks up at me with a sense of...childish innocence in her eyes that does nothing but make me want to paint her face white with my seed."
    },
    {
      "character": "narrator",
      "text": "Keep looking at me like that."
    },
    {
      "character": "narrator",
      "text": "Your purity gets me harder than anything."
    },
    {
      "character": "Miku",
      "text": "So...do I take it out? Or do you do it? I ain’t all that familiar with blowjob etiquette."
    },
    {
      "character": "Sensei",
      "text": "You can do it. I want to pay close attention to how you look after seeing it for the first time."
    },
    {
      "character": "Miku",
      "text": "Yeah...I guess I {i}haven’t{/i} seen it yet, have I? Closest I came was that one Halloween that landed the two of us in hot water."
    },
    {
      "character": "Sensei",
      "text": "Do you still have that costume?"
    },
    {
      "character": "Miku",
      "text": "Why do you ask?..."
    },
    {
      "character": "Sensei",
      "text": "You might suck at context, but I’m pretty sure that even you can understand that."
    },
    {
      "character": "Miku",
      "text": "Remind me to bring it the next time I come over..."
    },
    {
      "character": "Miku",
      "text": "But, for now..."
    },
    {
      "character": "Miku",
      "text": "Hoooooooly shit, it looks even bigger than it felt. And it felt like I was ridin’ a fallen redwood. "
    },
    {
      "character": "Sensei",
      "text": "Your fear about being split in half is perfectly reasonable and I will not hold that against you."
    },
    {
      "character": "Miku",
      "text": "Sensei, this is bigger than my head. How do you even stay conscious when this thing gets hard?"
    },
    {
      "character": "Sensei",
      "text": "Probably willpower."
    },
    {
      "character": "Miku",
      "text": "How the utter heck did Makoto and Kirin ever get this thing inside them? They ain’t even that much bigger than me."
    },
    {
      "character": "Sensei",
      "text": "What? Since when do you know about Kirin?"
    },
    {
      "character": "Miku",
      "text": "I haven’t known for long. She told me during beachmas."
    },
    {
      "character": "Sensei",
      "text": "{i}Why{/i} did she tell you during “beachmas?”"
    },
    {
      "character": "Miku",
      "text": "Because...I may have accidentally spilled the beans that you finger me sometimes?"
    },
    {
      "character": "Sensei",
      "text": "Miku-"
    },
    {
      "character": "Miku",
      "text": "I’ll be more careful in the future, I swear! I was just excited to talk about it since I like you so much!"
    },
    {
      "character": "Sensei",
      "text": "Ugh, great. I obviously can’t stay mad when you go and say things like that."
    },
    {
      "character": "Miku",
      "text": "I totally get it, Sensei. All the worries in the world start goin’ away the second you get to spend time with somebody like this, right?"
    },
    {
      "character": "Miku",
      "text": "And it only gets better once they start touchin’ you."
    },
    {
      "character": "Miku",
      "text": "Feels kinda like the world is gettin’ flipped on its head, doesn’t it?"
    },
    {
      "character": "Miku",
      "text": "And even if I ain’t ready to go as far as Makoto and Kirin did, I still wanna help you feel good after all the times you helped {i}me.{/i}"
    },
    {
      "character": "Miku",
      "text": "Just...maybe don’t compare me to either of them until I have a little more experience, okay? "
    },
    {
      "character": "Sensei",
      "text": "You’ll need a lot of practice...they have a pretty big lead, you know."
    },
    {
      "character": "Miku",
      "text": "Oh, we can practice whenever you want..."
    },
    {
      "character": "Miku",
      "text": "Itadakimasu."
    },
    {
      "character": "Miku",
      "text": "Mm......mnch........mn~"
    },
    {
      "character": "narrator",
      "text": "Miku drags the tip of her tongue across the head of my cock, stimulating the most sensitive area on my body with a surprising amount of delicacy and care."
    },
    {
      "character": "narrator",
      "text": "Given the type of person she is, I figured she’d approach this a little more...relentlessly. But she starts off extremely slow and sensual and...honestly, it’s insanely hot."
    },
    {
      "character": "Miku",
      "text": "Hmn...mmngh......hmnm..."
    },
    {
      "character": "Miku",
      "text": "Mngh...mm...am I doing okay so far?...Are you close to finishing?..."
    },
    {
      "character": "Sensei",
      "text": "We’ve only been doing this for like five seconds."
    },
    {
      "character": "Miku",
      "text": "That’s all it takes for me sometimes. I don’t know how penises work. This is my first time ever handling one."
    },
    {
      "character": "Sensei",
      "text": "It’ll take a little while longer. Bear with me, please."
    },
    {
      "character": "Miku",
      "text": "Don’t say stuff like “Bear with me, please.” It makes it sound like I’m just putting up with this because I {i}have{/i} to, not because I {i}want{/i} to."
    },
    {
      "character": "Miku",
      "text": "I like this part of you, Sensei...I want to make it feel good."
    },
    {
      "character": "narrator",
      "text": "Miku...begins rubbing her cheek against my cock?"
    },
    {
      "character": "narrator",
      "text": "She’s like a cat brushing up against its owner to try and coax it into petting her and, while that might not {i}sound{/i} very sexual, it’s that exact brand of innocence that drives me insane at times."
    },
    {
      "character": "Miku",
      "text": "It’s really warm...is it always like that?"
    },
    {
      "character": "Sensei",
      "text": "Your face is just as warm, I’m sure..."
    },
    {
      "character": "Miku",
      "text": "Sensei...can I tell you a secret?"
    },
    {
      "character": "Sensei",
      "text": "Now?"
    },
    {
      "character": "Miku",
      "text": "It’s not a random one. It’s related to what we’re doing."
    },
    {
      "character": "Sensei",
      "text": "Sure...Go ahead."
    },
    {
      "character": "Miku",
      "text": "It kind of...{i}excites{/i} me...how this has been in some of my friends."
    },
    {
      "character": "Sensei",
      "text": "It...does? I feel like most people would have the opposite reaction to information like that."
    },
    {
      "character": "Miku",
      "text": "Amf...guess I’m just...special?..."
    },
    {
      "character": "Sensei",
      "text": "Do you...like girls as well or something?"
    },
    {
      "character": "Miku",
      "text": "Mmf...mm...no...it’s not that..."
    },
    {
      "character": "Miku",
      "text": "It just...mmf...feels kinda like I’m...amf...winning right now..."
    },
    {
      "character": "Miku",
      "text": "It’s fun...beating out the competition...makes me feel like...mnngh...I’m doing somethin’ right..."
    },
    {
      "character": "Sensei",
      "text": "You’re...definitely doing something right. I’ll admit that much."
    },
    {
      "character": "Miku",
      "text": "Yeah?..."
    },
    {
      "character": "Miku",
      "text": "You like it when I lick you like this?..."
    },
    {
      "character": "Miku",
      "text": "You don’t mind me goin' really slow?..."
    },
    {
      "character": "Sensei",
      "text": "You can do whatever you want so long as you keep looking like that..."
    },
    {
      "character": "Miku",
      "text": "Like what?..."
    },
    {
      "character": "Sensei",
      "text": "I don’t know...adorable?..."
    },
    {
      "character": "Miku",
      "text": "Girly?..."
    },
    {
      "character": "Sensei",
      "text": "That too..."
    },
    {
      "character": "Miku",
      "text": "Mmf...mmm...is it just...the dress making you say that?..."
    },
    {
      "character": "Sensei",
      "text": "It’s a lot of things...but, for one, I didn’t imagine you’d be this delicate."
    },
    {
      "character": "Miku",
      "text": "And I...amf...didn’t imagine your wiener would be the size of my head..."
    },
    {
      "character": "Miku",
      "text": "I’ve gotta move like this or I’ll wind up suffocatin’."
    },
    {
      "character": "Sensei",
      "text": "Can I make a request? Please don’t call it a “wiener” when we’re doing things like this?"
    },
    {
      "character": "Miku",
      "text": "Roger..."
    },
    {
      "character": "Miku",
      "text": "Your “not old pal” Miku will take real good care of your huge cock...don’t you worry..."
    },
    {
      "character": "Sensei",
      "text": "That’s no better than just saying “old pal...”"
    },
    {
      "character": "Miku",
      "text": "Champion of Justice and Soccer, Miku Maruyama, will take good care of your huge cock...don’t you worry..."
    },
    {
      "character": "Sensei",
      "text": "Maybe...less talking in general would be-"
    },
    {
      "character": "Miku",
      "text": "Chu~"
    },
    {
      "character": "Miku",
      "text": "Chu....chu.....chu..."
    },
    {
      "character": "narrator",
      "text": "Miku gives up on licking me for a moment and begins to shower me in soft kisses, each lasting no more than half a second. "
    },
    {
      "character": "narrator",
      "text": "And despite these motions not being all that conventional in terms of bringing me to climax given that she’s no longer stroking me as well, I shouldn’t be feeling even {i}half{/i} as good as I actually am right now."
    },
    {
      "character": "narrator",
      "text": "Yet...each time her lips connect with my cock, I feel like I’m holding myself back from pulling her forward and cumming down the back of her throat."
    },
    {
      "character": "Miku",
      "text": "Chu.....chu......you look really cute right now..."
    },
    {
      "character": "Sensei",
      "text": "Me? You’re the one who looks cute..."
    },
    {
      "character": "Miku",
      "text": "Mm-mm...you look cute too..."
    },
    {
      "character": "Miku",
      "text": "Can I tell you another secret?"
    },
    {
      "character": "Sensei",
      "text": "Only if it’s as good as the last one..."
    },
    {
      "character": "Miku",
      "text": "I’m not wearing underwear today......chu~"
    },
    {
      "character": "Sensei",
      "text": "So you’re an exhibitionist now?"
    },
    {
      "character": "Miku",
      "text": "Chu.......a what?"
    },
    {
      "character": "Sensei",
      "text": "Don’t worry about it. Just keep doing what you’re doing."
    },
    {
      "character": "Miku",
      "text": "Can I tell you one more?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "I can’t wait until you finger me...I’m kind of in Hell right now.......chu~"
    },
    {
      "character": "Sensei",
      "text": "Yeah, well...you won’t be there for much longer at this rate..."
    },
    {
      "character": "Miku",
      "text": "Mmf...mmmngh...this ain’t as...hard as I thought it’d be..."
    },
    {
      "character": "Miku",
      "text": "Is Miku Maruyama...actually a blowjob champion?..."
    },
    {
      "character": "Sensei",
      "text": "Not without actually putting it in your mouth first..."
    },
    {
      "character": "Miku",
      "text": "I don’t think I even have to...my original gameplan seems to be goin’ pretty well..."
    },
    {
      "character": "Sensei",
      "text": "It wouldn’t hurt..."
    },
    {
      "character": "Miku",
      "text": "But if it’s in my mouth, I can’t keep kissing you."
    },
    {
      "character": "Sensei",
      "text": "Miku..."
    },
    {
      "character": "Miku",
      "text": "The tip’s the most sensitive part, right? Won’t you still cum if I just continue like this?"
    },
    {
      "character": "Sensei",
      "text": "That’s not the-"
    },
    {
      "character": "Miku",
      "text": "Sensei...can I tell you another secret?"
    },
    {
      "character": "Sensei",
      "text": "...Go ahead."
    },
    {
      "character": "Miku",
      "text": "Then..."
    },
    {
      "character": "Miku",
      "text": "I want you to cum on my face..."
    },
    {
      "character": "Sensei",
      "text": "Wow. That’s a line I didn’t think I’d ever hear from you."
    },
    {
      "character": "Miku",
      "text": "I think I’m a slut now."
    },
    {
      "character": "Sensei",
      "text": "I don’t think that’s how being a slut works, Miku."
    },
    {
      "character": "Miku",
      "text": "I don’t know. Kirin’s a slut and the only boy she’s ever done anything with is you."
    },
    {
      "character": "Sensei",
      "text": "I don’t think it’s fair to put yourself on the level of Kirin just yet."
    },
    {
      "character": "Miku",
      "text": "Does she do this too?"
    },
    {
      "character": "Sensei",
      "text": "She might..."
    },
    {
      "character": "Miku",
      "text": "Is she good?"
    },
    {
      "character": "Sensei",
      "text": "Do you want the honest answer or the one that will make you happy?"
    },
    {
      "character": "Miku",
      "text": "Aw, man...she’s {i}really{/i} good, isn’t she? "
    },
    {
      "character": "Sensei",
      "text": "Probably the best I’ve ever had since honesty seems to be the route you want to go down."
    },
    {
      "character": "Miku",
      "text": "Darn it. And here I was thinkin’ I could beat her at this too. Gettin’ too cocky on my first time, I guess."
    },
    {
      "character": "Miku",
      "text": "Heh. C-"
    },
    {
      "character": "Sensei",
      "text": "Don’t do it, Maki. Remember Makoto."
    },
    {
      "character": "Miku",
      "text": "How good is {i}Makoto{/i} at this stuff? "
    },
    {
      "character": "Sensei",
      "text": "Focus less on your friends and more on me. I was about to finish just a few seconds ago and am now beginning to-"
    },
    {
      "character": "Miku",
      "text": "Amf...mm...mngh...mnch...hngh...mmm!"
    },
    {
      "character": "Sensei",
      "text": "Well, that was easy..."
    },
    {
      "character": "Miku",
      "text": "The sooner you...finish...the sooner...{i}I{/i} get to feel good...and I...mmf...can’t wait any longer..."
    },
    {
      "character": "Miku",
      "text": "I’ve been going crazy all day...I want you to play with me...I want you...I want you..."
    },
    {
      "character": "Sensei",
      "text": "Look at me..."
    },
    {
      "character": "Sensei",
      "text": "And keep saying that..."
    },
    {
      "character": "Miku",
      "text": "I want you..."
    },
    {
      "character": "Miku",
      "text": "I {i}want{/i} you..."
    },
    {
      "character": "Miku",
      "text": "{i}I want you...{/i}"
    },
    {
      "character": "Miku",
      "text": "Mmm!"
    },
    {
      "character": "narrator",
      "text": "The steady pace of Miku’s handjob-slash-licking combo meshed with a three word sentence that does {i}not{/i} pain me to hear winds up forcing an aggressive orgasm out of me."
    },
    {
      "character": "narrator",
      "text": "She stares down at my cock as she carefully empties it out, squeezing every last drop onto her face and tongue, clearly unsure of how long this typically goes on for."
    },
    {
      "character": "narrator",
      "text": "Fortunately for her, the duration of the male orgasm is not particularly long and her wish of having me ejaculate on her face is granted just a minute or two after its initial proclamation."
    },
    {
      "character": "narrator",
      "text": "There’s no fanfare or immature Miku-esque commentary to accompany it either — just a smug smile from a girl who knows she did a good job."
    },
    {
      "character": "Miku",
      "text": "Senseiiiii..."
    },
    {
      "character": "narrator",
      "text": "And a girl who desperately wants me to finger her."
    },
    {
      "character": "Sensei",
      "text": "Lie down."
    },
    {
      "character": "Miku",
      "text": "Do ya have a towel or somethin’? Shouldn’t I wipe my face off first?"
    },
    {
      "character": "Sensei",
      "text": "I told you to lie down."
    },
    {
      "character": "Miku",
      "text": "I get that, but- ahh! What are you doin’?!"
    },
    {
      "character": "narrator",
      "text": "I lift Miku up myself and toss her onto the bed."
    },
    {
      "character": "narrator",
      "text": "I hike up her skirt."
    },
    {
      "character": "narrator",
      "text": "And I finger her so violently that she destroys my mattress. "
    },
    {
      "character": "narrator",
      "text": "{i}Miku’s lust has increased to [miku_lust]!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}You can now invite her over whenever you want!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "miku_lust +": {
      "from": null,
      "to": 3
    },
    "mikuinvite2": {
      "from": null,
      "to": true
    }
  }
}