{
  "event_id": 265,
  "event_label": "mollyinvite2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "I tap on Molly’s name in my phone and wait for her to answer. But I don’t intend to partake in any sort of character building this time around."
    },
    {
      "character": "narrator",
      "text": "Unless that character is her vagina and I am building it with my penis."
    },
    {
      "character": "narrator",
      "text": "That probably didn’t make as much sense as I wanted it to, but you get the point."
    },
    {
      "character": "Molly",
      "text": "Hello?"
    },
    {
      "character": "narrator",
      "text": "And so will Molly soon if by “point” we mean “penis.”"
    },
    {
      "character": "narrator",
      "text": "That one worked a little better."
    },
    {
      "character": "Sensei",
      "text": "Hey, Molly. What’s-"
    },
    {
      "character": "Molly",
      "text": "Ah! Excellent timing, Sir! I was just thinking about you."
    },
    {
      "character": "Sensei",
      "text": "I bet it was sexual."
    },
    {
      "character": "Molly",
      "text": "Not this time! Though, I will admit that {i}has{/i} become somewhat of a regular occurrence for me as of late."
    },
    {
      "character": "Molly",
      "text": "Well...maybe not so much “late” as it is...from the moment we first met. But surely that’s not why you called today!"
    },
    {
      "character": "Sensei",
      "text": "It kind of is, actually."
    },
    {
      "character": "Molly",
      "text": "Oh."
    },
    {
      "character": "Sensei",
      "text": "Yeah. I think you should come over. And then I think you should take your pants off. And then I think I should take my pants off too."
    },
    {
      "character": "Molly",
      "text": "This sudden influx of lustful affection is turning the somewhat sentimental mental anecdote I had in mind into a puddle of relatively tangible desire between mine legs. Quest accepted, Sir!"
    },
    {
      "character": "Molly",
      "text": "Though, I would appreciate it if I could at least {i}mention{/i} the non-sexual thing I had in mind."
    },
    {
      "character": "Sensei",
      "text": "I’ll think about it and come up with an answer based on your performance today."
    },
    {
      "character": "Molly",
      "text": "I’m going to be graded?!"
    },
    {
      "character": "narrator",
      "text": "I hang up the phone and figure it’ll be easier to iron out all of the important details over text."
    },
    {
      "character": "narrator",
      "text": "That {i}and{/i} it makes it easier to avoid whatever brand of Molly-coded “sentimentality” she wants to bring to the table."
    },
    {
      "character": "narrator",
      "text": "For too long, I have let “feelings” cloud the space between the two of us. But as this life (If you could even call it that) becomes increasingly less coherent, I become increasingly impatient."
    },
    {
      "character": "narrator",
      "text": "And I really {i}do{/i} think it would be best to just “break her” once and for all. Like she wants me to. Like she dreams of — {i}without{/i} the caveat of needing to fix me first."
    },
    {
      "character": "narrator",
      "text": "Assuming she cares much about that at all, of course. She might not. I haven’t put forth that much effort when it comes to “fixing” her."
    },
    {
      "character": "narrator",
      "text": "That said, though...I can’t find much about her that {i}requires{/i} fixing in the first place."
    },
    {
      "character": "narrator",
      "text": "She’s weird, yeah. But she’s also..."
    },
    {
      "character": "narrator",
      "text": "Molly."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "And I think that’s what I need right now."
    },
    {
      "character": "narrator",
      "text": "The doorbell rings."
    },
    {
      "character": "narrator",
      "text": "Outside awaits one more mistake."
    },
    {
      "character": "Sensei",
      "text": "It’s open..."
    },
    {
      "character": "Molly",
      "text": "Aye! It surely is, Sir. But I do hope it will remain locked from this point on if your cum meter is as full as you made it sound."
    },
    {
      "character": "Sensei",
      "text": "My...what?"
    },
    {
      "character": "Molly",
      "text": "Your cum meter, Sir! The white bar in the bottom right hand corner of your screen that slowly fills up over time and needs to be emptied by a sexual partner or masturbation. Don’t all men have one of those?"
    },
    {
      "character": "Sensei",
      "text": "You play too many games, Molly."
    },
    {
      "character": "Molly",
      "text": "And you {i}don’t,{/i} Sir! But that changes today!"
    },
    {
      "character": "Molly",
      "text": "Because the one and only Molly MacCormack has devised a plot that will aid both your cum meter {i}and{/i} the crippling depression that has turned you into a boring normie!"
    },
    {
      "character": "Sensei",
      "text": "Normally, this is the part where I’d talk about how draining my cum meter is the exact sort of thing that {i}would{/i} help with that second part. But sure, let’s hear what you came up with."
    },
    {
      "character": "Molly",
      "text": "In this bag, I possess a laptop with so many porn games from so many genres that Jesus Christ would cast me to Hell the moment he stepped within one hundred miles of it. And today, Sir?"
    },
    {
      "character": "Molly",
      "text": "We are going to play them {i}all.{/i}"
    },
    {
      "character": "Sensei",
      "text": "{i}All{/i} of them?"
    },
    {
      "character": "Molly",
      "text": "No, that was a lie. Deception check failed. Playing all of them would take years."
    },
    {
      "character": "Molly",
      "text": "But we {i}will{/i} play some of them. At least one. We {i}have{/i} to."
    },
    {
      "character": "Sensei",
      "text": "Sorry, we {i}have{/i} to? We can’t just skip all that and cut straight to the good part?"
    },
    {
      "character": "Molly",
      "text": "Sir, the buildup {i}is{/i} the good part. It’s what makes it possible for people to sit through hundreds of hours of content in pursuit of sex with their favorite character. It’s why visual novels are so successful."
    },
    {
      "character": "Sensei",
      "text": "That just sounds like needless padding to me."
    },
    {
      "character": "Molly",
      "text": "And surely sometimes it is! But others? It’s what makes everything seem so {i}real!{/i}"
    },
    {
      "character": "Sensei",
      "text": "So...you play games to escape from reality...but you want your fake reality to feel like...actual reality?"
    },
    {
      "character": "Molly",
      "text": "Not all the time. Sometimes, you just want to get raped by an orc. Or have your cum meter drained by some sort of spider monster that latches onto your penis without consent."
    },
    {
      "character": "Sensei",
      "text": "One of those felt weirdly relatable to me."
    },
    {
      "character": "Molly",
      "text": "That’s quite disturbing, Sir. Would you like to talk about it before I’ve reached the height of my arousal?"
    },
    {
      "character": "Sensei",
      "text": "Nope. Let’s go."
    },
    {
      "character": "Molly",
      "text": "Aye, Sir! Let’s! Are we- oh! Shoes. Sorry. Mildly nervous. But also excited!"
    },
    {
      "character": "Molly",
      "text": "Having an actual human to experiment with now is truly a game changer, Sir!"
    },
    {
      "character": "narrator",
      "text": "Yeah..."
    },
    {
      "character": "narrator",
      "text": "We’re just experimenting."
    },
    {
      "character": "narrator",
      "text": "All I’m doing is helping some weird, horny teen purge the pent-up lust from her system in an environment that doesn’t mask itself as a safe one."
    },
    {
      "character": "narrator",
      "text": "She can’t be {i}put{/i} in harm’s way if she wanders into it on her own. And, in Molly’s terms, what she’s doing right now is probably akin to, like...venturing into the den of a dragon or something like that."
    },
    {
      "character": "narrator",
      "text": "But she’s an adventurer. Or a traveler. Or whatever she calls herself."
    },
    {
      "character": "narrator",
      "text": "She feels like it’s her duty to conquer me. But she doesn’t realize she’s not strong enough yet, so it’ll have to be a learning experience."
    },
    {
      "character": "narrator",
      "text": "I’ll let her practice as much as she needs. I’ll let {i}anyone{/i} practice as much as they need."
    },
    {
      "character": "narrator",
      "text": "I’ve grown used to newcomers flocking to my den in hopes of finding treasure, just to be burnt to a crisp before respawning at a nearby town...confused, tired and hurt."
    },
    {
      "character": "narrator",
      "text": "She’s probably done this a million times before. Raided countless lairs...fought countless battles. And I imagine she's already learned a great deal about life from those experiences."
    },
    {
      "character": "narrator",
      "text": "But there are some things in games that just don’t translate well, and we will always be one of them."
    },
    {
      "character": "narrator",
      "text": "But it’s better me than someone who will pick her bones clean."
    },
    {
      "character": "narrator",
      "text": "Dragons must eat too."
    },
    {
      "character": "Molly",
      "text": "The goal here is simple, Sir. We ease you back into the world of gaming by introducing you to something that fits your {i}current{/i} interests more than your older ones."
    },
    {
      "character": "Molly",
      "text": "No pink-haired pop stars are necessary to evoke such memories, surely. This is very obviously a task best suited to me of all people!"
    },
    {
      "character": "Sensei",
      "text": "Why are you so desperate for me to like the same things as you, Molly?"
    },
    {
      "character": "Molly",
      "text": "I’m not, Sir."
    },
    {
      "character": "Sensei",
      "text": "What do you mean you’re not? You’ve been desperate to have something in common with me from the start. And you proved that again the last time you came over when-"
    },
    {
      "character": "Molly",
      "text": "I {i}want{/i} you to like the same things as me, Sir. I want {i}everyone{/i} to like the same things as me because it provides more opportunities for me to form bonds with them. But it’s not {i}desperation.{/i}"
    },
    {
      "character": "Molly",
      "text": "The reason I appear forceful {i}now{/i} is because I’m sad."
    },
    {
      "character": "Sensei",
      "text": "Sad? Why?"
    },
    {
      "character": "Molly",
      "text": "Because you stopped doing something that made you happy."
    },
    {
      "character": "Molly",
      "text": "I don’t specifically know why, of course. Perhaps you had a good reason. Or perhaps you never really cared for such things {i}that much{/i} in the first place. I don’t know."
    },
    {
      "character": "Molly",
      "text": "But when I compare that to myself...and envision a future in which {i}I{/i} am going around telling people I’m too old or “cool” to participate in certain things because they’re not traditionally accepted..."
    },
    {
      "character": "Molly",
      "text": "I have a hard time describing the way that makes me feel."
    },
    {
      "character": "Molly",
      "text": "It’s not good, though. And I think this world would be a lot better if we all just did what we wanted without fear of how others would look at us."
    },
    {
      "character": "Sensei",
      "text": "You’re...surprisingly mature when you’re not pretending you can speak to trees."
    },
    {
      "character": "Molly",
      "text": "Thanks, I hate it."
    },
    {
      "character": "Sensei",
      "text": "Molly, I do appreciate this. And I’m glad you’re...putting some amount of actual care into this that doesn’t ultimately tie back to you just wanting someone else to play games with."
    },
    {
      "character": "Molly",
      "text": "Of course, Sir. But I assume you’re leading up to some type of caveat now, so please- do your worst."
    },
    {
      "character": "Sensei",
      "text": "I just don’t think playing a {i}porn{/i} game together is going to reignite whatever affinity I had for role playing games when I was a kid."
    },
    {
      "character": "Molly",
      "text": "Why not, Sir?"
    },
    {
      "character": "Sensei",
      "text": "Well, to put it simply-"
    },
    {
      "character": "Molly",
      "text": "You think I’m going to get too horny and attack you? And that it will all be counterproductive because barely any {i}gaming{/i} will be done at all?"
    },
    {
      "character": "Sensei",
      "text": "You took the words right out of my mouth."
    },
    {
      "character": "Molly",
      "text": "Then perceptive you are, Sir. For that {i}would{/i} happen under normal circumstances. However!"
    },
    {
      "character": "Molly",
      "text": "I may or may not be exceedingly close to fulfilling my lifelong fantasy of playing porn games with someone I like while we...both masturbate and fully immerse ourselves in our delusional perversions?"
    },
    {
      "character": "Sensei",
      "text": "So it {i}is{/i} self-motivated."
    },
    {
      "character": "Molly",
      "text": "N-No! I didn’t mean it like that! We don’t {i}have{/i} to if-"
    },
    {
      "character": "Sensei",
      "text": "I’m kidding."
    },
    {
      "character": "Sensei",
      "text": "Put on whatever makes you the horniest. I want to see the {i}real{/i} Molly MacCormack in her natural element. When she isn’t just fingering herself to pictures of her friends, I mean."
    },
    {
      "character": "Molly",
      "text": "Th...That’s far more rare than you think, Sir! You merely picked the worst time possible to-"
    },
    {
      "character": "Sensei",
      "text": "Just shut up and pick a game, Molly."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I’m not sure how much time has gone by since we started. It’s been more than an hour, though. I know that for sure."
    },
    {
      "character": "narrator",
      "text": "Which is long enough that even {i}I’ve{/i} been turned on by this game I still can’t be bothered to memorize the name of. So I can only imagine how Molly must be feeling."
    },
    {
      "character": "narrator",
      "text": "Her breathing’s been getting heavier by the minute. Yet, despite how long we’ve been here, just inches from each other, we haven’t touched at all."
    },
    {
      "character": "narrator",
      "text": "She squeezes her thighs together every now and then, trying to suppress or hide her arousal — something I don’t understand since indulging in it was meant to be the point of this awkward interaction."
    },
    {
      "character": "narrator",
      "text": "But I guess it’s much easier to say things than to actually {i}do{/i} them. And if this really {i}is{/i} a fantasy of hers, I imagine she’s trying to stretch it out for as long as she can, but...that she’s {i}also{/i} a little scared."
    },
    {
      "character": "narrator",
      "text": "I don’t blame her."
    },
    {
      "character": "narrator",
      "text": "I’d be scared if I were her too."
    },
    {
      "character": "Sensei",
      "text": "How hot are you right now, Molly?..."
    },
    {
      "character": "narrator",
      "text": "Because I say things like that."
    },
    {
      "character": "Molly",
      "text": "{i}Very,{/i} Sir..."
    },
    {
      "character": "Molly",
      "text": "And...having you beside me is..."
    },
    {
      "character": "Sensei",
      "text": "Not helping?..."
    },
    {
      "character": "Molly",
      "text": "Not in the slightest..."
    },
    {
      "character": "narrator",
      "text": "I say all sorts of things."
    },
    {
      "character": "narrator",
      "text": "Typically, it’s just whatever will bring me closer to my target."
    },
    {
      "character": "Sensei",
      "text": "Well..."
    },
    {
      "character": "narrator",
      "text": "But right now...I care less about hunting and more about...{i}observing.{/i}"
    },
    {
      "character": "Sensei",
      "text": "You can start whenever you want..."
    },
    {
      "character": "narrator",
      "text": "Right now, I’ll let my curiosity guide my speech."
    },
    {
      "character": "narrator",
      "text": "I’ve seen far too many times what happens to girls when they hand themselves over to me."
    },
    {
      "character": "narrator",
      "text": "But Molly’s fantasy calls for something else. And it’s a wish she can easily grant herself by just doing what she’s done a million times before."
    },
    {
      "character": "narrator",
      "text": "The only difference is I’ll be watching this time."
    },
    {
      "character": "Molly",
      "text": "You don’t...mind...Sir?..."
    },
    {
      "character": "narrator",
      "text": "And if I like what I see enough..."
    },
    {
      "character": "narrator",
      "text": "Maybe I’ll join her?"
    },
    {
      "character": "Sensei",
      "text": "Of course not...I {i}want{/i} to see..."
    },
    {
      "character": "Molly",
      "text": "You won’t...make fun of me, will you?..."
    },
    {
      "character": "Molly",
      "text": "Because...I know it may seem strange to you as...someone who doesn’t typically play these sorts of things, but-"
    },
    {
      "character": "Sensei",
      "text": "It’s not weird at all, Molly..."
    },
    {
      "character": "Sensei",
      "text": "Go on..."
    },
    {
      "character": "Sensei",
      "text": "Show me what it’s like when you’re alone."
    },
    {
      "character": "Molly",
      "text": "I..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "Okay...{i}Sir...{/i}"
    },
    {
      "character": "Molly",
      "text": "{i}Ah...{/i}"
    },
    {
      "character": "narrator",
      "text": "She clumsily slides her hand into her shorts, not bothering to unhook the button. I can tell just how badly she’s been looking forward to this."
    },
    {
      "character": "narrator",
      "text": "I watch carefully as her fingers dance beneath the fabric, imagining their tips inching closer to her clit..."
    },
    {
      "character": "narrator",
      "text": "All while scattered protrusions of her knuckles through denim paint a picture of pleasure you can’t find in games."
    },
    {
      "character": "narrator",
      "text": "I imagine her pale flesh, peppered lightly with freckles that feel like they only exist to make me want her more."
    },
    {
      "character": "narrator",
      "text": "And while I know I could reach down and see them if I try to, I find the mystery itself more arousing this time."
    },
    {
      "character": "Molly",
      "text": "{i}Hah.....aah.....{/i}"
    },
    {
      "character": "Sensei",
      "text": "I bet that feels good, doesn’t it?..."
    },
    {
      "character": "Molly",
      "text": "I’ve been holding it in...Sir..."
    },
    {
      "character": "Molly",
      "text": "I didn’t want to...start without you..."
    },
    {
      "character": "Molly",
      "text": "Will you...will you...join me?..."
    },
    {
      "character": "Sensei",
      "text": "In a minute, probably..."
    },
    {
      "character": "Sensei",
      "text": "I’m fine just watching you for now."
    },
    {
      "character": "Molly",
      "text": "Do you......enjoy watching me......Sir?..."
    },
    {
      "character": "Sensei",
      "text": "I do..."
    },
    {
      "character": "Molly",
      "text": "Hah...mnn...that’s...excellent news...because...aahh! I think I..."
    },
    {
      "character": "Molly",
      "text": "I think I...like it when you...watch me too..."
    },
    {
      "character": "Sensei",
      "text": "Yeah...you love it when I look at you in general, don’t you?..."
    },
    {
      "character": "Molly",
      "text": "Yes...{i}Sir...{/i}"
    },
    {
      "character": "Molly",
      "text": "But you’re almost always...looking at someone else..."
    },
    {
      "character": "Molly",
      "text": "I...aaah...I need to...stand out more...I need to...make you-"
    },
    {
      "character": "Molly",
      "text": "Mnh!"
    },
    {
      "character": "Sensei",
      "text": "You can get all sentimental later. I want to see you fuck yourself right now. Can you do that for me?"
    },
    {
      "character": "Molly",
      "text": "Mmngh! Of course...Sir! But you...I want...I want..."
    },
    {
      "character": "Sensei",
      "text": "What do you want? Say it clearly."
    },
    {
      "character": "Molly",
      "text": "I want...to see you..."
    },
    {
      "character": "Sensei",
      "text": "What do you want to see, Molly? Say it."
    },
    {
      "character": "Molly",
      "text": "Show me...aah...how hard...you’ve gotten!..."
    },
    {
      "character": "Molly",
      "text": "My fantasy...will only come true if...we’re {i}both{/i} doing this! It’s too...embarrassing...by myself!"
    },
    {
      "character": "Sensei",
      "text": "Molly MacCormack is {i}embarrassed?{/i} I didn’t realize that could happen."
    },
    {
      "character": "Molly",
      "text": "Hah...hahh! Of course it...can happen! Like...haaah...right now...I’m-"
    },
    {
      "character": "Sensei",
      "text": "You’re gonna cum, aren’t you? I can tell by the way you’re squinting. Your fingers are moving faster too. You’re so close, Molly."
    },
    {
      "character": "Molly",
      "text": "Mmngh! Sir...Sir!"
    },
    {
      "character": "Sensei",
      "text": "Cum for me...Cum for me and I’ll give you what you want..."
    },
    {
      "character": "Molly",
      "text": "Haah!...Aaah!....S....Sir!!!!! Aah! Aaah! Aaah! AaAaaaaAAAaaAAaahhhh-"
    },
    {
      "character": "narrator",
      "text": "And so she did. Which meant that {i}I{/i} had to hold up my end of the bargain."
    },
    {
      "character": "narrator",
      "text": "While I unzipped and unbuttoned my jeans, Molly pulled her shorts off entirely, tossing her laptop to the side and allowing the glow of that unnamed porn game to become our only light for the time being."
    },
    {
      "character": "narrator",
      "text": "She curled up next to me and pressed her head up against my chest, shifting her hips so her legs brushed against mine while she went right back to work."
    },
    {
      "character": "narrator",
      "text": "Now, though, {i}she{/i} has something to look at. Something that isn’t encased behind glass and built out of pixels and polygons."
    },
    {
      "character": "narrator",
      "text": "And she {i}sure{/i} does enjoy it."
    },
    {
      "character": "Molly",
      "text": "Christ almighty, Sir...You’re an orc in your own regard, aren’t you?"
    },
    {
      "character": "Sensei",
      "text": "What does that make you then? One of those halfling things?"
    },
    {
      "character": "Molly",
      "text": "I certainly feel like one when I see {i}that{/i} next to my body..."
    },
    {
      "character": "Sensei",
      "text": "You know I’ll fuck you if you want it, right?"
    },
    {
      "character": "Molly",
      "text": "You really want to fuck me, Sir?..."
    },
    {
      "character": "Sensei",
      "text": "More than anything right now."
    },
    {
      "character": "Molly",
      "text": "But I gave you so many chances and you denied me for all of them."
    },
    {
      "character": "Sensei",
      "text": "That was...in your best interest..."
    },
    {
      "character": "Molly",
      "text": "My best interest?..."
    },
    {
      "character": "Molly",
      "text": "You just wanted me to go home and masturbate to you, didn’t you?..."
    },
    {
      "character": "Molly",
      "text": "You’re so mean, Sir...giving me the idea that I could experiment with you...only to string me along for eternities afterward..."
    },
    {
      "character": "Molly",
      "text": "Do you have any idea how many times I’ve cum for you, Sir?"
    },
    {
      "character": "Sensei",
      "text": "More than you have for Rin, I hope."
    },
    {
      "character": "Molly",
      "text": "Aye...you’re certainly in first place now..."
    },
    {
      "character": "Molly",
      "text": "And I want it, Sir...I want it {i}badly...{/i}"
    },
    {
      "character": "Molly",
      "text": "I want to feel you inside of me...I want to ride you so hard that...it puts your cum meter on...cooldown for the next twenty four hours..."
    },
    {
      "character": "Sensei",
      "text": "Then why are we still touching ourselves?"
    },
    {
      "character": "Molly",
      "text": "Because we can’t help it..."
    },
    {
      "character": "narrator",
      "text": "Molly begins to finger herself harder and faster. And I can tell she’s looking at me, but the angle I’m stuck at prevents me from tying my gaze to hers."
    },
    {
      "character": "narrator",
      "text": "Regardless, I can still feel her body. Her warmth. Her scraggly hair and her frail legs, twitching intermittently as she brings herself to the verge of one more climax."
    },
    {
      "character": "narrator",
      "text": "All the while, I can feel one of my own approaching."
    },
    {
      "character": "Molly",
      "text": "I’m glad...you’re such a terrible teacher...Sir..."
    },
    {
      "character": "Molly",
      "text": "I can only imagine the things I’d do if you were {i}opposed{/i} to unlocking sex scenes with your students..."
    },
    {
      "character": "Sensei",
      "text": "You think you’d come after me still?"
    },
    {
      "character": "Molly",
      "text": "Let’s just say I’d be more inclined to take a page out of the Magistrate of Mammaries’ book and {i}force{/i} you to look at me."
    },
    {
      "character": "Sensei",
      "text": "You’re not bold enough for that, Molly. We both know it."
    },
    {
      "character": "Molly",
      "text": "Do we, Sir?"
    },
    {
      "character": "Sensei",
      "text": "Y...I...I thought we weren’t supposed to-"
    },
    {
      "character": "Molly",
      "text": "We’re not. I just wanted to show you that I {i}can{/i} get a little bolder when I’m horny, Sir."
    },
    {
      "character": "Sensei",
      "text": "Molly-"
    },
    {
      "character": "Molly",
      "text": "Feel good?"
    },
    {
      "character": "Molly",
      "text": "Still want to put it inside of me?"
    },
    {
      "character": "Sensei",
      "text": "I...can’t imagine I’d last long at this point..."
    },
    {
      "character": "Molly",
      "text": "Me neither, Sir...I’ll be cumming again any second now."
    },
    {
      "character": "Molly",
      "text": "And I’d fear for your safety if you were to put it inside since I might accidentally snap it off."
    },
    {
      "character": "narrator",
      "text": "She picks up the pace and wraps her hand tighter around my shaft, pumping the top half as I proceed to work on the bottom."
    },
    {
      "character": "narrator",
      "text": "And while such a thing sounds like it could be a recipe for disaster if we’re not in sync, Molly manages to match my rhythm perfectly. Probably thanks to video games or something, so that’s cool."
    },
    {
      "character": "Molly",
      "text": "You want to know how my fantasy ends, Sir?..."
    },
    {
      "character": "Sensei",
      "text": "Hopefully...with my dick in your mouth..."
    },
    {
      "character": "Molly",
      "text": "Close. Want to guess again?"
    },
    {
      "character": "Sensei",
      "text": "Your...pussy?"
    },
    {
      "character": "Molly",
      "text": "Coooolder. I’ll give you one more guess."
    },
    {
      "character": "Sensei",
      "text": "Before what?"
    },
    {
      "character": "Molly",
      "text": "I don’t know. I haven’t thought of that part."
    },
    {
      "character": "Sensei",
      "text": "Molly-"
    },
    {
      "character": "Molly",
      "text": "Cum on my face while I finger myself...{i}Sir.{/i}"
    },
    {
      "character": "Sensei",
      "text": "That’s the hottest thing anyone has ever said to me."
    },
    {
      "character": "Molly",
      "text": "Heheh! Seems like I’ve set a record I’m going to have to be-aahh!"
    },
    {
      "character": "narrator",
      "text": "I push Molly back as I position myself above her — so close that I can feel her breath on my cock as I go back to stroking myself."
    },
    {
      "character": "narrator",
      "text": "She doesn’t let up either, spreading her legs and playing with herself as she gazes deeply into my eyes, finally able to meet hers."
    },
    {
      "character": "Molly",
      "text": "Haah...Sir...give it to me...give it to me..."
    },
    {
      "character": "Sensei",
      "text": "You’re gonna cum for me too, right?"
    },
    {
      "character": "Molly",
      "text": "Sir...yes...sir..."
    },
    {
      "character": "Molly",
      "text": "I’m...so close...so...so close..."
    },
    {
      "character": "Sensei",
      "text": "Be louder..."
    },
    {
      "character": "Molly",
      "text": "Aah.....Aaah!"
    },
    {
      "character": "Sensei",
      "text": "{i}Louder.{/i}"
    },
    {
      "character": "Molly",
      "text": "Aah! Ngaaah! Aaaah! S...Sir! I’m...haaaah!"
    },
    {
      "character": "Sensei",
      "text": "Just like that, Molly...Lie there...and play with your little clit like the degenerate you are..."
    },
    {
      "character": "Molly",
      "text": "Mnn! Mm! Sensei...Sensei! I’m cumming...I’m cumming!"
    },
    {
      "character": "Sensei",
      "text": "Mmngh...Molly-"
    },
    {
      "character": "Molly",
      "text": "Aaah...aaaaahn~"
    },
    {
      "character": "narrator",
      "text": "Before I can even tell her what to do, she manages to figure it out. And I not only silently thank video games again, but pat myself on the back for making her fantasy play out presumably exactly how she wanted."
    },
    {
      "character": "Molly",
      "text": "Aaah! Aaaah! Aaaaaaaah!"
    },
    {
      "character": "Molly",
      "text": "AIAYAAAaaaaAHHhhhHHAAAAaaaAAAaaaAAAaaaHHHH!!!!!~!!!!~~~"
    },
    {
      "character": "Molly",
      "text": "Aaah...aaaaaah....aaaaaaaahhhh~"
    },
    {
      "character": "narrator",
      "text": "She pulls her hand back and slumps down, falling helplessly into whatever sort of sensory overload is brought on by experiencing an orgasm while the guy you like jerks off onto your face."
    },
    {
      "character": "Molly",
      "text": "Ah...aaaaaaaaaah~"
    },
    {
      "character": "Sensei",
      "text": "This is a good look for you, Molly..."
    },
    {
      "character": "Molly",
      "text": "{i}Gulp.{/i} Heheheh~"
    },
    {
      "character": "Molly",
      "text": "Thank you, Sir..."
    },
    {
      "character": "Molly",
      "text": "Maybe you can...dress me up again soon?"
    },
    {
      "character": "narrator",
      "text": "Molly begins to clean herself off and-"
    },
    {
      "character": "narrator",
      "text": "{i}And you CAN “dress her up” again soon! Any night, in fact! Because she’s officially unlocked as an Invite-Character!{/i}"
    },
    {
      "character": "narrator",
      "text": "Oh, okay. I guess my job is done here then."
    },
    {
      "character": "narrator",
      "text": "{i}That’s right, Akira! You’ve once more fulfilled your only purpose on this planet and ejaculated all over some helpless girl! Great job!{/i}"
    },
    {
      "character": "narrator",
      "text": "I collapse onto the bed beside her while-"
    },
    {
      "character": "narrator",
      "text": "{i}Molly’s affection has increased to [molly_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "I go to reach for a towel and-"
    },
    {
      "character": "narrator",
      "text": "{i}Molly’s lust has increased to [molly_lust]!{/i}"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I-"
    },
    {
      "character": "narrator",
      "text": "{i}Upon reaching 500 headpats, Molly MacCormack will-{/i}"
    },
    {
      "character": "narrator",
      "text": "Oh, fuck it. Goodnight."
    },
    {
      "character": "narrator",
      "text": "{i}Molly leaves the room!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Just...not right away.{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "mollyinvite2": {
      "from": null,
      "to": true
    },
    "molly_lust +": {
      "from": null,
      "to": 1
    }
  }
}