{
  "event_id": 282,
  "event_label": "nodokainvite2",
  "dialogue": [
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Nodoka",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh, this should be good."
    },
    {
      "character": "Sensei",
      "text": "Okay, hold on. Before you freak out, let me try to explain. Nodoka is-"
    },
    {
      "character": "Nodoka",
      "text": "Adorable, isn’t she? I had no idea being cute felt so good."
    },
    {
      "character": "Ami",
      "text": "That’s...That’s Nodoka? "
    },
    {
      "character": "Sensei",
      "text": "Yes. But I’ve already told her that raiding your things is fucked up and weird and I never would have-"
    },
    {
      "character": "Nodoka",
      "text": "Tried to hide it from you unless he was forced to."
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Ami",
      "text": "Yeah, {i}what?{/i}"
    },
    {
      "character": "Nodoka",
      "text": "Okay, okay. Since I’ve been caught, I might as well come clean. "
    },
    {
      "character": "Nodoka",
      "text": "I’ve been sneaking into your house and dressing up in your clothes for months now. But it appears I became a bit too immersed in my games today and didn’t hear your father come home."
    },
    {
      "character": "Nodoka",
      "text": "I tried to get away with it by convincing him I was the {i}real{/i} you, but I guess he just loves you way too much to fall for a silly trick like that. He saw through me right away."
    },
    {
      "character": "Ami",
      "text": "I’m not buying it."
    },
    {
      "character": "Sensei",
      "text": "I can handle this, Nodoka. Just go home. "
    },
    {
      "character": "Nodoka",
      "text": "If that’s what you think is best, Daddy..."
    },
    {
      "character": "Ami",
      "text": "Do...not...FUCKING...call him that."
    },
    {
      "character": "Nodoka",
      "text": "But that’s what the {i}real{/i} Ami would call him. And if I’m going to pretend to be you, I’m going to give it my all! Ami Arakawa never-"
    },
    {
      "character": "Ami",
      "text": "You. Are. Not. Me. You do not get to call him that."
    },
    {
      "character": "Nodoka",
      "text": "But I {i}am{/i} you, Ami. "
    },
    {
      "character": "Ami",
      "text": "Hahah! You’re going to die now!"
    },
    {
      "character": "Sensei",
      "text": "Ami, wait. Just because Nodoka is being fucking weird again doesn’t mean we need to escalate things. She was just leaving. {i}Right,{/i} Nodoka?"
    },
    {
      "character": "Nodoka",
      "text": "Yes, Da-"
    },
    {
      "character": "Ami",
      "text": "Sensei."
    },
    {
      "character": "Nodoka",
      "text": "Yes, {i}Sensei.{/i} Let me just gather my boring old regular outfit and-"
    },
    {
      "character": "Ami",
      "text": "No, no! You leaving will just make it harder for me to kill you. Please! Take a seat. Get comfortable. And let me know what you’d like to have for your last meal so I can try to throw it together really quickly."
    },
    {
      "character": "Nodoka",
      "text": "I’ll take a deluxe strawberry parfait, some rosé tteokbokki, a small serving of hamburger steak, some zarusoba aaaaand...a bowl of cranberries."
    },
    {
      "character": "Ami",
      "text": "Those are all of my favorite foods!"
    },
    {
      "character": "Sensei",
      "text": "A bowl of cranberries?"
    },
    {
      "character": "Ami",
      "text": "I heard they make your boobs grow! But it was clearly a lie!"
    },
    {
      "character": "Nodoka",
      "text": "I’ll also take a white peach flavored Calpico if I’m allowed to have a drink."
    },
    {
      "character": "Ami",
      "text": "Why do you know all of my favorite things?! This is beyond creepy! And I know a thing or two about creepy!"
    },
    {
      "character": "Nodoka",
      "text": "I’m obviously just a huge fan! Do you really think I’d pretend to be you otherwise?"
    },
    {
      "character": "Ami",
      "text": "Yes! If you think it would bring you closer to having sex with my dad, I imagine you {i}would{/i} pretend to be me!"
    },
    {
      "character": "Nodoka",
      "text": "That does sound rather intriguing, I won’t lie."
    },
    {
      "character": "Ami",
      "text": "Dad, will you please let go of me if I promise to dispose of her body without a trace?"
    },
    {
      "character": "Sensei",
      "text": "Ami, let’s just go to my room and wait until she’s gone. Okay?"
    },
    {
      "character": "Ami",
      "text": "And just let her get away with this?! "
    },
    {
      "character": "Ami",
      "text": "So Nodoka breaks into the house and sets up this whole thing where I walk in on her pretending to be me, {i}clearly{/i} mocking me to {i}your{/i} face, and you just want to let her go?! Doesn’t that make you mad?!"
    },
    {
      "character": "Sensei",
      "text": "Yes. Very mad. She didn’t break in, though. That was a lie. I invited her here."
    },
    {
      "character": "Nodoka",
      "text": "Tch. Even after I tried to cover for you and everything. The fact that you’re suddenly so honest with her is something I hadn’t factored into my take on the character. I’ll have to refine my craft."
    },
    {
      "character": "Ami",
      "text": "You {i}knew{/i} she was going to do this?..."
    },
    {
      "character": "Sensei",
      "text": "No. She tricked me and locked me out. Then, when she finally unlocked the door, she was...{i}this.{/i}"
    },
    {
      "character": "Ami",
      "text": "Why did you invite her over?"
    },
    {
      "character": "Sensei",
      "text": "To-"
    },
    {
      "character": "Nodoka",
      "text": "To fuck me, of course."
    },
    {
      "character": "Ami",
      "text": ".............."
    },
    {
      "character": "Sensei",
      "text": "Nodoka, just out of curiosity, do you {i}want{/i} to die? Because I’m starting to think this is some kind of “suicide by cop” situation. "
    },
    {
      "character": "Ami",
      "text": "I don’t even have any words right now. "
    },
    {
      "character": "Nodoka",
      "text": "You could always compliment my outfit? Or tell me more about how badly {i}you{/i} want to lie with your father. The possibilities are essentially endless."
    },
    {
      "character": "Ami",
      "text": "Everyone knows exactly how badly I want to “lie with my father.” Wasting more words on someone playing dress-up would do nothing but turn me on. "
    },
    {
      "character": "Nodoka",
      "text": "Excellent. Then we can be turned on together. Because seeing just how dearly the two of you love one another has set this borrowed body ablaze with lust and curiosity."
    },
    {
      "character": "Ami",
      "text": "I’m listening."
    },
    {
      "character": "Nodoka",
      "text": "What more do you want to hear?"
    },
    {
      "character": "Ami",
      "text": "Whatever else you have to add to that thing about how dearly my dad and I love each other."
    },
    {
      "character": "Sensei",
      "text": "Is that really more important than just getting her out of here? Everybody already knows Nodoka is the incest girl."
    },
    {
      "character": "Ami",
      "text": "Yeah, but we’ve never seen what she does in a situation where it could actually happen."
    },
    {
      "character": "Nodoka",
      "text": "What an astute observation, Ami! My status as the “incest girl” is naught but hearsay until it’s proven that I’m not merely putting on an act. We really {i}should{/i} test this out, shouldn’t we?"
    },
    {
      "character": "Ami",
      "text": "So...just to clarify — you’re saying you really {i}do{/i} want to watch my dad fuck me?"
    },
    {
      "character": "Nodoka",
      "text": "I want whatever it is {i}you{/i} want, Ami! "
    },
    {
      "character": "Nodoka",
      "text": "Right now, I don’t want you to think of me as Nodoka at all! I want you to see me as a...reflection. Just the type you’d find in a funhouse that makes you look far less cute than you truly are."
    },
    {
      "character": "Ami",
      "text": "So you admit you’re just a cheap knockoff, then?"
    },
    {
      "character": "Nodoka",
      "text": "As cheap as they come. "
    },
    {
      "character": "Nodoka",
      "text": "Besides, if you want the honest truth, I’d rather watch him have his way with you than experience it myself to begin with."
    },
    {
      "character": "Ami",
      "text": "Okay. I’m being successfully convinced."
    },
    {
      "character": "Sensei",
      "text": "Yeah, because you’ve never met anyone willing to watch us fuck before."
    },
    {
      "character": "Ami",
      "text": "I can guarantee you there are at least five girls in the class who would not only {i}watch{/i} that, but aggressively touch themselves to it. Nodoka’s just the first to actively seek it out."
    },
    {
      "character": "Nodoka",
      "text": "I’ll do anything so long as it brings us closer together, Ami. I’ve always admired you."
    },
    {
      "character": "Ami",
      "text": "You have literally never said or indicated that to me at any point."
    },
    {
      "character": "Nodoka",
      "text": "I’m not very good at socializing. Please accept this cosplay {i}and{/i} my body in lieu of a formal friend request."
    },
    {
      "character": "Sensei",
      "text": "I don’t really think Ami wants your body, Nodoka."
    },
    {
      "character": "Ami",
      "text": "Hmmmmm......."
    },
    {
      "character": "Sensei",
      "text": "Uh...or...maybe I’m wrong?"
    },
    {
      "character": "Ami",
      "text": "I {i}do{/i} like dolls. And my clothes {i}do{/i} look surprisingly good on her."
    },
    {
      "character": "Ami",
      "text": "A live mannequin sounds kind of interesting...doesn’t it, Dad?"
    },
    {
      "character": "Nodoka",
      "text": "I can be more than just a mannequin too. I’ll follow orders. And if you want to put anything inside of me, I won’t even complain about it."
    },
    {
      "character": "Nodoka",
      "text": "Unless you want me to, of course. Because, while I may have {i}come{/i} here to let your father fuck me, my real goal has always been to learn more about you. "
    },
    {
      "character": "Ami",
      "text": "{i}Why, though?{/i}"
    },
    {
      "character": "Nodoka",
      "text": "So I can be the best Ami I {i}can{/i} be, of course. "
    },
    {
      "character": "Ami",
      "text": "Step one — tragically lose your parents. "
    },
    {
      "character": "Nodoka",
      "text": "Essentially complete."
    },
    {
      "character": "Ami",
      "text": "Step two — twintails."
    },
    {
      "character": "Nodoka",
      "text": "Also complete."
    },
    {
      "character": "Sensei",
      "text": "Step two is a major regression from the first one."
    },
    {
      "character": "Ami",
      "text": "You underestimate how long it took me to grow my hair out. Step three — buy into the idea that the purest {size=-15}and hottest{/size} form of love that exists is that which occurs between father and daughter."
    },
    {
      "character": "Sensei",
      "text": "And now we’re right back to 100."
    },
    {
      "character": "Nodoka",
      "text": "Oh, joy. I’m three-for-three so far. How many more steps are there before I see the two of you engage in...{i}purity?{/i}"
    },
    {
      "character": "Ami",
      "text": "Are you going to tell anyone about this?"
    },
    {
      "character": "Nodoka",
      "text": "Do you {i}want{/i} me to tell anyone about this?"
    },
    {
      "character": "Ami",
      "text": "Kind of. I don’t think it would be good for Sensei, though."
    },
    {
      "character": "Sensei",
      "text": "I feel like I’m kind of just here as an afterthought in this negotiation, so don’t factor me in {i}too{/i} much."
    },
    {
      "character": "Sensei",
      "text": "But yeah, the fewer people who know I’m the worst parent in the world, the better."
    },
    {
      "character": "Ami",
      "text": "One last question. Do you think my dad is a bad parent?"
    },
    {
      "character": "Nodoka",
      "text": "Of course not. How would such a thing even be {i}possible{/i} with a daughter as perfect as you?"
    },
    {
      "character": "Ami",
      "text": "Okay! Application accepted! You get to watch!"
    },
    {
      "character": "Sensei",
      "text": "{i}Hah...{/i}"
    },
    {
      "character": "Ami",
      "text": "But first, to make sure you’re not armed or recording this, and also because I hate it, I’m going to need you to take my clothes off."
    },
    {
      "character": "Nodoka",
      "text": "Of your body? I can do that."
    },
    {
      "character": "Ami",
      "text": "Noooo, I need you to take my clothes off of {i}your{/i} body."
    },
    {
      "character": "Nodoka",
      "text": "I have to be naked?"
    },
    {
      "character": "Ami",
      "text": "Getting cold feet? Or maybe...you {i}really{/i} are up to something if-"
    },
    {
      "character": "Nodoka",
      "text": "Is here okay?"
    },
    {
      "character": "Ami",
      "text": "Oh. Yeah. There is fine."
    },
    {
      "character": "Sensei",
      "text": "Ami...what are you doing?"
    },
    {
      "character": "Ami",
      "text": "What do you mean “what am I doing?” You invited a girl over to have sex and the first thing she did when she got here was put on my clothes. She’s lucky she’s still breathing."
    },
    {
      "character": "Sensei",
      "text": "Shouldn’t {i}I{/i} be the one in trouble then? Since I’m the one who invited her?"
    },
    {
      "character": "Ami",
      "text": "Nope! Because you were so disturbed by the sheer sight of her pretending to be me that you felt sick to your stomach and couldn’t proceed. Poor thing. I’ll have to take {i}really{/i} good care of you today."
    },
    {
      "character": "Ami",
      "text": "Especially since we’ll have an audience."
    },
    {
      "character": "Sensei",
      "text": "You sure you’re...okay with this, though? Nodoka’s pretty much always up to something and...you accepted her explanation of things a bit easier than I expected."
    },
    {
      "character": "Ami",
      "text": "Sure. You’re right. But the way I look at this is really simple. "
    },
    {
      "character": "Ami",
      "text": "You and I are going to make love like we always do. And there isn’t a thing in the world that can ruin that even {i}if{/i} Nodoka is up to something. "
    },
    {
      "character": "Sensei",
      "text": "What about another {i}Ami,{/i} though?"
    },
    {
      "character": "Ami",
      "text": "Another Ami will just make you cum harder. And I’ve never gotten to have a threesome with myself before."
    },
    {
      "character": "Sensei",
      "text": "You’ve never gotten to have a threesome with {i}anyone{/i} before."
    },
    {
      "character": "Ami",
      "text": "That’s just what {i}you{/i} think."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I {i}hope{/i} you haven’t had a threesome with anyone before."
    },
    {
      "character": "Ami",
      "text": "And {i}I{/i} hope you brought your A-game today since we’re gonna need to go all out to impress Nodoka."
    },
    {
      "character": "Nodoka",
      "text": "While I feel bad about interrupting the two of you as you flirt, I’ve finished getting undressed and would like to proceed now."
    },
    {
      "character": "Ami",
      "text": "And proceed we shall! "
    },
    {
      "character": "Ami",
      "text": "After a brief inspection..."
    },
    {
      "character": "narrator",
      "text": "Ami, somehow slightly {i}less{/i} terrifying than normal, makes her way across the room and stands beside Nodoka’s naked body."
    }
  ],
  "state_changes": {
    "nodokainvite2": {
      "from": null,
      "to": true
    }
  }
}