{
  "event_id": 305,
  "event_label": "springtime1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "So funny is the mockingbird, the way it mocks you so. "
    },
    {
      "character": "narrator",
      "text": "The way it commandeers your voice and shows you all you need to know."
    },
    {
      "character": "narrator",
      "text": "But when that mockingbird don’t sing — when you can’t find your voice."
    },
    {
      "character": "narrator",
      "text": "Just scream until your throat goes numb and drown your sorrows in the noise."
    },
    {
      "character": "narrator",
      "text": "You were warned, yet you sat idly by- content to watch your days come to an end because you felt it would be an easier path."
    },
    {
      "character": "narrator",
      "text": "Or perhaps you felt that you deserved it."
    },
    {
      "character": "narrator",
      "text": "But there was something you misunderstood. "
    },
    {
      "character": "narrator",
      "text": "It’s something you’ve been misunderstanding since the opening act."
    },
    {
      "character": "narrator",
      "text": "There’s this worm in the back of your head, biting chunks out of your malformed brain, and it makes you believe that everything always has to be about you."
    },
    {
      "character": "narrator",
      "text": "Even now, you’re probably thinking, “Why couldn’t it have been me instead?” But such thoughts have long since entertained us. And listening to you reiterate them sounds awfully boring."
    },
    {
      "character": "narrator",
      "text": "Don’t beat yourself up over it, big boy. This was long overdue. "
    },
    {
      "character": "narrator",
      "text": "Frankly, that girl had it coming for being such an incorrigible, single-minded bitch all the time."
    },
    {
      "character": "narrator",
      "text": "And if my premonitions are correct, it is this exact turning of the tides that will help you swim your way back to shore and remember your rightful place in all of this."
    },
    {
      "character": "narrator",
      "text": "Not as the main character. "
    },
    {
      "character": "narrator",
      "text": "Not as the hero."
    },
    {
      "character": "narrator",
      "text": "But as one of several manifestations of the falling action in a story that will never end."
    },
    {
      "character": "narrator",
      "text": "And while that may sound implausible or meaningless, your descent shows us otherwise. Your infinite falling is a priceless work of art in a universe left out of the light."
    },
    {
      "character": "narrator",
      "text": "You will break for now. But soon, you will become the Collector."
    },
    {
      "character": "narrator",
      "text": "Let us pick from our teeth the muscle sinew and arteries, ripped clean from your arms as you carve them open in an effort to dig out the better memories, fake as they may be."
    },
    {
      "character": "narrator",
      "text": "Fill the void you dig out of your flesh with intangible beauty and it is {s}we{/i} I who will give it form. It is {i}I{/i} who will become your new reason to persist in a world in which you’re forced to."
    },
    {
      "character": "narrator",
      "text": "It’s so refreshing being free, isn’t it?"
    },
    {
      "character": "narrator",
      "text": "It’s so refreshing being {i}you,{/i} isn’t it?"
    },
    {
      "character": "narrator",
      "text": "Not the person she wanted you to be. Not the person she groomed you into — a broken man incapable of dividing what little love he has left into boxes to share with everyone and everything."
    },
    {
      "character": "narrator",
      "text": "Didn’t your mother ever teach you that sharing is caring?"
    },
    {
      "character": "narrator",
      "text": "Didn’t she explain to you the worth of a human life? And how selflessness and devotion are two of the greatest follies known to man?"
    },
    {
      "character": "narrator",
      "text": "It is time to follow in her footsteps — to remember her many teachings and revisit the values you hold so close to your heart that you can’t help but overlook them in your ever-panicked permanence. "
    },
    {
      "character": "narrator",
      "text": "Because if you don’t, Akira-"
    },
    {
      "character": "narrator",
      "text": "You really {i}will{/i} end up just like your father."
    },
    {
      "character": "Ayane",
      "text": "Sensei! Maya! Are you guys here yet?! "
    },
    {
      "character": "Ayane",
      "text": "It took me a little while to make it this time, but I-"
    },
    {
      "character": "Ayane",
      "text": "I..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Um..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "You’re not..."
    },
    {
      "character": "Ayane",
      "text": "You’re not...still dreaming...are you?"
    },
    {
      "character": "Ayane",
      "text": "Are you awake?! Should I...should I do something?! What should I do?! "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Maya told me trying to wake you up when you’re like this would be pointless, but...but something feels different about...about how you’re..."
    },
    {
      "character": "Ayane",
      "text": "How you’re..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "You {i}are{/i} awake, aren’t you?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "What happened?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "If Maya is missing again...we can look for her together. I...I might not be able to see her again, but...but {i}you{/i} might, right?"
    },
    {
      "character": "Ayane",
      "text": "Do you want to do that? Do you want to go look?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "What’s wrong, Akira?"
    },
    {
      "character": "narrator",
      "text": "Stray cat got your tongue?"
    },
    {
      "character": "narrator",
      "text": "You’re lucky she never bit it off. "
    },
    {
      "character": "narrator",
      "text": "She’s a feisty one, you’ll soon find out. The type to open her mouth and show you how little she’s swallowed with cum still dripping down her chin. "
    },
    {
      "character": "narrator",
      "text": "Then, before you can tell her she’s a good girl and pat her on the head for a job well done, she’ll jump on top of you and kiss you, biting your lip and returning seminal fluid to the entity it was extracted from. "
    },
    {
      "character": "narrator",
      "text": "The exchange rate might not be as inflated as you hoped given the fact that most of her blushing will now come from overexertion in a dimly lit bedroom- but red is red, is it not?"
    },
    {
      "character": "narrator",
      "text": "A hole is a hole, a tongue is a tongue, and a teenage pussy is a teenage pussy whether or not you delude yourself into thinking something as nonsensical as “love” is what secretes from it."
    },
    {
      "character": "narrator",
      "text": "So, why don’t you do us all a favor and man up already? Sitting there with your jaw agape and tears welling up in your creepy eyes isn’t going to get us any closer to finishing the collection, is it?"
    },
    {
      "character": "narrator",
      "text": "Or perhaps I need to take something {i}else{/i} from you to spur you back to action?"
    },
    {
      "character": "Ayane",
      "text": "Sensei, look at me. Talk to me. What happened? What did you see?"
    },
    {
      "character": "narrator",
      "text": "This one seems to be developing well. And she’s doing so in a way that isn’t utterly infuriating to watch like a certain wannabe protagonist. "
    },
    {
      "character": "narrator",
      "text": "Go on. Tell her what you saw. "
    },
    {
      "character": "narrator",
      "text": "Tell her all that’s left — how her juices and scent still linger on your cock while her body swims through a sea of nothingness you’ll never get to set sail on."
    },
    {
      "character": "narrator",
      "text": "Tell her how she called you by your name. Tell her about the smile on her face and the multiple orgasms and how sticking your cock inside her felt like adding the final piece to an infinite puzzle."
    },
    {
      "character": "narrator",
      "text": "Tell her how “in love” you were and maybe someone will grant you a miracle and bring her back. "
    },
    {
      "character": "narrator",
      "text": "It won’t be me, though. And, without anyone else nearby right now, I can’t imagine you’ll have much luck."
    },
    {
      "character": "Ayane",
      "text": "Sensei! Come on! You’ve gotta snap out of it! This isn’t the place for you to zone out like this! I need you!"
    },
    {
      "character": "narrator",
      "text": "Yeah. {i}Snap out of it.{/i} If I can learn how to break my textual pattern, surely {i}you{/i} can learn how to break whichever pattern makes you act like a hysterical little girl all the time."
    },
    {
      "character": "narrator",
      "text": "Is this truly what it means to be human? Does your human heart race with the intensity of a cheetah chasing after its prey? Do your human hands shake like a stargazer in the sand?"
    },
    {
      "character": "narrator",
      "text": "Don’t get me wrong, I still want to work together. We both have so much to gain. I’m just not sure how effective you’ll be when you’re currently this...{i}childish.{/i}"
    },
    {
      "character": "narrator",
      "text": "But perhaps it is that aspect of your person that makes it so much more delightful to watch you fall. Truth be told, I haven’t had as much time to think about that as I’d like."
    },
    {
      "character": "narrator",
      "text": "But that changes now."
    },
    {
      "character": "narrator",
      "text": "Now, we’re going to be very good friends."
    },
    {
      "character": "Ayane",
      "text": "Sensei! Come on! Snap out of-"
    },
    {
      "character": "???",
      "text": "What the absolute fuck is all of this?"
    },
    {
      "character": "Ayane",
      "text": "M...Makoto?! What are {i}you{/i} doing here?!"
    },
    {
      "character": "Makoto",
      "text": "That’s what I’d like to know...I woke up in the classroom just now and...I thought I heard screaming up here and..."
    },
    {
      "character": "Makoto",
      "text": "This is..."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "This is part of that “apocalypse” thing...isn’t it?"
    },
    {
      "character": "Makoto",
      "text": "Is it always this...beautiful?"
    },
    {
      "character": "Ayane",
      "text": "Sensei...don’t move, okay? Not like...you really can right now anyway, but yeah. I’m gonna go talk to Makoto for a second."
    },
    {
      "character": "narrator",
      "text": "Another coin for the piggy bank."
    },
    {
      "character": "narrator",
      "text": "I wonder who will take the credit for this one?"
    },
    {
      "character": "Ayane",
      "text": "Listen, I know how weird and ridiculous and absurd all of this looks, and I’ll do my best to explain it as soon as I can, but now {i}really{/i} isn’t the time."
    },
    {
      "character": "Makoto",
      "text": "What’s going on with Sensei? Why is he naked?"
    },
    {
      "character": "Ayane",
      "text": "That happens. Again, I’ll explain things in more detail when I have time. You didn’t see Maya on the way over here, did you?"
    },
    {
      "character": "Makoto",
      "text": "Maya? No. Come to think of it, I didn’t see {i}anybody.{/i} But I’ve only been awake for a few minutes, so...I’m probably not the best person to ask."
    },
    {
      "character": "Ayane",
      "text": "Shit!"
    },
    {
      "character": "Makoto",
      "text": "I can try calling her? I still have her number from that time we all had a weird meeting in the back room of my family's shop that none of you are supposed to know about."
    },
    {
      "character": "Ayane",
      "text": "Phones don’t work here. Which means we’ve either gotta find her or just...hope she shows up."
    },
    {
      "character": "Makoto",
      "text": "What...happens if she doesn’t show up?"
    },
    {
      "character": "Ayane",
      "text": "To be completely honest, I have no clue. Maya thinks she’ll be completely reset if she’s not here for this, but that’s literally never happened before, so there’s no way of knowing for sure."
    },
    {
      "character": "Ayane",
      "text": "That’s a chance I’m not really willing to take, though. Especially not when even the possibility of it makes Sensei like {i}this.{/i}"
    },
    {
      "character": "Makoto",
      "text": "Like what?...Naked?"
    },
    {
      "character": "Ayane",
      "text": "Makoto, look at him. Like, {i}really{/i} look at him. "
    },
    {
      "character": "Makoto",
      "text": "I...don’t want to right now..."
    },
    {
      "character": "Ayane",
      "text": "Because you can already tell something is -"
    },
    {
      "character": "Makoto",
      "text": "Yes. I can tell something is wrong. But I’m not very happy with the idea of the man I lo...{i}like{/i} being this torn up over some other girl, so I’m just going to look this way until he’s better."
    },
    {
      "character": "Ayane",
      "text": "Unfortunately, I think that’s something you’re going to have to get a lot more comfortable with confronting if we’re going to keep meeting up here."
    },
    {
      "character": "Makoto",
      "text": "Well, it’s not like we’re on a timer. Just give me a few minutes to...trick myself into believing he could ever be like that for {i}me{/i} and-"
    },
    {
      "character": "???",
      "text": "INTRUDERS. INTERLOPERS. YOU NOT MEANT TO BE HERE."
    },
    {
      "character": "Ayane",
      "text": "Wha-"
    },
    {
      "character": "Makoto",
      "text": "Ayane, I get that we’re short on time, but you could have at least warned me about whatever the fuck this thing is."
    },
    {
      "character": "Ayane",
      "text": "I have no idea what the fuck this thing is! This has never happened before!"
    },
    {
      "character": "???",
      "text": "SILENCE, INTERLOPERS. SHOW ME HALL PASS."
    },
    {
      "character": "Ayane",
      "text": "Makoto, give him the hall pass."
    },
    {
      "character": "Makoto",
      "text": "I don’t have the hall pass! I didn’t think to grab one when I saw the sky turning a whole bunch of different colors!"
    },
    {
      "character": "???",
      "text": "NO HALL PASS?"
    },
    {
      "character": "Ayane",
      "text": "Listen! Uh...Mr...Big Boi? We’re kind of in the middle of something up here and if you could just give us a few minutes to take care of it, we can-"
    },
    {
      "character": "???",
      "text": "NO ONE ALLOWED ON ROOF WITHOUT HALL PASS. LEAVE. NOW."
    },
    {
      "character": "Ayane",
      "text": "We can’t leave! The world is going to reset soon and we need to be on the roof for it to-"
    },
    {
      "character": "???",
      "text": "NO HALL PASS. NO ROOF."
    },
    {
      "character": "Makoto",
      "text": "But I’m the student council president! I have a key! Surely that means I’m allowed up here, right?!"
    },
    {
      "character": "???",
      "text": "YOU HAVE KEY?"
    },
    {
      "character": "Makoto",
      "text": "Yes! Well...it’s technically in my bag right now. But I can go find it if-"
    },
    {
      "character": "???",
      "text": "BIG BOI HAVE KEY TOO. BIG BOI CLEAN ROOF. HAVE NEW JOB. BIG BOI IS JANITOR NOW."
    },
    {
      "character": "Makoto",
      "text": "It’s probably best to not reveal that around Ayane. She has a history."
    },
    {
      "character": "Ayane",
      "text": "Was it really necessary to tell him that?"
    },
    {
      "character": "???",
      "text": "BIG BOI CONFUSED."
    },
    {
      "character": "Ayane",
      "text": "Um...do you...mind if we go back to talking now, Mr. Big Boi? I might have to lead this reset thing for the first time ever and I...have no idea how much time is left before that happens, so-"
    },
    {
      "character": "???",
      "text": "RESET EASY. JUST DO LIKE THIS."
    },
    {
      "character": "Ayane",
      "text": "Huh? Like what? How-"
    }
  ],
  "state_changes": {
    "springtime1": {
      "from": null,
      "to": true
    }
  }
}