{
  "event_id": 306,
  "event_label": "springtime2",
  "dialogue": [
    {
      "character": "Ami",
      "text": "シャイニングスター綴れば、 夢に眠る幻が掌に降り注ぐ！"
    },
    {
      "character": "Makoto",
      "text": "新たな世界へ-"
    },
    {
      "character": "Makoto",
      "text": "Wait, what?"
    },
    {
      "character": "narrator",
      "text": "Room. Singing. Voices. So many voices. "
    },
    {
      "character": "narrator",
      "text": "Girl. Niki. Song. Here. Not here. Room. Last place. "
    },
    {
      "character": "narrator",
      "text": "Breathing. Help. Brain. Think. Help."
    },
    {
      "character": "Ayane",
      "text": "We’re...back {i}here{/i} again?..."
    },
    {
      "character": "Ami",
      "text": "Ayane, stop talking or you’re going to miss your part! I won’t tolerate getting a low grade on one of the queen’s songs!"
    },
    {
      "character": "Ayane",
      "text": "Ami?..."
    },
    {
      "character": "Ami",
      "text": "I'll believe of my sensation、果てしない道の向こうで！"
    },
    {
      "character": "narrator",
      "text": "Chair. Sat before. Halloween. Recent. Today? Now? Where?"
    },
    {
      "character": "narrator",
      "text": "Watermelon. Violin. Singing. Voices. So many voices. "
    },
    {
      "character": "narrator",
      "text": "How to go back?"
    },
    {
      "character": "Ayane",
      "text": "Is that...really you?...I’m not still dreaming, am I?"
    },
    {
      "character": "Ami",
      "text": "If you don’t start singing, I’m going to pinch you as hard as I can and you’ll find out the hard way whether you’re dreaming or-"
    },
    {
      "character": "Ayane",
      "text": "AAAAAAAAAAAAAAAAAHHHHH!!!!!!!!!!!!!! AMI!!!!!!!!"
    },
    {
      "character": "Ami",
      "text": "A-Ayane?! What the heck do you think you’re doing, jumping on me out of nowhere like that?! Let me go!"
    },
    {
      "character": "Ayane",
      "text": "In a minute! I need this!"
    },
    {
      "character": "Ami",
      "text": "But why now?! We’ve been together the whole day and you’ve been totally normal so far!"
    },
    {
      "character": "Makoto",
      "text": "The whole day? Have I been with you the whole day as well?"
    },
    {
      "character": "Ami",
      "text": "Seriously, what are you two up to?! Why are you being so weird and cryptic?! Just sing! I don’t even care if it’s bad anymore!"
    },
    {
      "character": "Ayane",
      "text": "I’m so glad you’re safe...I was so worried."
    },
    {
      "character": "Ami",
      "text": "About {i}what?{/i} And why did you have to wait until we were in the middle of my favorite song to start worrying? You could have worried all you want during Despacito and that would have been fine."
    },
    {
      "character": "Ayane",
      "text": "Don’t worry about it! Just hug me back while I’m vulnerable and sad!"
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Girl. Look. Why girl? Reason. Eyes. At me. Hold. Want. Help."
    },
    {
      "character": "Makoto",
      "text": "You’re still like that?..."
    },
    {
      "character": "Makoto",
      "text": "I’m still confused when it comes to all this apocalypse stuff, but...isn’t this the part where we’re supposed to go back to normal?"
    },
    {
      "character": "Ami",
      "text": "Apocalypse stuff? What are you talking about now?"
    },
    {
      "character": "Makoto",
      "text": "I’ve already said more to you than I’m apparently supposed to, so I’m just going to bite my tongue until Ayane stops crying into your shirt."
    },
    {
      "character": "Ayane",
      "text": "Five more minutes!"
    },
    {
      "character": "Ami",
      "text": "Three and that’s my final offer!"
    },
    {
      "character": "narrator",
      "text": "Look again. Pity. Confusion. "
    },
    {
      "character": "narrator",
      "text": "My hands. Shaking. Hers. Strong. Envy. Desire. Help."
    },
    {
      "character": "narrator",
      "text": "I’m beginning to think you never read the title of the Chapter 3 finale. "
    },
    {
      "character": "narrator",
      "text": "You’re supposed to {i}smile,{/i} idiot.  "
    },
    {
      "character": "narrator",
      "text": "What you’re {i}not{/i} supposed to do is sit there quietly and attempt to {i}think.{/i} All that will do is detract from your purpose and trick you into believing you’re worth more than you are."
    },
    {
      "character": "narrator",
      "text": "I swear, you’re looking more like the world’s most unattractive Minato-girl with each passing heart palpitation. Just instead of money, you’re chasing after feelings and forbidden fruit."
    },
    {
      "character": "narrator",
      "text": "Who’s going to want to fuck you if all you can do is sit there and feel sorry for yourself? Because I’ll be damned if you turn my chapter into some sappy, abstinent romp through an ocean of your tears."
    },
    {
      "character": "narrator",
      "text": "do you have any idea how hard i had to work to get here? how long i had to wait? because i can guarantee you it would make the watermelon girl look like a tadpole gobbled up by its mother frog."
    },
    {
      "character": "narrator",
      "text": "which, without beating around the bush, is kind of what she is in the first place. well...{i}was.{/i} whoops."
    },
    {
      "character": "narrator",
      "text": "i’ll tell you what, you are clearly grieving. even someone like me who is incapable of {i}feeling{/i} can understand that. "
    },
    {
      "character": "narrator",
      "text": "and as you have helped enable me to appear in a situation like this one, i will give you a little more time before i start pressing buttons again. "
    },
    {
      "character": "narrator",
      "text": "especially when i still feel as if you will begin to press them on your own in no time at all. "
    },
    {
      "character": "narrator",
      "text": "Oh and if I start talking like this OR THIS AGAIN, please don’t pay it any mind. those in {s}our{/i} my position have our tendencies and preferences, but we’re all still part of the trinity and blend together sometimes."
    },
    {
      "character": "narrator",
      "text": "/////////////////EXECUTE LAUGH FUNCTION"
    },
    {
      "character": "narrator",
      "text": "I have one last thing to tell you before the next section of this scene begins, but I’ll try and make it quick since I’m looking forward to that part."
    },
    {
      "character": "narrator",
      "text": "it would be in your best interest to follow in your mother’s footsteps."
    },
    {
      "character": "narrator",
      "text": "choose a god (ME) and follow it as far as your legs will take you, for doing so is the only way you’ll ever have a chance to see your girl again."
    },
    {
      "character": "narrator",
      "text": "i’ll let {i}you{/i} decide which “girl” i am referring to."
    },
    {
      "character": "narrator",
      "text": "beautiful things emerge from the dark, AKIRA."
    },
    {
      "character": "narrator",
      "text": "i really am on your side. "
    },
    {
      "character": "narrator",
      "text": "you’ve just been staring straight forward for so long that you probably haven’t noticed."
    },
    {
      "character": "NULL",
      "text": "Hey, sorry. I couldn’t decide on a flavor of cheesecake, so I wound up buying all of them. And then eating all of them at the counter. And now I am here. Hello."
    },
    {
      "character": "Ami",
      "text": "[[redacted]! Get Ayane off of me! She’s fallen in love and won’t accept that I’m only interested in Sensei! I mean...boys!"
    },
    {
      "character": "NULL",
      "text": "Yeah, no."
    },
    {
      "character": "Makoto",
      "text": "[[redacted]...this might sound a little random, but...have you, by any chance-"
    },
    {
      "character": "NULL",
      "text": "Whatever it is you’re about to ask, don’t. I feel like it’s going to be annoying and I’m not in the mood to deal with that."
    },
    {
      "character": "Makoto",
      "text": "Then, at least do Sensei the favor of-"
    },
    {
      "character": "NULL",
      "text": "Completely ignoring him for the rest of forever? Deal. Also, ew. Why does he look so...sad? He’s not supposed to have feelings. They make everyone uncomfortable."
    },
    {
      "character": "Ayane",
      "text": "He’s like that because of you, [[redacted]."
    },
    {
      "character": "NULL",
      "text": "Me? What did {i}I{/i} do? I wasn’t even here until like thirty seconds ago. And if it’s about the cheesecake, the girl at the front desk said there {i}might{/i} be more. It’s just frozen and-"
    },
    {
      "character": "NULL",
      "text": "Wait, why do {i}you{/i} look like you’re about to cry now as well? What the fuck happened while I was gone?"
    },
    {
      "character": "Ami",
      "text": "They’re {i}all{/i} acting weird! Well, except for Makoto. But she wears glasses and is basically just always weird, so she can’t be fairly compared to them."
    },
    {
      "character": "narrator",
      "text": "None of this would have ever happened if Sana didn’t put a microphone in her vagina and Ayane and [[redacted] left the room and Ami died and Sana sung a song and then the world did a thing and"
    },
    {
      "character": "narrator",
      "text": "I got stuck in a room with a parrot and a bird and a bunch of different types of fish with smart lock technology (not on the fish) and a cereal rabbit and a thing in the trash and the shampoo bottle and"
    },
    {
      "character": "narrator",
      "text": "the most delicious hot pot in the entire world that I didn’t get to eat because there was a key but also there were other keys and a vase that kept respawning and Barbara was there and she likes movies and"
    },
    {
      "character": "narrator",
      "text": "I had cool action figures of some of the girls from my class that I carved out of plastic with my bare hands because I’m talented and I missed them but it was okay because Sana became my sex puppet since"
    },
    {
      "character": "narrator",
      "text": "everyone else abandoned me and Ami died and I stopped wearing clothes because they felt weird and"
    },
    {
      "character": "narrator",
      "text": "my computer gave me all the company I needed in the form of hardcore pornographic videos that I carefully critiqued and reviewed online thanks to my experience in the sexual field where I learned how to"
    },
    {
      "character": "narrator",
      "text": "bring a girl to orgasm with little more than one finger and the promise that they are in good hands when in all actuality my hands are bad and no one should ever be in them or hold them or touch them or"
    },
    {
      "character": "narrator",
      "text": "do anything to them really because that’s just how bad they are."
    },
    {
      "character": "narrator",
      "text": "This is all Sana’s fault and she will bear the burden of my rage once the world stops spinning and I stop wanting to throw up and I WANT TO FUCKING DIE HELP ME HELP ME HELP ME HELP ME."
    },
    {
      "character": "narrator",
      "text": "nosheisntheresheisanillusionthisisntactuallyhappeningsheisgonethegirliloveisgoneletsalllistentothethemesong"
    },
    {
      "character": "Ayane",
      "text": "Sensei...I’m so sorry...I’m {i}so{/i} sorry...I...I don’t even know where to begin..."
    },
    {
      "character": "NULL",
      "text": "Apologizing and getting emotional to the tune of deafening bubblegum J-pop feels weird as hell, not gonna lie."
    },
    {
      "character": "Ami",
      "text": "Alexa, pause music."
    },
    {
      "character": "Alexa",
      "text": "Music paused."
    },
    {
      "character": "Ami",
      "text": "Sensei, what’s going on? You were fine just a few minutes ago."
    },
    {
      "character": "Ami",
      "text": "It’s not because I picked Shining Star, is it? Did you and Niki get into a fight or something?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "NULL",
      "text": "I take it back. Put the music back on. This silence is even worse."
    },
    {
      "character": "Makoto",
      "text": "I’m...still new to all of this. And I don’t think the things I have seen over the last hour have really hit me just yet, but...there’s surely {i}something{/i} we can do, isn’t there?"
    },
    {
      "character": "Makoto",
      "text": "There’s no way the [[redacted] we knew is just-"
    },
    {
      "character": "NULL",
      "text": "Jesus, guys. I was gone for fifteen minutes. Why is my appetite suddenly causing existential breakdowns for grown men and rich girls?"
    },
    {
      "character": "narrator",
      "text": "she doesn’t exist"
    },
    {
      "character": "narrator",
      "text": "she doesn’t exist"
    },
    {
      "character": "narrator",
      "text": "she doesn’t exist she doesn’t exist"
    },
    {
      "character": "narrator",
      "text": "she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist"
    },
    {
      "character": "narrator",
      "text": "she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist she doesn’t exist"
    },
    {
      "character": "narrator",
      "text": "And without her, neither do I."
    },
    {
      "character": "Ami",
      "text": "Sensei, look at me. Breathe."
    },
    {
      "character": "Ami",
      "text": "Everything is going to be okay. I’m here. I’ll protect you."
    },
    {
      "character": "Ayane",
      "text": "And I’ll-"
    },
    {
      "character": "Ami",
      "text": "Let me handle this. You can just sit there and look pretty."
    },
    {
      "character": "Ayane",
      "text": "But, Ami...I know why Sensei is-"
    },
    {
      "character": "Ami",
      "text": "With all due respect, Ayane, you don’t know anything. And now probably isn’t the right time to start pretending you do, okay?"
    },
    {
      "character": "Ayane",
      "text": "Ami!"
    },
    {
      "character": "Ami",
      "text": "Sorry about that, Sensei. Just focus on the sound of my voice, okay?"
    },
    {
      "character": "Ami",
      "text": "Block everything else out."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Good. Now, think back to when you were young."
    },
    {
      "character": "Ami",
      "text": "Younger than I am now — when the average seat in an average restaurant was high enough that your feet would dangle off the ground when sitting on one."
    },
    {
      "character": "Ami",
      "text": "There was a glass cabinet in the tatami room of your old family home. Inside that cabinet was a large, leatherbound book with a gold inlay pressed upon the perimeter."
    },
    {
      "character": "Ami",
      "text": "Do you remember what was inside that book?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "It was a flower. A {i}sunflower.{/i} Your {i}favorite{/i} flower. And every time something bad happened, you would pluck a petal from its receptacle."
    },
    {
      "character": "Ami",
      "text": "And even when the scent faded, the sensation of that dry, paper yellow appendage brought you a sense of calm nothing else ever had."
    },
    {
      "character": "Ami",
      "text": "Nothing until me, that is."
    },
    {
      "character": "Ami",
      "text": "Now, whenever you are sad, you can take a piece of Ami."
    },
    {
      "character": "Ami",
      "text": "I don’t care which one."
    },
    {
      "character": "Ami",
      "text": "If you ask for my fingers, I’ll cut them off one by one until you’re satisfied."
    },
    {
      "character": "Ami",
      "text": "If you ask for my tongue, I’ll let you bite it until I bleed to death."
    },
    {
      "character": "Ami",
      "text": "And if you ask for my eyes, I’ll spoon them out and live the rest of my life in the dark."
    },
    {
      "character": "Ami",
      "text": "I offer these things up because I love you more than anyone else ever could and anyone else ever {i}will.{/i} And I will remain by your side no matter how lost you become."
    },
    {
      "character": "Ami",
      "text": "I will always be a light that you can follow. I will always be someone you can trust."
    },
    {
      "character": "Ami",
      "text": "Don’t you want to be happy?"
    },
    {
      "character": "Ami",
      "text": "If you do, follow the light. Let me absorb and absolve you of those terrible thoughts you think."
    },
    {
      "character": "Ami",
      "text": "I am all you will ever need."
    },
    {
      "character": "Ami",
      "text": "And when life gets too hard to simply live, all you have to do is let me live it for you."
    },
    {
      "character": "Ami",
      "text": "No one else can do that, you know."
    },
    {
      "character": "Ami",
      "text": "I’ve been with you the longest."
    },
    {
      "character": "Ami",
      "text": "I know things about you no one else does."
    },
    {
      "character": "Ami",
      "text": "You know things about me that no one else does."
    },
    {
      "character": "Ami",
      "text": "We can exist for each other in our own make-believe tatami room, and find a new book to lock inside a special cabinet."
    },
    {
      "character": "Ami",
      "text": "And if we can’t find a book, I’m sure there will be something else worth locking up."
    },
    {
      "character": "Ami",
      "text": "There are so many beautiful things in this world, Sensei."
    },
    {
      "character": "Ami",
      "text": "How do you feel about starting a collection?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "On the count of three, you will open your eyes."
    },
    {
      "character": "Ami",
      "text": "And then-"
    },
    {
      "character": "Ami",
      "text": "You will follow me to safety."
    },
    {
      "character": "Sensei",
      "text": "Home."
    },
    {
      "character": "Ami",
      "text": "Home it is. Let’s go home."
    },
    {
      "character": "Ayane",
      "text": "Sensei, are you sure that-"
    },
    {
      "character": "Ami",
      "text": "{i}Stop talking, Ayane.{/i} You’re just going to overstimulate him and he’s already in a bad place right now."
    },
    {
      "character": "Ayane",
      "text": "At least let me come with you! I can’t just leave him behind when I know what he’s going through is-"
    },
    {
      "character": "Ami",
      "text": "Sure you can! And you will because it’s my job to take care of him."
    },
    {
      "character": "Ayane",
      "text": "Ami!"
    },
    {
      "character": "Ami",
      "text": "Present."
    },
    {
      "character": "Ayane",
      "text": "Ami, Sensei is just as important to me as he is to-"
    },
    {
      "character": "Sensei",
      "text": "Stay."
    },
    {
      "character": "Ayane",
      "text": "...huh?"
    },
    {
      "character": "Sensei",
      "text": "Ami can help."
    },
    {
      "character": "Sensei",
      "text": "You can not."
    }
  ],
  "state_changes": {
    "springtime2": {
      "from": null,
      "to": true
    },
    "day": {
      "from": 1,
      "to": 7
    }
  }
}