{
  "event_id": 309,
  "event_label": "springtime5",
  "dialogue": [
    {
      "character": "Maya",
      "text": "Hey. So, remember that time I said we’d be seeing our creepy teacher tomorrow? But then a whole bunch of tomorrows happened and we still haven’t seen him? And now tomorrow’s Christmas?"
    },
    {
      "character": "Ayane",
      "text": "Yes, Maya. I do remember that. And I applaud your ability to keep track of time now that time actually somewhat {i}matters{/i} to you again."
    },
    {
      "character": "Maya",
      "text": "Thanks. But what does that mean for {i}you?{/i} Because {i}I’m{/i} totally fine, but {i}you’re{/i} still acting like you just watched a puppy getting curb-stomped outside of your bedroom window."
    },
    {
      "character": "Ayane",
      "text": "Part of me wants to call you a psychopath for using such a specific analogy to describe me. Yet, the rest of me is impressed that you managed to describe my current state of mind so perfectly."
    },
    {
      "character": "Maya",
      "text": "I guess I’ve gotten to know you pretty well over the last seven weeks since you’ve decided to sew yourself onto my hip. I wouldn’t blame you for cutting the stitches, though."
    },
    {
      "character": "Maya",
      "text": "In fact, I encourage it. Please set me free so I can go back to only existing when I want to exist. Which is almost never, now that I think about it."
    },
    {
      "character": "Ayane",
      "text": "No. "
    },
    {
      "character": "Maya",
      "text": "What do you mean “no?” You can’t just randomly strip my free will one day and then go blaming it on time travel instead of giving me a proper explanation."
    },
    {
      "character": "Maya",
      "text": "We’ve been spending entirely too much time together lately and I’m starting to think you might just secretly have feelings for me."
    },
    {
      "character": "Ayane",
      "text": "I’m straight, Maya."
    },
    {
      "character": "Maya",
      "text": "Everyone is straight until they’re not."
    },
    {
      "character": "Ayane",
      "text": "What does that even mean?"
    },
    {
      "character": "Maya",
      "text": "I don’t know. But this is me formally requesting an unpaid leave of absence so I don’t have to listen to your maniacal ramblings for at least the next...week or so. "
    },
    {
      "character": "Maya",
      "text": "I will also accept a paid leave of absence in lieu of an unpaid one if that’s the way things must be. I just want to be alone again."
    },
    {
      "character": "Ayane",
      "text": "Do you really not care about Sensei? Neither of us have seen him since the day after Halloween. He could be a total wreck for all we know."
    },
    {
      "character": "Maya",
      "text": "{i}Him?{/i} A wreck? Please. The most emotion I’ve ever seen out of that guy was a slight scowl when I borrowed his wallet for a solo takoyaki party. And even that only lasted a couple seconds."
    },
    {
      "character": "Ayane",
      "text": "It all just feels so...wrong. "
    },
    {
      "character": "Ayane",
      "text": "I know Ami’s taking care of him, but not even letting us {i}see{/i} him just feels...sketchy. Don’t you think?"
    },
    {
      "character": "Maya",
      "text": "Yeah well, expecting to be able to rationalize the actions and mannerisms of a girl who wants to harbor her uncle’s children isn’t something that one would assume to be easy."
    },
    {
      "character": "Ayane",
      "text": "Did you want to try again today?"
    },
    {
      "character": "Maya",
      "text": "You’re really going to make me walk all the way over there just to get turned away like {i}every other time{/i} we’ve tried this?"
    },
    {
      "character": "Ayane",
      "text": "It’s Christmas Eve. Maybe Ami is...feeling generous or something."
    },
    {
      "character": "Maya",
      "text": "Or maybe you’re just desperate to see another puppy get curb-stomped. Going over there isn’t going to accomplish anything. It’s a waste of time."
    },
    {
      "character": "Ayane",
      "text": "Even if it {i}is{/i} a waste of time, I’m not the type who can just sit back and...not do anything when someone I love is in trouble."
    },
    {
      "character": "Ayane",
      "text": "I don’t need to be able to {i}help{/i} or...or even {i}talk{/i} to him for that matter. At this point, I’d be happy just seeing that he’s alive and not completely wiped from existence like Maya-Prime was."
    },
    {
      "character": "Maya",
      "text": "Are you implying that I am somehow {i}sub-{/i}prime? Because there are girls all over the world who would {i}kill{/i} for my looks and personality."
    },
    {
      "character": "Ayane",
      "text": "At least your ego hasn’t changed much."
    },
    {
      "character": "Maya",
      "text": "Hah...fine. We can go to Ami’s stupid house again once school is over. But I’m tired of trying to distract her while you fiddle with the six million locks she put on his door. "
    },
    {
      "character": "Maya",
      "text": "We go in, ask if we can talk to him, get rejected, and leave. Sound good? Good. Meeting adjourned."
    },
    {
      "character": "Ayane",
      "text": "Thank you, Maya. "
    },
    {
      "character": "Ayane",
      "text": "And, for the record, I don’t think you’re {i}sub-{/i}prime. I just miss the {i}you{/i} I spent so much time with and...even if you’re a fragment of that person, this will still take some getting used to for me."
    },
    {
      "character": "Maya",
      "text": "Can’t see why. The {i}me{/i} you keep bringing up all the time sounded all...boring and bitchy. But I {i}do{/i} admire her apparent affinity for secrecy and am glad to hear her love for melons never faded."
    },
    {
      "character": "Ayane",
      "text": "I wish it was possible for you to meet her. I think you would have liked seeing how all those years and timelines changed you. There was a lot to like about my Maya."
    },
    {
      "character": "Maya",
      "text": "And a lot to abhor as well, I’m sure. But I suppose I’ll leave the rest of that discussion for three hours from now when you inevitably bring it back up."
    },
    {
      "character": "Maya",
      "text": "Until then, all we can do is wait for school to end."
    },
    {
      "character": "Ayane",
      "text": "And figure out how we’re going to handle Ami once we see her..."
    },
    {
      "character": "Maya",
      "text": "Yeah..."
    },
    {
      "character": "Maya",
      "text": "I’ll leave that part to you."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Helloooo?..."
    },
    {
      "character": "Ayane",
      "text": "Ami?..."
    },
    {
      "character": "Ayane",
      "text": "Sensei?..."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Is anyone home?"
    },
    {
      "character": "Maya",
      "text": "Guess not. Time to leave. Let’s go."
    },
    {
      "character": "Ayane",
      "text": "We can’t leave yet. If Ami {i}isn’t{/i} here, I might actually be able to get us into Sensei’s room. Even if he’s out as well, there might be some sort of...clue in there."
    },
    {
      "character": "Maya",
      "text": "You do that, Nancy Drew. I’ll wait here and {i}not{/i} commit a felony. Which, honestly, we might already be doing since I’m pretty sure Ami doesn’t want you to have a key to her house right now."
    },
    {
      "character": "Ayane",
      "text": "Right now, my key to this house is the one thing keeping the flame of hope alive in my heart."
    },
    {
      "character": "Maya",
      "text": "Have you always been this corny? Or did living through several apparent apocalypses cause you to give up entirely on the idea of comedy?"
    },
    {
      "character": "Ayane",
      "text": "This is a tough time for me, okay? Leave me alone."
    },
    {
      "character": "Ami",
      "text": "What are you two doing here?"
    },
    {
      "character": "Ayane",
      "text": "Ami?"
    },
    {
      "character": "Maya",
      "text": "Should have left when we had the chance."
    },
    {
      "character": "Ami",
      "text": "I told you to warn me before coming over."
    },
    {
      "character": "Ami",
      "text": "You didn’t warn me at all. "
    },
    {
      "character": "Ami",
      "text": "Why?"
    },
    {
      "character": "Ayane",
      "text": "Ami...we want to see Sensei."
    },
    {
      "character": "Ami",
      "text": "He’s not feeling well right now."
    },
    {
      "character": "Ayane",
      "text": "Yeah. He wasn’t feeling well the other trillion times I came over here either. "
    },
    {
      "character": "Ami",
      "text": "Then maybe you’re bad luck and it’s {i}your{/i} fault he’s sick! Teehee!"
    },
    {
      "character": "Ayane",
      "text": "Ami...it’s been nearly two months. If Sensei still isn’t feeling well, you might want to consider taking him to the hospital so-"
    },
    {
      "character": "Ami",
      "text": "Are you telling me I don’t know what I’m doing?"
    },
    {
      "character": "Ayane",
      "text": "That’s not what I-"
    },
    {
      "character": "Ami",
      "text": "I don’t care what you’re saying. This is {i}my{/i} house and you are going to follow {i}my{/i} rules while you’re inside of it."
    },
    {
      "character": "Ami",
      "text": "I may have been more lenient when Sensei was healthy, but he {i}needs{/i} me right now. And if you are trying to get in the way of that, I won’t be very kind to you."
    },
    {
      "character": "Ayane",
      "text": "Why would I ever want to get in the way of that? I love Sensei. He means everything to me."
    },
    {
      "character": "Ami",
      "text": "Really?"
    },
    {
      "character": "Ami",
      "text": "Then, would you die for him?"
    },
    {
      "character": "Ayane",
      "text": "What?"
    },
    {
      "character": "Ami",
      "text": "If the two of you were walking down the sidewalk and a car flipped over the guardrail and started barreling toward you, would you push him out of the way and sacrifice your life so he can live?"
    },
    {
      "character": "Ayane",
      "text": "I don’t-"
    },
    {
      "character": "Ami",
      "text": "If you were hostages in a bank robbery and someone needed to die in order to get the negotiators to listen, would you offer up yourself in his place?"
    },
    {
      "character": "Ayane",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "If your god demanded fresh meat in exchange for power and safety, how likely would you be to allow the complete consumption of your body in place of Sensei’s? And which god would you be feeding?"
    },
    {
      "character": "Maya",
      "text": "This is exactly why I said I didn’t want to be a part of this."
    },
    {
      "character": "Ayane",
      "text": "Just let me see him, Ami...Please. As a friend."
    },
    {
      "character": "Ami",
      "text": "Now, {i}why{/i} would I do that? "
    },
    {
      "character": "Ayane",
      "text": "Because I’m worried! It’s been almost two months! Christmas is tomorrow! You haven’t even decorated the house yet! What’s going on?!"
    },
    {
      "character": "Ami",
      "text": "Decorate?..."
    },
    {
      "character": "Ami",
      "text": "You expect me to...decorate?..."
    },
    {
      "character": "Ami",
      "text": "At a time like this?..."
    },
    {
      "character": "Ami",
      "text": "My uncle is fighting the greatest battle he’s faced in a {i}very{/i} long time right now, and you’re concerned about a lack of....{i}decorations?{/i}"
    },
    {
      "character": "Ami",
      "text": "Are you fucking dense?"
    },
    {
      "character": "Ayane",
      "text": "It was just...an example, Ami. Tomorrow is a special day and, while the rest of Kumon-mi is about to celebrate, you’re over here pretending it’s still November 1st."
    },
    {
      "character": "Ami",
      "text": "I’m over here keeping someone {i}alive.{/i}"
    },
    {
      "character": "Ami",
      "text": "And it’s starting to sound like you might have a problem with that."
    },
    {
      "character": "Ayane",
      "text": "Just let me see him...please. And you’ll never have to get me another Christmas present again."
    },
    {
      "character": "Ami",
      "text": "No."
    },
    {
      "character": "Ayane",
      "text": "{i}Why?!{/i}"
    },
    {
      "character": "Ami",
      "text": "Because there’s nothing to see."
    },
    {
      "character": "Ami",
      "text": "Sensei just needs a little more time by himself until he’s feeling confident and safe enough to leave his room! And I, his beloved niece, am doing everything in my power to help with that!"
    },
    {
      "character": "Ami",
      "text": "So I appreciate the concern, but if you keep trying to disrupt his healing process, I’m going to have to call the police and make sure you’re never allowed to set foot in this house again! Okay? Okay!"
    },
    {
      "character": "Maya",
      "text": "Can we leave a message at least?"
    },
    {
      "character": "Ami",
      "text": "I suppose that depends on what the message is."
    },
    {
      "character": "Maya",
      "text": "Hey, don’t look at me. Ayane’s the one who wants to see the guy. I’m just here for moral support."
    },
    {
      "character": "Ami",
      "text": "Are you?"
    },
    {
      "character": "Ayane",
      "text": "Just...tell him we miss him. And that we want him back as soon as possible."
    },
    {
      "character": "Ayane",
      "text": "And...and that it’s okay if he takes his time! But myself and everyone else would really appreciate it if he could just...communicate to us in some way that he’s doing okay!"
    },
    {
      "character": "Ami",
      "text": "You don’t trust me, do you?"
    },
    {
      "character": "Ami",
      "text": "You think I’m keeping Sensei locked away because I’m crazy. Because I’m obsessed. That’s what you think, isn’t it? "
    },
    {
      "character": "Ami",
      "text": "And you know what? Maybe you’re right. Maybe I {i}am{/i} crazy. Because I’m {i}definitely{/i} obsessed, and those two things aren’t that far apart, are they?"
    },
    {
      "character": "Ami",
      "text": "But I’m {i}allowed{/i} to be crazy. Ami Arakawa’s a real sob story."
    },
    {
      "character": "Ami",
      "text": "Once a certain amount of bad things happen to you, people tend to start giving you a free pass when it comes to acting a little differently than others."
    },
    {
      "character": "Ami",
      "text": "It would have been nice if there was something I could have traded for that that didn’t also birth me, though."
    },
    {
      "character": "Ayane",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "If there’s nothing else you’d like to leave in the message, would you kindly get the fuck out of my house now? And never come here again without asking me first?"
    },
    {
      "character": "Ayane",
      "text": "You can’t keep him here forever, Ami...He’s going to have to leave some day."
    },
    {
      "character": "Ami",
      "text": "That’s for him to decide. Not you."
    },
    {
      "character": "narrator",
      "text": "{i}THERE IS A KNOCK AT THE DOOR{/i}"
    },
    {
      "character": "Ami",
      "text": "Come in!"
    },
    {
      "character": "Ami",
      "text": "Oh! It’s my queen and her little sister — two people who did what they were supposed to do and called me before showing up at my house! I sure wish my {b}BEST FRIENDS{/b} would do the same!"
    },
    {
      "character": "Noriko",
      "text": "Hey, Ami. Is Akira still-"
    },
    {
      "character": "Noriko",
      "text": "Uhh..."
    },
    {
      "character": "Noriko",
      "text": "Is Akira still not feeling well?"
    },
    {
      "character": "Niki",
      "text": "What the fuck was {i}that{/i} about?"
    },
    {
      "character": "Ami",
      "text": "Sensei is probably asleep right now. He had a long morning. But if you guys want to leave your presents on the dining room table, I’ll make sure he knows they were from you."
    },
    {
      "character": "Noriko",
      "text": "Is there any word on when he’ll be coming back to school by any chance? Because I’m pretty sure Imani is at the end of her rope. And Wakana- er...Miss Watabe’s seemed a little off as well."
    },
    {
      "character": "Ami",
      "text": "Nope! But I’ll still be showing up every once in a while to pick up all the homework and stuff. Can’t let being a full-time caretaker spoil my education of course!"
    },
    {
      "character": "Ami",
      "text": "Which isn’t to say my grades are impressive at all, but...yeah."
    },
    {
      "character": "Niki",
      "text": "You know I wouldn’t mind helping as well, right? Any time he caught a cold when we were little, I’d go over to his place and watch over him until he felt better. So I’ve got some experience already."
    },
    {
      "character": "Niki",
      "text": "And yes, I am aware that is completely different from whatever brand of mental breakdown he is having this time, but I’d still like to be there for him if possible."
    },
    {
      "character": "Ami",
      "text": "That’s very sweet of you, Niki! "
    },
    {
      "character": "Ami",
      "text": "But no. "
    },
    {
      "character": "Ami",
      "text": "This is something I should probably handle on my own."
    },
    {
      "character": "Niki",
      "text": "If you say so. I’m assuming going into his room is still forbidden as well?"
    },
    {
      "character": "Ami",
      "text": "That is correct. Please do not approach the door. Thank you."
    },
    {
      "character": "Niki",
      "text": "Guess I’ll just leave all these here then. Have him call me if he’s ever feeling up to it, please. I’ve been so caught up worrying about him that I’ve barely even been able to work lately."
    },
    {
      "character": "Noriko",
      "text": "Yeah...even {i}my{/i} Insta is getting flooded with comments about how this is the first Christmas in a zillion years without a Niki concert. "
    },
    {
      "character": "Niki",
      "text": "Imagine what they’d be saying if they found out it was because of a boy."
    },
    {
      "character": "Noriko",
      "text": "I can tell them if you want? We can watch the sparks fly from our phones instead of the fireworks this year. Might be fun."
    },
    {
      "character": "Niki",
      "text": "Better idea — why don’t you and your friends go play as close to the fireworks as you can possibly get and-"
    },
    {
      "character": "Ami",
      "text": "Excuse me, Nakayama sisters, but Sensei needs his rest. So if there’s nothing else you need, please drop your presents off and vacate the premises. Thank you."
    },
    {
      "character": "Niki",
      "text": "Tch...fine. Is here okay? "
    },
    {
      "character": "Ami",
      "text": "Dining room table, please! Next to the rest of stuff the others have dropped off."
    },
    {
      "character": "Noriko",
      "text": "{i}Psst, Ayane...you good? You seem down. {/i}"
    },
    {
      "character": "Ayane",
      "text": "I’m fine..."
    },
    {
      "character": "Ayane",
      "text": "My chest is just a little tight."
    },
    {
      "character": "narrator",
      "text": "{i}Ayane’s affection has decayed by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Noriko’s affection has decayed by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}They are forgetting what you look like.{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "ayane_love -": {
      "from": null,
      "to": 10
    },
    "springtime5": {
      "from": null,
      "to": true
    },
    "noriko_love -": {
      "from": null,
      "to": 10
    }
  }
}