{
  "event_id": 310,
  "event_label": "amilust60intro",
  "dialogue": [
    {
      "character": "Ami",
      "text": "Hi! Sorry I disappeared for so long, Sensei. A few of the girls decided to show up unannounced and I had to make sure they weren’t here to hurt you. "
    },
    {
      "character": "Ami",
      "text": "But, on the bright side, Niki and Noriko dropped by as well! And they left you a bunch of presents on the dining room table!"
    },
    {
      "character": "Ami",
      "text": "I had to go through them to make sure there wasn’t anything dangerous inside, but I re-wrapped them pretty perfectly if I do say so myself. And I can help you open them later once we’re done with your checkup."
    },
    {
      "character": "Ami",
      "text": "Oh! And since you haven’t been able to visit the maid cafe in so long, I decided to make you my famous omurice! Complete with my own brand of flavor beam that I can guarantee you is better than Uta’s!"
    },
    {
      "character": "Ami",
      "text": "Don’t worry, though! I’m sure you’ll be strong enough to leave the house and go visit there soon if you keep improving at the rate you {i}have{/i} been! "
    },
    {
      "character": "Ami",
      "text": "Not that there’s any reason you’d {i}want{/i} to leave, though. Right, Sensei?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Exactly!"
    },
    {
      "character": "Ami",
      "text": "Things are so simple and easy when it’s just the two of us! I’m really happy you think the same way as me!"
    },
    {
      "character": "Ami",
      "text": "Because, between the way everyone keeps trying to harass me to get inside your room and the fact that they all think I’m not doing this for your sake, I’ve been starting to feel a little depressed lately."
    },
    {
      "character": "Ami",
      "text": "You don’t have to worry about me, though. I’m not letting it get in the way of your care. And I’ll continue doing everything I can to make sure you stay 100%% healthy, okay?"
    },
    {
      "character": "Ami",
      "text": "Now, show me how you say “Aaaaah!” "
    },
    {
      "character": "Ami",
      "text": "Here comes the airplane, Sensei! "
    },
    {
      "character": "Ami",
      "text": "Ah! Oh no! It looks like some of the ketchup spilled on your chest! Ami to the rescue!"
    },
    {
      "character": "Ami",
      "text": "{i}Ahm...mn...{/i}"
    },
    {
      "character": "Ami",
      "text": "Mmm! That was delicious! "
    },
    {
      "character": "Ami",
      "text": "I think some of your flavor might have gotten mixed in with it on accident. Do you mind if I have a little more? I put so much love into this dish that I’m feeling a little lethargic all of a sudden! Hahah!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh yeah?..."
    },
    {
      "character": "Ami",
      "text": "Then I guess I’ll just have to wait until {i}after{/i} dinner to get a second taste..."
    },
    {
      "character": "narrator",
      "text": "{i}Ami’s affection has increased to [ami_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "ami_love +": {
      "from": 3,
      "to": 10
    },
    "amilust60skip": {
      "from": null,
      "to": true
    }
  }
}