{
  "event_id": 311,
  "event_label": "springtime6",
  "dialogue": [
    {
      "character": "narrator",
      "text": "{i}The following morning...{/i}"
    },
    {
      "character": "narrator",
      "text": "Life moves on without you."
    },
    {
      "character": "narrator",
      "text": "In an outlet park not far from where you lay your head at night, four girls engage in a ruthless battle known as “Christmas shopping.”"
    },
    {
      "character": "narrator",
      "text": "Rumors say that such a thing used to be dangerous in the past. But here in the new world, where everyone either shops online or dies in space, shopping centers aren’t as busy as they used to be."
    },
    {
      "character": "narrator",
      "text": "Regardless, the members of this ragtag group of unlikely friends fill their arms with material goods, excited to wrap them up and drop them off when the sun crawls back into its hole beneath the earth later on."
    },
    {
      "character": "narrator",
      "text": "There is one girl without anything in her arms though — and it is not just because her breasts are so large that they render her incapable of holding anything in front of her."
    },
    {
      "character": "narrator",
      "text": "It’s because, beneath the facade she dons to mask her flaws, she is cracking. And she can’t seem to find the motivation that has always come to her so easily."
    },
    {
      "character": "narrator",
      "text": "Could this be love? Or is it just a passing virus? A tiny seed inside her mind that will one day bloom into a beautiful aneurysm that will pop and swiftly end her life."
    },
    {
      "character": "narrator",
      "text": "“I’ll buy something later,” she thinks. “I already have everything,” she reaffirms. But then, without saying a word, she reverts back to scarier thoughts."
    },
    {
      "character": "narrator",
      "text": "“I hope he is okay.”"
    },
    {
      "character": "narrator",
      "text": "“What was the last thing I even said to him?”"
    },
    {
      "character": "narrator",
      "text": "“Maybe I could just buy him off of Ami?”"
    },
    {
      "character": "narrator",
      "text": "That last one lacks authenticity, but I’m sure you understand the sentiment by now. Because {i}everyone{/i} understands the sentiment by now."
    },
    {
      "character": "narrator",
      "text": "Just some elect to keep it to themselves-"
    },
    {
      "character": "Karin",
      "text": "So...um...will Sensei be at this year’s Christmas party?"
    },
    {
      "character": "narrator",
      "text": "And some would rather share it."
    },
    {
      "character": "Touka",
      "text": "It will be quite the surprise if he is. But I’m certain none of us are banking on such a thing at the moment."
    },
    {
      "character": "Touka",
      "text": "From what I understand, Sensei is still...going through a bit of a rough patch right now. And there is naught for us to do but wait until he is open to seeing us again."
    },
    {
      "character": "Kirin",
      "text": "Is that why you haven’t bought anything yet? You drew Sensei’s name for Secret Santa this year and you’re worried you might have to hold onto your present for the rest of forever?"
    },
    {
      "character": "Touka",
      "text": "As apt as it would be for me to draw his name two years in a row, I regret to inform you that is not the case this time."
    },
    {
      "character": "Karin",
      "text": "So...he’s still feeling sick? Or...or depressed or...whatever it is he’s going through right now?"
    },
    {
      "character": "Touka",
      "text": "It certainly appears that way, Karin. But conversing about it won’t bring him back any sooner and I think we would be better off discussing {i}other{/i} matters for now."
    },
    {
      "character": "Kirin",
      "text": "You know what {i}would{/i} bring him back sooner? Heading over there right now and busting him out ourselves. It’s not like Ami can hold back all four of us, right?"
    },
    {
      "character": "Karin",
      "text": "Kirin, I think this is one of those situations where we shouldn’t try to get involved. Let’s just focus on getting ready for the party tonight and-"
    },
    {
      "character": "Kirin",
      "text": "And kidnapping an adult male. On it, sis."
    },
    {
      "character": "Yasu",
      "text": "That is not a good idea."
    },
    {
      "character": "Touka",
      "text": "And why is that, Yasu?"
    },
    {
      "character": "Yasu",
      "text": "Because it is not our place to interfere."
    },
    {
      "character": "Yasu",
      "text": "We are the cherubs who move the curtains — and the more important jobs are left for the more important people."
    },
    {
      "character": "Touka",
      "text": "My, you might be the first person I’ve ever encountered who has blatantly ignored just how important I actually am. Apart from our missing teacher, that is."
    },
    {
      "character": "Yasu",
      "text": "Bad things will happen if we stray from the path we’re walking now. "
    },
    {
      "character": "Yasu",
      "text": "The insects sing their carols in tune with the growth of posies — and in their lyrics, I have once more caught the future. "
    },
    {
      "character": "Yasu",
      "text": "But it is an uncertain one. And dotted with so many asterisks that my eyes burn just thinking of the possibilities."
    },
    {
      "character": "Kirin",
      "text": "English, please?"
    },
    {
      "character": "Karin",
      "text": "You speak English? Since when?"
    },
    {
      "character": "Yasu",
      "text": "In simpler terms, we would break him."
    },
    {
      "character": "Touka",
      "text": "{i}Break{/i} him? Now, how would we do that?"
    },
    {
      "character": "Yasu",
      "text": "It is less “we” and more “you,” Touka. "
    },
    {
      "character": "Touka",
      "text": "Me?! But I’m the responsible one!"
    },
    {
      "character": "Karin",
      "text": "Hey!"
    },
    {
      "character": "Yasu",
      "text": "You are. And I can’t imagine returning to a life without you in it. But your judgement is clouded right now- and you’d subject yourself to tortures and torment you would otherwise subvert."
    },
    {
      "character": "Kirin",
      "text": "Cool. So Touka stays here and the rest of us go kidnap Sensei. Karin’s more than enough to overpower Ami. I’m sure we’ll be fine."
    },
    {
      "character": "Karin",
      "text": "I don’t want to {i}overpower{/i} anyone! I just wanted to know if he was coming to the Christmas party! I’m not nearly as impatient as the rest of you!"
    },
    {
      "character": "Touka",
      "text": "For what it’s worth, Kirin seems to be the only visibly impatient member of this group at the moment."
    },
    {
      "character": "Kirin",
      "text": "For real! Even {i}Noriko’s{/i} been weirdly calm about this whole situation and it’s making me question my sanity for thinking about it so much."
    },
    {
      "character": "Kirin",
      "text": "But, then again, she’s already dealt with this once before for a {i}much{/i} longer amount of time. So right now, she’s probably just happy she knows where he is."
    },
    {
      "character": "Karin",
      "text": "Um...correct me if I’m wrong, but...weren’t we supposed to be moving onto other topics that {i}aren’t{/i} about Sensei?"
    },
    {
      "character": "Kirin",
      "text": "Oh, yeah. I guess we were."
    },
    {
      "character": "Kirin",
      "text": "See, this is exactly what I meant just now when I said I’ve been questioning my sanity. Like, why is Sensei the only thing I’m thinking about lately? It’s weird."
    },
    {
      "character": "Karin",
      "text": "I...might have an idea why..."
    },
    {
      "character": "Yasu",
      "text": "Wasting thoughts on entities other than God is the easiest sin to commit, but that doesn’t mean it’s easy to forgive!"
    },
    {
      "character": "Yasu",
      "text": "Spare no dream, nor hopes or prayers, for anyone but He who cares! Penemue taught me that rhyme in exchange for an extra cup of tea. Isn’t it lovely?"
    },
    {
      "character": "Kirin",
      "text": "Penemue?"
    },
    {
      "character": "Yasu",
      "text": "The name of the rabbit matters only half as much as the direction its ears rest in! Follow them up instead of down! And erase those troubled thoughts from your mind before you face ruin!"
    },
    {
      "character": "Kirin",
      "text": "Touka, I think your pet is broken again."
    },
    {
      "character": "Touka",
      "text": "To be frank, I’m not quite sure she can be fixed. But her ramblings, fanatical as they may be, have yet to lead me astray. And I’ve found it’s normally best to trust her when she says {i}not{/i} to do something."
    },
    {
      "character": "Kirin",
      "text": "Well, I’m not about to go storm his house all by myself, so I guess we can just keep shopping for now."
    },
    {
      "character": "Kirin",
      "text": "I just wish we could have gone to the mall. Like, who starts renovations right before the holiday season? Isn’t that weird?"
    },
    {
      "character": "Touka",
      "text": "Perhaps it was a safety issue? I’ve never needed to rely on a “mall” in the first place, so I’m likely a bit out-of-touch with the ways in which they typically operate."
    },
    {
      "character": "Kirin",
      "text": "For what it’s worth, at least you don’t look as lost as that woman over there."
    },
    {
      "character": "Sara",
      "text": "Aaaah! Haru-chan, I forgot how dangerous it is for me to go shopping now that I actually have money! Why aren’t you stopping me?!"
    },
    {
      "character": "Haruka",
      "text": "Because every time I’ve tried, you’ve sprinted across the store and pretended you didn’t hear me. "
    },
    {
      "character": "Sara",
      "text": "Then chase after me!"
    },
    {
      "character": "Haruka",
      "text": "With {i}these{/i} boobs and your...youthful vigor? Yeah, I’m good. You’re just going to have to learn to be a little more responsible. "
    },
    {
      "character": "Sara",
      "text": "Ugh...but it’s so hard when I don’t even know what I’m shopping {i}for.{/i} I feel like I’ve told Sensei a million things about myself, but I don’t know the first thing about what {i}he{/i} likes."
    },
    {
      "character": "Haruka",
      "text": "Boobs. And teenagers."
    },
    {
      "character": "Sara",
      "text": "I can’t buy him “boobs and teenagers,” Haru-chan!"
    },
    {
      "character": "Haruka",
      "text": "Sure you can. We live in Japan. And our friend literally owns a porn shop."
    },
    {
      "character": "Sara",
      "text": "No, I meant I can’t buy him those things for Christmas! I need to get him an {i}actual{/i} present so he’ll remember how much I care about him and stop avoiding me!"
    },
    {
      "character": "Haruka",
      "text": "Sara, you know he’s avoiding literally {i}everyone,{/i} right? This isn’t some targeted effort to make you feel insignificant or something."
    },
    {
      "character": "Sara",
      "text": "Hah...I know. I know, I know, I know. This just isn’t a situation I have any idea how to handle. It’s nothing like when you or Maki get depressed. Like, this is a guy I didn’t even know {i}had{/i} feelings until recently."
    },
    {
      "character": "Sara",
      "text": "And now that I’m starting to understand more about what those feelings {i}are,{/i} it’s making everything a hell of a lot more complicated."
    },
    {
      "character": "Haruka",
      "text": "Well, what do you mean by “what those feelings are?” Because I’m still pretty sure something as simple as “love” is off the table for him. At least for now."
    },
    {
      "character": "Sara",
      "text": "If there was a way for me to answer that question without sounding like a complete psychopath, I would."
    },
    {
      "character": "Haruka",
      "text": "Sara, I have known you long enough at this point to confidently tell you that there is absolutely {i}nothing{/i} you could say to me that would change how I already think you’re a psychopath. "
    },
    {
      "character": "Sara",
      "text": "Thanks, Haru-chan. That means a-"
    },
    {
      "character": "Sara",
      "text": "Wait a minute. That’s not how you were supposed to respond to that."
    },
    {
      "character": "Haruka",
      "text": "Wow, this weather sure is great!"
    },
    {
      "character": "Sara",
      "text": "Yeah. Real {i}great.{/i}"
    },
    {
      "character": "Haruka",
      "text": "Sara, listen. I’m sure that whatever you get for Sensei will be totally fine. Like, if anything, I think the fact that he’s completely devoid of...basically {i}any{/i} interests could be a {i}good{/i} thing."
    },
    {
      "character": "Haruka",
      "text": "It sure beats him actively {i}disliking{/i} everything, doesn’t it? Just assume that whatever you get for him will get, like...a neutral reaction or something like that. Boom, Christmas is saved."
    },
    {
      "character": "Sara",
      "text": "No, it’s not saved at all! I want to get him something special. Something that makes him {i}want{/i} to see me again because {i}I{/i} want to be the person he comes to when he’s breaking."
    },
    {
      "character": "Sara",
      "text": "This whole month has been hell. I was able to make it through November just fine because, after the father of your kids walks out on you, you learn a thing or two about being forced to let go."
    },
    {
      "character": "Sara",
      "text": "But the difference {i}this{/i} time is that A) I don’t {i}technically{/i} have anything to let go {i}of.{/i} And B) I know he’s still {i}here.{/i}"
    },
    {
      "character": "Sara",
      "text": "He didn’t skip town or hop on a plane headed for some foreign country. He’s at {i}home.{/i} He’s so close by and I can’t even {i}talk{/i} to him. I can’t do anything."
    },
    {
      "character": "Haruka",
      "text": "Sara...it’s not your role to do anything. You’re not his mom, you’re his friend. And he’ll call on you if he needs you."
    },
    {
      "character": "Sara",
      "text": "No he won’t. Have you {i}talked{/i} to him before? He’d never ask for help with anything. "
    },
    {
      "character": "Sara",
      "text": "Plus, even if I’m not {i}his{/i} mom, I am {i}a{/i} mom. And this is starting to feel a lot like how it felt with Sana when..."
    },
    {
      "character": "Sara",
      "text": "When...yeah. Because back then, I was fucked up too. And I was in no condition to help her since I was still figuring things out for myself. But this is different."
    },
    {
      "character": "Sara",
      "text": "I’m okay now. Or...or mostly okay, I guess."
    },
    {
      "character": "Sara",
      "text": "There are good days and there are bad days."
    },
    {
      "character": "Sara",
      "text": "I just don’t want someone else I care about to have to face their biggest battles without help. And even if he’s got Ami there for him, that’s..."
    },
    {
      "character": "Sara",
      "text": "It’s not me. "
    },
    {
      "character": "Sara",
      "text": "I know that might sound selfish. And I know he probably doesn’t {i}need{/i} me. But honestly, neither does Sana. And having {i}no one{/i} who needs me fucking {i}sucks{/i} when all I want is to be there."
    },
    {
      "character": "Haruka",
      "text": "I hear that...and I totally get you. But, at the same time, I don’t think you need to empty out your entire bank account buying every single thing you see for the guy. "
    },
    {
      "character": "Sara",
      "text": "Oh, half of these are for me."
    },
    {
      "character": "Haruka",
      "text": "Wait, really?"
    },
    {
      "character": "Sara",
      "text": "Maybe more than half."
    },
    {
      "character": "Sara",
      "text": "Maybe all of them."
    },
    {
      "character": "Haruka",
      "text": "Wasn’t the whole point of this trip going out so we could get something for {i}him?{/i}"
    },
    {
      "character": "Sara",
      "text": "Yeah but, like I said, he’s hard to shop for."
    },
    {
      "character": "Haruka",
      "text": "So your solution is to just...shop for yourself instead?"
    },
    {
      "character": "Sara",
      "text": "It helps calm me down."
    },
    {
      "character": "Haruka",
      "text": "Sara, you’ve been standing there with your head in your hands for about ten minutes now. And I’m pretty sure you let out an obnoxiously loud scream after we left that store."
    },
    {
      "character": "Sara",
      "text": "Screaming helps calm me down too."
    },
    {
      "character": "Haruka",
      "text": "You have a problem."
    },
    {
      "character": "Sara",
      "text": "I swear I only had like, two glasses of wine this morning."
    },
    {
      "character": "Haruka",
      "text": "..."
    },
    {
      "character": "Sara",
      "text": "Oh, you meant shopping. "
    },
    {
      "character": "Haruka",
      "text": "You had two glasses of wine? It’s not even 11:00 AM yet."
    },
    {
      "character": "Sara",
      "text": "Maybe three."
    },
    {
      "character": "Haruka",
      "text": "..."
    },
    {
      "character": "Sara",
      "text": "Maybe four."
    },
    {
      "character": "Sara",
      "text": "Maybe the whole bottle."
    },
    {
      "character": "Sara",
      "text": "But that doesn’t change the fact that I need to find Sensei a present before all the shops on this street shut their doors! Quick, Haru-chan! To the manliest store we can find! For manly things!"
    },
    {
      "character": "Sara",
      "text": "Or...anywhere else that looks interesting along the way!"
    },
    {
      "character": "Haruka",
      "text": "Why couldn’t you just get him something online like a normal millenial?"
    },
    {
      "character": "Sara",
      "text": "Ahhh! You and Sana both! You guys just don’t get it! All the fun in Christmas shopping is going out and actually {i}doing{/i} it!"
    },
    {
      "character": "Haruka",
      "text": "Where {i}is{/i} Sana anyway?"
    },
    {
      "character": "Sara",
      "text": "Beats me. She said she was busy this morning."
    }
  ],
  "state_changes": {
    "springtime6": {
      "from": null,
      "to": true
    },
    "day": {
      "from": 4,
      "to": 5
    }
  }
}