{
  "event_id": 313,
  "event_label": "springtime8",
  "dialogue": [
    {
      "character": "Futaba",
      "text": "Maybe...to the left a little more?"
    },
    {
      "character": "Miku",
      "text": "The {i}left?!{/i} Didn’t ya just tell me to move it to the right a second ago?! Girl-Sensei, get your butt over here and teach Futaba directions before my arms friggin’ fall off!"
    },
    {
      "character": "Miku",
      "text": "The nerve of this boob-woman, makin’ the short girl handle the friggin’ circular Christmas tree things while she stands over there and looks all...boobalicious."
    },
    {
      "character": "Futaba",
      "text": "They’re called “wreaths,” Miku. And I’m sorry for making you do all the heavy lifting. But you see, my back is just very sore from being so “boobalicious” all the time."
    },
    {
      "character": "Miku",
      "text": "Yeah, save the friggin’ sob story for when we’re runnin’ from zombies or I ain’t gonna stop to help you up. Friggin’ {i}wreaths.{/i} I obviously know what a “wreath” is. "
    },
    {
      "character": "Makoto",
      "text": "Is it really just us four this time? Don’t we normally have a few more people decorating with us?"
    },
    {
      "character": "Imani",
      "text": "Yeah well, when half the class is absent all the time now and the guy that everybody only comes to these parties to see is MIA, this is what you get. "
    },
    {
      "character": "Futaba",
      "text": "I’m sure a few more of the girls will show up soon. You said Ayane was coming, didn’t you?"
    },
    {
      "character": "Makoto",
      "text": "Yeah. And I’m pretty sure she’s bringing Sana as well. But, like Miku, there is a limit to what she’ll be able to accomplish."
    },
    {
      "character": "Miku",
      "text": "Y’all are sure talkin’ a lotta smack for a couple girls who ain’t doin’ crap! "
    },
    {
      "character": "Miku",
      "text": "Half of this heckin’ room’s been made up by Miku! And just because I ain’t got a career path laid out like you brainiacs don’t mean I’m gonna become a friggin’ interior designer!"
    },
    {
      "character": "Makoto",
      "text": "But you’re so good at it. You know right from left and everything."
    },
    {
      "character": "Miku",
      "text": "Know what? I’m done. You want another {i}wreath{/i} on the wall? Put it up yourself. I’m clockin’ out."
    },
    {
      "character": "Futaba",
      "text": "Thanks for all your help, Miku. We couldn’t have done it without you."
    },
    {
      "character": "Miku",
      "text": "Oh, I know. But still...you’re welcome, I guess. But I’m only sayin’ that cause it’s Christmas. Got it?"
    },
    {
      "character": "Futaba",
      "text": "Got it."
    },
    {
      "character": "Imani",
      "text": "Aren’t we missing something? I keep feeling like something is missing."
    },
    {
      "character": "Makoto",
      "text": "We {i}are{/i} missing something. It’s about six feet tall and has questionable sexual preferences."
    },
    {
      "character": "Miku",
      "text": "Frosty the Snowman?"
    },
    {
      "character": "Futaba",
      "text": "Makoto...you really shouldn’t badmouth someone who isn’t here to defend himself. Even if...there’s no sign pointing to when he {i}will{/i} be here to do that."
    },
    {
      "character": "Miku",
      "text": "It’s gotta be Frosty, right? Because there ain’t no way Santa Claus has “questionable sexual preferences” when the only people he hangs out with are rein-"
    },
    {
      "character": "Miku",
      "text": "Oh my God! That jolly old guy’s porkin’ deer, ain’t he?! Nobody tell Uta!"
    },
    {
      "character": "Futaba",
      "text": "Miku...sometimes, I can’t help but wonder how you even learned to tie your shoes."
    },
    {
      "character": "Miku",
      "text": "This is the twentieth century, Futaba. Nobody ties their shoes anymore. You tie ‘em once really tight and you’re set for life. Just gotta wiggle ‘em around a little bit to make ‘em fit. Like a wiener."
    },
    {
      "character": "Futaba",
      "text": "That...isn’t really...actually, okay. You win."
    },
    {
      "character": "Imani",
      "text": "Man, bitches be fuckin’ crazy nowadays. If I talked about wieners around {i}my{/i} family at your age, I’d be going to bed hungry as shit."
    },
    {
      "character": "Makoto",
      "text": "That’s funny because I think I’d be rewarded with extra dessert for doing the same exact thing. "
    },
    {
      "character": "Miku",
      "text": "Sounds to me like the two of you ain’t ever heard about sausage-Sundays. At my house, every weekend was-"
    },
    {
      "character": "Futaba",
      "text": "Oh look, another wreath to put up."
    },
    {
      "character": "Miku",
      "text": "Don’t you heckin’ look at me, Futaba. I ain’t kiddin’ this time."
    },
    {
      "character": "Makoto",
      "text": "Was your family...religious or something, Imani?"
    },
    {
      "character": "Imani",
      "text": "My dad was a pastor, but he wasn’t ever really {i}weird{/i} about it. Just a little...traditional."
    },
    {
      "character": "Imani",
      "text": "He dragged all of us to mass on Christmas and Easter and whatnot so we couldn’t ever celebrate with the other, like...ten kids that celebrated those things in our neighborhood. "
    },
    {
      "character": "Makoto",
      "text": "{i}All of us?{/i}"
    },
    {
      "character": "Imani",
      "text": "Yeah, I’m the youngest of seven."
    },
    {
      "character": "Makoto",
      "text": "Jesus."
    },
    {
      "character": "Imani",
      "text": "Yeah, exactly. "
    },
    {
      "character": "Imani",
      "text": "You know what Jesus says about making babies — “Pop ‘em out until you can’t afford any more.”"
    },
    {
      "character": "Miku",
      "text": "..."
    },
    {
      "character": "Futaba",
      "text": "..."
    },
    {
      "character": "Miku",
      "text": "Now, I ain’t no expert-"
    },
    {
      "character": "Imani",
      "text": "Actual Jesus quotes aside, where the fuck’s Rin at? Shouldn’t {i}she{/i} be helping us too since she ain’t got a girlfriend to worry about anymore?"
    },
    {
      "character": "Futaba",
      "text": "Rin’s with her mom right now. She’s going through a bit of a...crisis."
    },
    {
      "character": "Imani",
      "text": "Damn, and she thinks {i}Rika’s{/i} gonna help? Poor girl. Bitch is gonna come back with a pixie cut and a tramp stamp of Otoha’s name all crossed out or something."
    },
    {
      "character": "Futaba",
      "text": "It won’t be {i}that{/i} bad. I know it feels longer, but the two of them only dated for a few months."
    },
    {
      "character": "Makoto",
      "text": "Or was it {i}actually{/i} several years but no one can remember it because of-"
    },
    {
      "character": "Futaba",
      "text": "Plus, Rin’s actually been taking it surprisingly well. She hasn’t cried at all since the first week."
    },
    {
      "character": "Makoto",
      "text": "Wow. That never stops being weird."
    },
    {
      "character": "Miku",
      "text": "Yeah, I’ve been thinkin’ that Rin’s been kinda mature about the whole breakup thingy. Specially since she ain’t really mature about anything ever. Least not anything involvin’ girls."
    },
    {
      "character": "Futaba",
      "text": "She...does have a rather entertaining track record in that category, yes."
    },
    {
      "character": "Miku",
      "text": "But hey! Now she can start comin’ after Sensei like the rest of us! I always thought those two would make a cute couple. "
    },
    {
      "character": "Imani",
      "text": "Yeah, they’ll be totally adorable locked in Senpai’s house where no one will ever see them again."
    },
    {
      "character": "Makoto",
      "text": "You really {i}are{/i} taking this poorly, aren’t you?"
    },
    {
      "character": "Imani",
      "text": "{i}Me?{/i} Noooooo! I’m totally fine! I {i}love{/i} losing contact with my best friend and I’m not even {i}remotely{/i} pissed that I received no form of closure or even an explanation about {i}why!{/i}"
    },
    {
      "character": "Imani",
      "text": "You see, that sort of thing is {i}totally{/i} normal for adults! And when you girls are all grown up, I’m sure you’ll experience the same thing time and time again! Hahahah!"
    },
    {
      "character": "Miku",
      "text": "Is it just me or has Imani been gettin’ kinda scary lately?"
    },
    {
      "character": "Imani",
      "text": "Me?! {i}Scary?!{/i} Hahaha! I could never!"
    },
    {
      "character": "Imani",
      "text": "But I’d be lying if I said I wasn’t {i}extremely{/i} excited to smack my beloved Senpai upside his {b}STUPID{/b} fucking head whenever he comes out of hiding! Hahahaha!"
    },
    {
      "character": "Makoto",
      "text": "You know...maybe we should take a little break from decorating until some of the other girls show up?"
    },
    {
      "character": "Miku",
      "text": "Boobzilla, can’t ya give incest girl a call or somethin’? Maybe she can take a break from watchin’ weird porn videos to come learn about wreaths and Jesus."
    },
    {
      "character": "Futaba",
      "text": "I can try, but..."
    },
    {
      "character": "Futaba",
      "text": "Nodoka hasn’t really been...{i}present{/i} lately..."
    },
    {
      "character": "Otoha",
      "text": "You good, yo? I’m getting dressed over here and you haven’t even made one weird comment about my body."
    },
    {
      "character": "Nodoka",
      "text": "You see one teenage girl naked, you’ve seen them {i}all{/i} naked."
    },
    {
      "character": "Otoha",
      "text": "Christ, it’s even worse than I thought."
    },
    {
      "character": "Otoha",
      "text": "The hell happened? You were fine just yesterday. Thought you were finally done with your seemingly endless death march to finish your latest {i}masterpiece.{/i}"
    },
    {
      "character": "Nodoka",
      "text": "I was fine because I am a paragon of self-control and mental stability and can make people believe anything I want them to believe."
    },
    {
      "character": "Otoha",
      "text": "Then, if you’re a paragon of mental stability, how come you strip down to your underwear and start tossing mugs around the room at least once per week?"
    },
    {
      "character": "Nodoka",
      "text": "That isn’t me. It’s my evil twin, Shiori."
    },
    {
      "character": "Otoha",
      "text": "So what? You’re just gonna...lay there writing and not bother celebrating Christmas this year?"
    },
    {
      "character": "Nodoka",
      "text": "Are you so lonely without your now {i}ex-{/i}girlfriend that {i}I{/i} get to be your Christmas date this year? "
    },
    {
      "character": "Otoha",
      "text": "You? Absolutely not. You’re probably the last person I would ever consider dating. I just want to know if I’m going to be walking to the party alone or not. And also if I should call an ambulance."
    },
    {
      "character": "Nodoka",
      "text": "I’m still going to the party. But don’t expect me to don some extravagant dress as I am extremely busy and on the verge of a breakthrough right now."
    },
    {
      "character": "Otoha",
      "text": "Oooh, a breakthrough? Which one of our friends got laid this time and how are you going to spice it up for your readers?"
    },
    {
      "character": "Nodoka",
      "text": "I haven’t touched that series in over a month. I’m working on something else right now."
    },
    {
      "character": "Otoha",
      "text": "You are? How come I didn’t know about this?"
    },
    {
      "character": "Nodoka",
      "text": "Because you’ve been too busy shattering the hearts of local lesbians into a trillion pieces and chasing after a woman who will never love you no matter how hard you try to make her."
    },
    {
      "character": "Otoha",
      "text": "I’m focusing on my {i}music,{/i} Nodoka. And I don’t remember ever confessing my feelings for {i}anyone{/i} to you, so I have no idea what you’re talking about right now."
    },
    {
      "character": "Nodoka",
      "text": "Yes, yes. You’re a lone wolf who feasts on the carcases of weaker beings and I am but an oblivious little fly on the wall of your cerebral cortex."
    },
    {
      "character": "Otoha",
      "text": "A pain in the ass is what you really are."
    },
    {
      "character": "Nodoka",
      "text": "Silence, destroyer of hearts. You’re disrupting my train of thought, and I have not once attempted to drag my over-sized luggage onto {i}yours.{/i}"
    },
    {
      "character": "Otoha",
      "text": "You’re right. I’m sorry."
    },
    {
      "character": "Otoha",
      "text": "You always leave me alone when I’m in the zone, so...I’ll stay out of yours if you need me to. Just wanted to make sure you weren’t like, writing your suicide note or something."
    },
    {
      "character": "Nodoka",
      "text": "I can’t die. I have too much left to discover. Too much left to {i}learn.{/i}"
    },
    {
      "character": "Otoha",
      "text": "You, uhh...branching out to mystery novels now?"
    },
    {
      "character": "Nodoka",
      "text": "What I’m doing now is closer to {i}solving{/i} them. S.A. Nagahara is on a temporary hiatus while I attempt to piece together how and {i}why{/i} we are where we are right now."
    },
    {
      "character": "Otoha",
      "text": "As in you’re, like...trying to figure out the meaning of life? Or will you finally be the one to discover why there are so many empty floors in this building? "
    },
    {
      "character": "Nodoka",
      "text": "Nothing so vague as your first suggestion, but the second {i}does{/i} pique my interest. Regardless, I have a much simpler question to both ask and answer."
    },
    {
      "character": "Nodoka",
      "text": "Who {i}is{/i} Akira Arakawa exactly?"
    },
    {
      "character": "Otoha",
      "text": "Sensei?"
    },
    {
      "character": "Nodoka",
      "text": "My instinct was to reply with “the one and only” but it would partially contradict what I’ve written down thus far. So take this response as me verbally nodding."
    },
    {
      "character": "Otoha",
      "text": "You could have just said “yes” but you do you, I guess. Either way, is {i}all{/i} of this for him? Like...is {i}that{/i} the question you’ve been stuck on for over a month now?"
    },
    {
      "character": "Nodoka",
      "text": "It isn’t {i}for{/i} him, it is {i}about{/i} him. And the reason I’m so hopelessly stuck on such a simple question is that every answer I come up with just gives me {i}more{/i} questions."
    },
    {
      "character": "Otoha",
      "text": "If only we could, like...actually talk to him. That would make shit way easier than whatever sort of mental journey you’re taking right now to straight up manifest his personal details."
    },
    {
      "character": "Nodoka",
      "text": "Strangely enough, I’m not sure if it would. As in, I don’t think there is anything he could tell me that would answer my question the way I {i}want{/i} it to be answered."
    },
    {
      "character": "Nodoka",
      "text": "However, there is a certain red-haired niece of his that I would {i}love{/i} to pick the brain of, if that brain would only emerge from its shell every once in a while."
    },
    {
      "character": "Otoha",
      "text": "Ami? Yeah, I’m pretty sure her “shell” is just empty. I can’t imagine {i}her{/i} having whatever sort of groundbreaking information you’re looking for, even {i}if{/i} it’s about Sensei."
    },
    {
      "character": "Nodoka",
      "text": "And that is where I think you’re wrong. "
    },
    {
      "character": "Nodoka",
      "text": "You see, Ami Arakawa is special. But not everyone realizes that just yet. "
    },
    {
      "character": "Otoha",
      "text": "Special? Are we really talking about the same person right now?"
    },
    {
      "character": "Nodoka",
      "text": "It is precisely that reaction that reaffirms my current line of thinking — that she’s nothing short of a marsh warbler. A facade. That she’s had you all in the palms of her hands this entire time."
    },
    {
      "character": "Otoha",
      "text": "Uhh...what?"
    },
    {
      "character": "Nodoka",
      "text": "Do you know who her mother is, Otoha?"
    },
    {
      "character": "Otoha",
      "text": "I...know that she’s dead? How many Nodoka points does that earn me?"
    },
    {
      "character": "Nodoka",
      "text": "Ami Arakawa is the daughter of the Girl Who Cannot Breathe."
    },
    {
      "character": "Otoha",
      "text": "..."
    },
    {
      "character": "Nodoka",
      "text": "Frankly, I’m an idiot for not piecing it together sooner. I have no idea how it slipped by me so easily. But now that I’m actually {i}thinking{/i} about it, everything fits. It {i}all{/i} fucking fits."
    },
    {
      "character": "Otoha",
      "text": "I don’t know who-"
    },
    {
      "character": "Nodoka",
      "text": "Don’t lie to me, Otoha. "
    },
    {
      "character": "Nodoka",
      "text": "I know you, so I {i}know{/i} you know."
    },
    {
      "character": "Nodoka",
      "text": "But it isn’t just that piece of information that has me surrounded by crumpled up sheets of paper on the bed. The reason for {i}that{/i} is much harder to explain."
    },
    {
      "character": "Otoha",
      "text": "You know, I’ve {i}really{/i} gotta finish getting ready for the party now. So just...go ahead and do your own thing and we can talk, like...later. Or something."
    },
    {
      "character": "Nodoka",
      "text": "Are you sure? I’ve yet to even clue you in on what my impending {i}breakthrough{/i} is. Don’t tell me you’re no longer interested?"
    },
    {
      "character": "Otoha",
      "text": "Yeah, I’m...I’m good. You can tell me some other time."
    },
    {
      "character": "Nodoka",
      "text": "Boooo. You disrupt my work just to hand me a new time-card? How dull and predictable of you."
    },
    {
      "character": "Nodoka",
      "text": "I can guarantee you this though, my friend. If I am {i}right...{/i}which I typically am..."
    },
    {
      "character": "Nodoka",
      "text": "You’re going to think I’m even {i}more{/i} insane than you already do."
    },
    {
      "character": "Otoha",
      "text": "Yeah...I’ll wait and see if that’s even possible, because I’m pretty sure it’s not."
    },
    {
      "character": "Nodoka",
      "text": "Oh well. At least I can take solace in the fact that I’m not alone in my efforts. Because right now, there’s at least {i}one{/i} other person getting just as excited as me about all this."
    },
    {
      "character": "Otoha",
      "text": "What? Who? And how do you even know that?"
    }
  ],
  "state_changes": {
    "springtime8": {
      "from": null,
      "to": true
    }
  }
}