{
  "event_id": 314,
  "event_label": "springtime9",
  "dialogue": [
    {
      "character": "Nodoka",
      "text": "{i}The same reason I know everything else — I just do.{/i}"
    },
    {
      "character": "Osako",
      "text": "Wakana, are you almost done yet? You’ve had your face buried in that stupid notebook all day. "
    },
    {
      "character": "Wakana",
      "text": "Call poetry stupid again and I will slap you. And let me clarify that I will do it in a way that you will derive little to no sexual pleasure from."
    },
    {
      "character": "Osako",
      "text": "I’m sure the poetry is {i}fine.{/i} But the notebook is stupid because it’s preventing us from spending Christmas together when we’re supposed to be out doing...you know. Couple stuff."
    },
    {
      "character": "Wakana",
      "text": "And “couple stuff” we shall do, Osako. Just not yet."
    },
    {
      "character": "Osako",
      "text": "Then when? Because I’ve been waiting all day and you’re not even dressed yet. "
    },
    {
      "character": "Wakana",
      "text": "In regard to the peony, how do you feel?"
    },
    {
      "character": "Osako",
      "text": "...What?"
    },
    {
      "character": "Wakana",
      "text": "The peony. The flower. Does it elicit a specific emotion or take you back to a certain time in your life? What do you think it could represent? Love? Happiness? Beauty?"
    },
    {
      "character": "Osako",
      "text": "Hah...those topics are so vague and broad that basically {i}anything{/i} could symbolize them if you spin it the right way. Or if you’re just...really persuasive or something."
    },
    {
      "character": "Wakana",
      "text": "Which is why I asked you how they make {i}you{/i} feel. Because I have all but numbed myself to the faux functions of flora these last few weeks."
    },
    {
      "character": "Osako",
      "text": "I’m aware. We haven’t even had sex this month and we used to average like...four times a day."
    },
    {
      "character": "Wakana",
      "text": "If it will make you feel any better, I’ll allow you to open one of your Christmas presents {i}before{/i} our date tonight. Probability dictates there may be something in one of them that could “assist” you."
    },
    {
      "character": "Osako",
      "text": "Or, you know, {i}you{/i} could assist me. With your hands. Or your mouth. Or one of the million toys we keep in the closet. Hell, I’ll even take a foot at this point. "
    },
    {
      "character": "Wakana",
      "text": "Absolutely not. We tried that one time in college and vowed to never attempt it again. Restrain yourself, my pet."
    },
    {
      "character": "Osako",
      "text": "Wakana, enough is enough. I get that this...research thing is important to you, but Christmas has always been a day for {i}us.{/i}"
    },
    {
      "character": "Wakana",
      "text": "Every day is a day for {i}us.{/i} That’s precisely what love is. But there will {i}be{/i} other Christmases. Many of them. And right now, I {i}have{/i} to do this. "
    },
    {
      "character": "Osako",
      "text": "But {i}why?{/i} Why {i}now?{/i} "
    },
    {
      "character": "Wakana",
      "text": "Because I may be on the verge of losing something I..."
    },
    {
      "character": "Wakana",
      "text": "Something I do not want to lose."
    },
    {
      "character": "Wakana",
      "text": "So I ask you to understand and bear with me for just a little while longer. Surely I must be getting close to {i}something.{/i}"
    },
    {
      "character": "Osako",
      "text": "Are you really that worried about him?"
    },
    {
      "character": "Wakana",
      "text": "Would you not be worried if one of your closest associates suddenly vanished off the face of the earth? Additionally, if you think {i}I’m{/i} handling this poorly, I urge you to take a look at Imani."
    },
    {
      "character": "Osako",
      "text": "You realize he’s my friend too, right?"
    },
    {
      "character": "Wakana",
      "text": "Then why are you not as concerned as I am?"
    },
    {
      "character": "Osako",
      "text": "Because he’s a grown man, Wakana. He doesn’t need you to-"
    },
    {
      "character": "Wakana",
      "text": "He is no typical {i}grown man,{/i} Osako! You have not seen the {i}fear{/i} in his eyes! You have not seen the way he {i}trembles{/i} at the mere {i}mention{/i} of-"
    },
    {
      "character": "Wakana",
      "text": "Hah...I apologize. I didn’t mean to raise my voice. That was wrong of me. But {i}please{/i} know that Arakawa is far more complex than you know. And it’s not in a good way."
    },
    {
      "character": "Wakana",
      "text": "There was a recurring subject in the early works of the Girl Who Cannot Breathe — a child known only as “Boy,” who is believed by most to be nothing more than a muse of sorts."
    },
    {
      "character": "Osako",
      "text": "I know. You’ve told me a million times. Hell, I could probably write a whole report on that psycho at this point."
    },
    {
      "character": "Wakana",
      "text": "This “Boy” may not just be a muse, though. This boy-"
    },
    {
      "character": "Osako",
      "text": "Could be Sensei. I know. You’ve made that very clear. But that woman was a total creep and it could have very well been literally any other {i}boy{/i} out there.  "
    },
    {
      "character": "Osako",
      "text": "If you were as confident as you sound, your “research” would be over already and we’d be off looking at Christmas lights together. "
    },
    {
      "character": "Osako",
      "text": "But you’re {i}not{/i} confident. You’re just guessing. And guessing is all you’re ever going to do if no one else in the...obscure creepy poetry community has outed her as a criminal by now."
    },
    {
      "character": "Wakana",
      "text": "What would be the point in {i}outing{/i} her now? She vanished years ago. Around the same exact time Ami Arakawa lost her mother. Because she {i}was{/i} Ami Arakawa’s mother."
    },
    {
      "character": "Osako",
      "text": "And she has passed her creepy poetry powers onto her daughter who is now going to grow up to also prey upon children. Right?"
    },
    {
      "character": "Wakana",
      "text": "I do not like that mocking tone, Osako. This isn’t some supernatural battle against the will of a dead mother — it’s a kind-hearted effort to save two people who I see {i}every single day.{/i}"
    },
    {
      "character": "Wakana",
      "text": "Or rather, two people I {i}was{/i} seeing every day until spontaneous tragedy struck and thrust both of them into the indefinite darkness of Arakawa’s likely dingy home."
    },
    {
      "character": "Osako",
      "text": "What’s the end goal, though? What is all of this researching going to do if you’re already sure that the creepy poet is Ami’s mom and Sensei is the kid she was taking advantage of?"
    },
    {
      "character": "Osako",
      "text": "Because it’s not like confirming that is going to give anybody peace of mind. And it’s not like just telling this Ami girl that her mom was psycho is going to {i}change{/i} her at all. "
    },
    {
      "character": "Osako",
      "text": "I read her poetry too, you know? {i}With{/i} you. Ami needs help, not...literary analysis."
    },
    {
      "character": "Wakana",
      "text": "The reason...I am being so analytical...is because I could have {i}predicted this...{/i}if I had only paid more attention."
    },
    {
      "character": "Osako",
      "text": "Oh boy, here we go again."
    },
    {
      "character": "Wakana",
      "text": "The peony sleeps in its bed of unrest — ‘neath the fireflies' wings and their humble caress."
    },
    {
      "character": "Wakana",
      "text": "The end of an onset — the base of a nest — in a future so fertile; one loss acquiesced."
    },
    {
      "character": "Osako",
      "text": "The plucking of feathers — stems torn from the soil. The egg might be old, but who says it has spoiled?"
    },
    {
      "character": "Wakana",
      "text": "To drink in its yolk; to bathe in its oil — makes this little girl squeal, lest the garden recoils."
    },
    {
      "character": "Wakana",
      "text": "This is about him. This poem is about Arakawa being torn away from where he’s {i}meant{/i} to be and thrown into some {i}prison{/i} for the sake of making a “little girl” happy. Isn’t it?"
    },
    {
      "character": "Wakana",
      "text": "And the “garden” is his classroom. No...his world. The people in it...The things he...enjoys? Maybe?"
    },
    {
      "character": "Osako",
      "text": "Hell if I know. This is {i}your{/i} area of expertise. All the poets I like are a lot easier to understand."
    },
    {
      "character": "Wakana",
      "text": "She wanted this, Osako. No...she {i}knew{/i} this was coming. "
    },
    {
      "character": "Wakana",
      "text": "There are seven other poems in here that could all mean the same thing, but there’s one element they all have in common that I can’t figure out."
    },
    {
      "character": "Wakana",
      "text": "“One loss acquiesced.” "
    },
    {
      "character": "Wakana",
      "text": "What does that mean? What is she referring to when she says that? Because the only major {i}loss{/i} I can think of would be her mother. IE: Arakawa's alleged former “lover.” "
    },
    {
      "character": "Wakana",
      "text": "But why would the passing of Ami’s mother begin to affect Arakawa to such an extent {i}now?{/i} She should have passed years ago. "
    },
    {
      "character": "Wakana",
      "text": "Could he have lost something else? What? Who? Who or what else does he even care about? Why do I barely know anything about him despite all the time we’ve spent together?"
    },
    {
      "character": "Osako",
      "text": "Well, while you’re doing {i}that,{/i} I’m going to call Rika and see if she wants to come over so I don’t have to spend Christmas alone."
    },
    {
      "character": "Wakana",
      "text": "One loss acquiesced...loss acquiesced..."
    },
    {
      "character": "Wakana",
      "text": "I’m almost there. I’ve almost got it."
    },
    {
      "character": "Osako",
      "text": "Wakana...can you {i}please{/i} wrap this up soon? I’ve been trying to be supportive and haven’t complained at all since you started doing this since I know it’s important to you, but... "
    },
    {
      "character": "Osako",
      "text": "Today is different. Today, {i}I{/i} want to be the priority. And I can’t imagine a few hours will make a big difference in the grand scheme of...all you’ve been doing. Especially since you’re months in at this point."
    },
    {
      "character": "Wakana",
      "text": "Yes. Fine. Just...go call Rika while I make a few more notes in- wait, has this always been here? Why have I not seen this poem before? Why are there no notations?"
    },
    {
      "character": "Osako",
      "text": "I’ll be back in a couple minutes. {i}Please{/i} at least get dressed while I’m gone."
    },
    {
      "character": "Wakana",
      "text": "My dress is in the dryer. Can you-"
    },
    {
      "character": "Osako",
      "text": "You can get it yourself."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "{i}Hey, Osako! Merry Christmas! Unless you don’t celebrate Christmas. And if that’s the case, merry Wednesday!{/i}"
    },
    {
      "character": "Osako",
      "text": "It’s Friday, Rika."
    },
    {
      "character": "Rika",
      "text": "{i}Then merry that!{/i}"
    },
    {
      "character": "Kaori",
      "text": "John, stop! If you damage the Nao-chan with your chicken powers, I will never put another squirmy tubular creature in your mouth! And you love tubes!"
    },
    {
      "character": "Nao",
      "text": "!!!!!!!!!"
    },
    {
      "character": "Rika",
      "text": "{i}What’s that in the background?{/i}"
    },
    {
      "character": "Osako",
      "text": "Oh, those are just my neighbors. But hey, are you doing anything right now? Because Wakana’s being kind of...absent. And I could really use the company."
    },
    {
      "character": "Rika",
      "text": "Yeah! I’m totally free."
    },
    {
      "character": "Rin",
      "text": "What? No you’re not. We’re literally shopping right now. And you know how I feel about you inviting your friends into various dressing rooms with me."
    },
    {
      "character": "Rika",
      "text": "Rin’s excited to see you as well!"
    },
    {
      "character": "Rin",
      "text": "Who is that?"
    },
    {
      "character": "Rika",
      "text": "It’s Osako. Sounds like things aren’t going great with Wakana and she needs a new lesbian. I mean top. I mean girlfriend."
    },
    {
      "character": "Osako",
      "text": "{i}I’m still here, you know.{/i}"
    },
    {
      "character": "Rika",
      "text": "She says she’s still here."
    },
    {
      "character": "Rin",
      "text": "Yeah, I don’t want any part of this until I can confirm that Miss Watabe won’t chop my head off. And also, you’re not free. You promised me clothes for Christmas and I have no money to pay for myself."
    },
    {
      "character": "Rika",
      "text": "Sorry, Osako. Rin’s afraid of Wakana and I have to buy her clothes. But I’m sure nobody will mind if we just keep talking on the phone even though I’m in a public place with a lot of people."
    },
    {
      "character": "Osako",
      "text": "I should’ve figured as much. Looks like I really {i}am{/i} the only person alone on Christmas this year."
    },
    {
      "character": "Rika",
      "text": "I feel like that is statistically improbable."
    },
    {
      "character": "Osako",
      "text": "I feel like some of those words were too big for you."
    },
    {
      "character": "Rika",
      "text": "Just give me a couple hours and we can chill if you’re still not doing anything. Rin’s got a Christmas party later, so I’m free once she heads over there."
    },
    {
      "character": "Rika",
      "text": "But, then again, I guess there’s always a chance she decides to bail since her ex is going to be there and that would be like, totally awkward for them. Right? Hahahah!"
    },
    {
      "character": "Rika",
      "text": "Like, can you {i}imagine{/i} ever being in the same room with your ex again after they leave you? Things like that just don’t happen, right? Like, it’s not a thing anyone should get their hopes up for or whatever?"
    },
    {
      "character": "Rin",
      "text": "It was mutual! And it happened over a month ago! And stop feeling so sorry for yourself all the time!"
    },
    {
      "character": "Rika",
      "text": "Sorry, Rin. Can’t hear you. I’m going through a tunnel."
    },
    {
      "character": "Rin",
      "text": "I can literally see you!"
    },
    {
      "character": "Osako",
      "text": "Did you forget which one of us you’re on the phone with?"
    },
    {
      "character": "Rika",
      "text": "Maybe. "
    },
    {
      "character": "Rika",
      "text": "But hey, if the bar’s open tonight and you two don’t want to be alone, maybe the three of us could go out for drinks?"
    },
    {
      "character": "Rika",
      "text": "Or maybe if you {i}do{/i} want to be alone but with an additional person who may also be open to getting some Christmas action, we could do that instead!"
    },
    {
      "character": "Rin",
      "text": "Uhh...ew?"
    },
    {
      "character": "Rika",
      "text": "Don’t mind Rin if you just heard her. She doesn’t like girls anymore now that she’s been dumped by one."
    },
    {
      "character": "Rin",
      "text": "Stop making all your friends think I was dumped! And also, I still like girls! Which is a thing I probably shouldn’t be yelling in a dressing room, but it’s the truth! And I will not remain silent!"
    },
    {
      "character": "Rika",
      "text": "Hey, so apparently Rin wants in on the Christmas action too. Do you know any good ways to tell your daughter they need to stay out of your sex life?"
    },
    {
      "character": "Rin",
      "text": "It would help by not yelling things that force her to get involved whether she wants to or not! Which she doesn’t because you’re old and gross!"
    },
    {
      "character": "Rin",
      "text": "But not you, Osako! You’re pretty! And only kind of old!"
    },
    {
      "character": "Rika",
      "text": "Rin says you’re pretty. Now, we must fight."
    },
    {
      "character": "Osako",
      "text": "Yeah, instead of that, how about I just let you go and...give you a call later if I’m still not doing anything?"
    },
    {
      "character": "Rika",
      "text": "You sure? Because I don’t mind staying on the phone a little longer."
    },
    {
      "character": "Osako",
      "text": "Yeah, I’m sure. I want to go back in and check on Wakana anyway."
    },
    {
      "character": "Rika",
      "text": "She still taking the Sensei thing as badly as Imani has been?"
    },
    {
      "character": "Osako",
      "text": "That’s...not a thing I want to get into right now. I’ll call you later."
    },
    {
      "character": "Rika",
      "text": "Kay. Talk to you then. Let me know if you need anything."
    },
    {
      "character": "Osako",
      "text": "Yeah...bye."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "That was Osako."
    },
    {
      "character": "Rin",
      "text": "I know who it was, Mom."
    },
    {
      "character": "Rika",
      "text": "Are you still upset too?"
    },
    {
      "character": "Rin",
      "text": "I already told you. It was mutual."
    },
    {
      "character": "Rika",
      "text": "You know that’s not what I mean."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "Do you want to talk about it?"
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "You haven’t been doing anything stupid, have you?"
    },
    {
      "character": "Rin",
      "text": "No..."
    },
    {
      "character": "Rika",
      "text": "Are you lying to me?"
    },
    {
      "character": "Rin",
      "text": "No..."
    },
    {
      "character": "Rika",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "I like you as a blonde. You look cool."
    },
    {
      "character": "Rin",
      "text": "Thanks. But just so you know, there’s nothing less cool than being called “cool” by your uncool mom."
    },
    {
      "character": "Rika",
      "text": "We’re in private. No one’s going to care."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "Which is why I want to tell you the same thing I told Osako just now. Let me know if you need anything. Okay?"
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "Rin. Look at me."
    },
    {
      "character": "Rin",
      "text": "Why? Are you trying to embarrass me on purpose right now or something?"
    },
    {
      "character": "Rika",
      "text": "Of course not. I just love you. And I want you to know that even if I’m kind of an idiot and not a great mom...that won’t ever change. "
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "..."
    },
    {
      "character": "Rika",
      "text": "“I love you too, Mom! You’re so awesome and pretty and only 42 years old!”"
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "You’re 43..."
    },
    {
      "character": "Rika",
      "text": "And now {i}we{/i} must fight as well! Mwahahaha!"
    },
    {
      "character": "Rin",
      "text": "Wha- get off of me! I’m half naked!"
    },
    {
      "character": "Rika",
      "text": "Never! You’re my daughter and I’ll attack you in the dressing room if I-"
    },
    {
      "character": "Employee",
      "text": "Okay. That’s it. You two have been in here for half an hour and have not shut up even once. It’s time to go."
    },
    {
      "character": "Rika",
      "text": "Attack!"
    },
    {
      "character": "Rin",
      "text": "Mom! You can't attack the employees!"
    },
    {
      "character": "narrator",
      "text": "{i}Rin’s affection has decayed by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "springtime9": {
      "from": null,
      "to": true
    },
    "rin_love -": {
      "from": null,
      "to": 10
    }
  }
}