{
  "event_id": 316,
  "event_label": "springtime11",
  "dialogue": [
    {
      "character": "Sana",
      "text": "What if...you get rid of {i}life transference{/i} and...trade it for something more...offensive instead?..."
    },
    {
      "character": "Sana",
      "text": "Like...if you’re going to be...on the front lines...maybe {i}spirit guardians{/i} would be good?..."
    },
    {
      "character": "Maya",
      "text": "No one else in the party ever heals. So either I stock up on spells that do that, or everyone starts playing less selfishly."
    },
    {
      "character": "Sana",
      "text": "But...that spell...damages you as well, doesn’t it?...Isn’t that a little too risky for...a boss fight as big as Molly is making this out to be..."
    },
    {
      "character": "Maya",
      "text": "It should be fine so long as we can get the boss to focus on you instead. If only you still had that second arm. I feel like that would be a big help here."
    },
    {
      "character": "Sana",
      "text": "If everything...goes according to plan...I should have enough gold to buy a new one after this dungeon..."
    },
    {
      "character": "Maya",
      "text": "I know I shouldn’t be questioning medical practices in a world where we can literally use magic, but that just doesn’t seem realistic or plausible to me."
    },
    {
      "character": "Sana",
      "text": "A {i}steel{/i} arm...made by an artificer in the town Ram comes from..."
    },
    {
      "character": "Sana",
      "text": "If...If the quality is high enough...I think it might even give me advantage on some attacks instead of...disadvantage from...there not being anything there right now..."
    },
    {
      "character": "Maya",
      "text": "If that’s the case, why don’t all of us just have our arms torn off and replaced with better arms? It’s not like we can actually feel pain for our characters, so I see no downside to this."
    },
    {
      "character": "Sana",
      "text": "That’s..."
    },
    {
      "character": "Sana",
      "text": "That’s actually...not a bad idea..."
    },
    {
      "character": "Ayane",
      "text": "So, now that neither one of us is {i}busy{/i} anymore, can we continue our conversation from this morning? Or do you really just not care about Maya or Sensei at all?"
    },
    {
      "character": "Makoto",
      "text": "Sensei I obviously care about. Maya? Not so much. Though, I’d be lying if I said I didn’t prefer the one who insulted me fractionally less."
    },
    {
      "character": "Makoto",
      "text": "Plus, if her {i}untimely end{/i} is truly what caused Sensei to spiral into a pit of self-loathing and misery that only Ami is able to witness, maybe trying to “save” her {i}could{/i} be beneficial in some way. "
    },
    {
      "character": "Makoto",
      "text": "I just have no idea what that way would be because this world is fucking insane and I’m starting to think I might be the protagonist of the world’s worst most convoluted romance manga."
    },
    {
      "character": "Ayane",
      "text": "It’s {i}definitely{/i} the Maya thing that’s broken Sensei. There’s not a doubt in my mind about that."
    },
    {
      "character": "Makoto",
      "text": "Then, let me ask you this before we start coming up with some crazy plan to cure divine amnesia-"
    },
    {
      "character": "Makoto",
      "text": "If either one of {i}us{/i} was reset, do you think it would hit Sensei even remotely as hard as {i}her{/i} reset apparently hit him? "
    },
    {
      "character": "Ayane",
      "text": "I-"
    },
    {
      "character": "Ayane",
      "text": "Well..."
    },
    {
      "character": "Makoto",
      "text": "Because I don’t think it would. And if that’s the case, maybe waiting this out really {i}is{/i} our best option."
    },
    {
      "character": "Ayane",
      "text": "What?..."
    },
    {
      "character": "Makoto",
      "text": "Well...think about it. If the original Maya is that far ahead of both you and me in terms of Sensei’s level of affection for her, bringing her {i}back{/i} would just put {i}us{/i} at a disadvantage. Wouldn’t it?"
    },
    {
      "character": "Ayane",
      "text": "That’s...not really how I was looking at any of this. I just want my friend back and my future husband to come out of his hole."
    },
    {
      "character": "Makoto",
      "text": "Sure. And I get that. I’d probably be doing the same exact thing if it was Miku who vanished instead of Maya. "
    },
    {
      "character": "Makoto",
      "text": "But try to look at things from my perspective right now. What would I {i}gain{/i} if Maya were to return to normal? She’s not even my friend. And {i}you’re{/i} not really my friend either."
    },
    {
      "character": "Ayane",
      "text": "That-"
    },
    {
      "character": "Makoto",
      "text": "Don’t bother actually responding to that question. The answer is even less time with Sensei and a lower ranked place in his ugly excuse for a heart. Which you’d {i}also{/i} be receiving in exchange for Maya."
    },
    {
      "character": "Makoto",
      "text": "Assuming we actually {i}can{/i} bring her back, that is. "
    },
    {
      "character": "Makoto",
      "text": "Which we probably can’t because it would make her disappearance a lot less impactful and I can’t really imagine my apparent romance manga selling well with such flimsy plot devices."
    },
    {
      "character": "Ayane",
      "text": "Makoto...this isn’t some kind of game. Even if it doesn’t feel or look like it, this {i}is{/i} real life. Maya’s not some other heroine Sensei’s trying to pick up. She’s an actual person."
    },
    {
      "character": "Makoto",
      "text": "Frankly, I’m not convinced this {i}is{/i} real life."
    },
    {
      "character": "Ayane",
      "text": "What?! But after all you’ve-"
    },
    {
      "character": "Makoto",
      "text": "Shh. You wanted to keep things quiet, didn’t you? Maya will hear you if you start yelling."
    },
    {
      "character": "Ayane",
      "text": "But, Makoto...how could you even say that after seeing an entire loop for yourself? Did you seriously not feel any pain or...{i}anything{/i} that whole time?"
    },
    {
      "character": "Makoto",
      "text": "It’s precisely {i}because{/i} I’ve seen an “entire loop” that I can say I’m not convinced this is real life. “Real life” has consequences. People can die. {i}We{/i} can die in real life."
    },
    {
      "character": "Makoto",
      "text": "But if we die here, we just start over. Don’t we? That makes this sound more like a video game. And I’ve never been great at video games, but I’m pretty sure there’s usually some kind of “goal” in them."
    },
    {
      "character": "Makoto",
      "text": "And what would {i}our{/i} goal be if not competing for the heart of the man we all so obviously love? Why not just take the advantage that’s been handed to us and compete against one another?"
    },
    {
      "character": "Ayane",
      "text": "Because there’s nothing to compete {i}for{/i} if Sensei stays trapped in his house for the rest of eternity."
    },
    {
      "character": "Ayane",
      "text": "And between time never passing here and Ami being basically fucking insane, that might be exactly what happens."
    },
    {
      "character": "Makoto",
      "text": "Then I guess we’ll have plenty of time to become friends before ultimately being forced to betray one another."
    },
    {
      "character": "Ayane",
      "text": "Is this...seriously what you’re like?"
    },
    {
      "character": "Makoto",
      "text": "I’m not really sure “what I’m like” anymore. But you know what I {i}am{/i} sure of? That Sensei’s going to be fine whether or not we do anything about it."
    },
    {
      "character": "Makoto",
      "text": "What I learned from my dad dying is that time doesn’t heal everything like people tell you. But it {i}does{/i} make it easier to stomach getting out of bed in the morning. "
    },
    {
      "character": "Makoto",
      "text": "And Sensei has all the time in the world. Literally. So if there’s no strict time limit we need to have him normal again by, why not let him grieve for now so he can get up on his own one day?"
    },
    {
      "character": "Ayane",
      "text": "Hah...I don’t like debating with you. You’re too...rational. At least Maya would, like...{i}guess{/i} stuff when I argued with her. But you’re all about {i}facts{/i} and {i}logic{/i} and stuff."
    },
    {
      "character": "Makoto",
      "text": "Those {i}are{/i} my strong suits, yes. And I’m sorry for putting everything a little bluntly — that’s just the way I’ve been looking at all of this."
    },
    {
      "character": "Makoto",
      "text": "I could always be convinced otherwise, though. After all, games aren’t very fun if the {i}only{/i} thing you do is rush for the end goal."
    },
    {
      "character": "Makoto",
      "text": "So how about {i}you{/i} tell me what your plans are since you obviously have some?"
    },
    {
      "character": "Ayane",
      "text": "Thank you. But please don’t try to destroy me with more logic once you hear them because I am hanging on by a thread right now and you’re literally the only person I have."
    },
    {
      "character": "Makoto",
      "text": "Things not to say to a girl who just equated the world to one giant competition in which we will all have to betray each other."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Please. Proceed."
    },
    {
      "character": "Ayane",
      "text": "You’re scary when you smile."
    },
    {
      "character": "narrator",
      "text": "The scent of coconut assaulted the nasal passages of Ayane Amamiya as she moved closer to a girl that would [[probably] stab her in the back if it meant getting closer to her “goal.”"
    },
    {
      "character": "narrator",
      "text": "After all, this was a girl who, while remaining open to the idea of being convinced, had made her place and purpose clear for the first time since the passing of her father."
    },
    {
      "character": "narrator",
      "text": "It was a liberating feeling for Makoto Miyamura, who had not felt “free” in quite some time. And the only thing that could make it better would be a penis stuffed inside of her."
    },
    {
      "character": "narrator",
      "text": "Unfortunately, Ayane Amamiya did not have a penis. She had a vagina. "
    },
    {
      "character": "narrator",
      "text": "And so Makoto Miyamura’s options were limited to: waiting, sex toys (this is the answer she would choose), or raping a man — a thing she didn’t want to do."
    },
    {
      "character": "narrator",
      "text": "Regardless of the desires this young, glasses-sporting girl held closest to her heart, a separate heart beating not far from her own belonging to the initial subject beat harder."
    },
    {
      "character": "narrator",
      "text": "It beat faster and more passionately. And it also longed for a penis to be somewhere inside of its host body — but that wasn’t the main priority right now."
    },
    {
      "character": "narrator",
      "text": "The main priority was convincing Makoto that they needed to win Ami’s trust rather than destroy her — as she had now begun to question the words of a mysterious girl presently fading from her mind."
    },
    {
      "character": "narrator",
      "text": "When she opens her mouth, words come out instead of vomit. If only that had been the case in Lesions of Love Volume 0.35.0: The One With the Room."
    },
    {
      "character": "Ayane",
      "text": "I think we should leave the party."
    },
    {
      "character": "Makoto",
      "text": "{i}I understand that you also long for a penis inside of you, but neither one of us possesses one. And so we should stay here instead.{/i} — she doesn’t say this, but she might as well have."
    },
    {
      "character": "Ayane",
      "text": "If I know Ami well, which I’m pretty sure I do, chances are she’s having her own Christmas party with Sensei right now since she’s definitely not coming to this one."
    },
    {
      "character": "Ayane",
      "text": "And I think if the two of us head there, two people she’s already familiar with and trusts to at least {i}some{/i} extent, she might let us join them."
    },
    {
      "character": "Makoto",
      "text": "Is it just me or does that sound a little too easy? This is the same girl who’s refused to let {i}anyone{/i} see him since the two of them left the karaoke booth. Why would tonight be any different?"
    },
    {
      "character": "Ayane",
      "text": "Because miracles {i}always{/i} happen on Christmas."
    },
    {
      "character": "Makoto",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Makoto",
      "text": "Are you fucking kidding me?"
    },
    {
      "character": "Ayane",
      "text": "What?! It’s true! That’s like, the cornerstone of every great Christmas movie ever!"
    },
    {
      "character": "Makoto",
      "text": "Your amazing plan that you called both Maya and {i}me{/i} out to breakfast for was to turn our unbelievably weird and somewhat tragic tale into a {i}Christmas movie?{/i}"
    },
    {
      "character": "Ayane",
      "text": "No. It was to harness the {i}power{/i} of Christmas movies and Christmas cheer to put an end to both Sensei’s sadness and Ami’s insanity so we can all live happily ever after."
    },
    {
      "character": "Makoto",
      "text": "Jesus Christ, you’re just as broken as everybody else, aren’t you?"
    },
    {
      "character": "Ayane",
      "text": "I’m out of ideas, okay?! I had so many when Maya was here and she never let me try them! But now that she {i}isn’t{/i} here, I can’t think of anything at all and it really, really sucks!"
    },
    {
      "character": "Maya",
      "text": "Uhh...hello?"
    },
    {
      "character": "Maya",
      "text": "What’s this about me not being here? And why does it look like you two are about to make out?"
    },
    {
      "character": "Makoto",
      "text": "Because Ayane doesn’t grasp the concept of personal space and {i}I{/i} am far too easygoing."
    },
    {
      "character": "Ayane",
      "text": "Easygoing?! You made our classroom sound like the Hunger Games just a few minutes ago and talked about how we’re all going to have to betray one another! That isn’t easygoing! It’s crazy!"
    },
    {
      "character": "Maya",
      "text": "What’s a hunger game? I want to play."
    },
    {
      "character": "Sana",
      "text": "When...did you two get so close?..."
    },
    {
      "character": "Makoto",
      "text": "When Ayane grabbed me, obviously. Now, quick. Someone help. Before I am converted."
    },
    {
      "character": "Ayane",
      "text": "Converted to what?! We’re both straight!"
    },
    {
      "character": "Miku",
      "text": "Everybody, look! First, it was Kirin and Noriko! Now Makoto and Ayane are gonna make out too!"
    },
    {
      "character": "Noriko",
      "text": "We never kissed! And the entire idea of mistletoe is a lie perpetuated by first-century Celtic druids who falsely believed it led to increased fertility!"
    },
    {
      "character": "Molly",
      "text": "Oi! You leave my people outta this!"
    }
  ],
  "state_changes": {
    "springtime11": {
      "from": null,
      "to": true
    }
  }
}