{
  "event_id": 319,
  "event_label": "springtime14",
  "dialogue": [
    {
      "character": "narrator",
      "text": "{i}Far, far away...in a distant land...{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}That also happens to be a hotel room...{/i}"
    },
    {
      "character": "Molly",
      "text": "Lidearel’s blade ricochets off the worm’s natural armor! And the clang of steel carries across the transparent floor of the void until it’s lost in the dark!"
    },
    {
      "character": "Molly",
      "text": "Lidearel — as you recoil from your missed attack, the worm burrows back into the smoke beneath your feet, fading from your vision and disappearing into an endless black."
    },
    {
      "character": "Molly",
      "text": "Suddenly, the ground begins to shake, knocking you prone. The smoke starts to disperse...and you hear a deep, wet rumbling beneath you. "
    },
    {
      "character": "Rin",
      "text": "Ew. Why is it wet?"
    },
    {
      "character": "Futaba",
      "text": "It’s a giant worm, Rin. It wouldn’t be as intimidating if it wasn’t wet."
    },
    {
      "character": "Rin",
      "text": "It’s like sixty feet long, isn’t it? I think it’d be plenty intimidating without the wetness."
    },
    {
      "character": "Molly",
      "text": "Silence!...is what comes next. "
    },
    {
      "character": "Molly",
      "text": "A long silence as the rumble fades along with the smoke. The dark becomes darker, but your eyes begin to slowly adjust. Yet, the light from Urrheak’s mace is the only thing keeping you sane."
    },
    {
      "character": "Molly",
      "text": "Except for those of you with darkvision. So...Rin and Futaba."
    },
    {
      "character": "Molly",
      "text": "And with that, it is Zagull’s turn."
    },
    {
      "character": "Sana",
      "text": "That’s right! Run away! That’ll teach you to mess with Zagull Throat Spear!"
    },
    {
      "character": "Sana",
      "text": "Zagull slams the...handle thing...of his battle axe into the ground and...lets out a war cry!"
    },
    {
      "character": "Molly",
      "text": "Zagull’s blood begins to boil as he goes into a rage! But upon striking the ground, you deal one damage to Lidearel as she’s prone right next to you and you are very strong."
    },
    {
      "character": "Sana",
      "text": "Not the best spot to take a nap...is it, human?"
    },
    {
      "character": "Ayane",
      "text": "Well excuse me, {i}orc.{/i} But some of us would prefer to fight with {i}speed{/i} rather than power. Which might be why {i}some of us{/i} still have all our limbs."
    },
    {
      "character": "Molly",
      "text": "Zagull, do you do anything else? Or is that your turn?"
    },
    {
      "character": "Sana",
      "text": "We still can’t...see the worm?"
    },
    {
      "character": "Molly",
      "text": "Correct. It’s burrowed."
    },
    {
      "character": "Sana",
      "text": "Then...that’s my turn..."
    },
    {
      "character": "Molly",
      "text": "Zagull and Lidearel stop arguing long enough for Urrheak to regain his footing as he prepares to..."
    },
    {
      "character": "Maya",
      "text": "Fly."
    },
    {
      "character": "Molly",
      "text": "Okay! So Urrheak’s footing is not prepared for long as he quickly ascends above the rest of his party."
    },
    {
      "character": "Maya",
      "text": "After that, I retreat to Nithhala’s position and cast {i}lesser restoration{/i} on her."
    },
    {
      "character": "Molly",
      "text": "Urrheak blankets the Tiefling warlock with his wings, and she can feel the poison coursing through her veins slowly begin to dissipate. The poison is gone. But the puncture wound still stings."
    },
    {
      "character": "Rin",
      "text": "Thanks, bird bro. I knew I could count on you."
    },
    {
      "character": "Maya",
      "text": "Scraw."
    },
    {
      "character": "Molly",
      "text": "Nithhala does not understand your response as she does not speak bird. Is that your turn?"
    },
    {
      "character": "Maya",
      "text": "Before I end my turn, I move back toward my original position in the air and turn to address the group."
    },
    {
      "character": "Molly",
      "text": "In birdspeak or common?"
    },
    {
      "character": "Maya",
      "text": "Common — Lidearel. Zagull. This is not the time to argue. We need to spread out before the beast returns. Form a circle and-"
    },
    {
      "character": "Molly",
      "text": "Before Urrheak can finish his sentence, the rumbling returns! Faster than and louder and {i}wetter{/i} than ever before! "
    },
    {
      "character": "Rin",
      "text": "Ew! Come on!"
    },
    {
      "character": "Molly",
      "text": "And with it, comes the worm! It passes directly through the floor of the abyss that remains solid and firm for the lot of you!"
    },
    {
      "character": "Molly",
      "text": "Urrheak, dwarfed by the colossal beast, is unable to react in time. "
    },
    {
      "character": "Molly",
      "text": "And as it descends back to the ground to re-engage, it attempts to bite him. "
    },
    {
      "character": "Maya",
      "text": "From the sky? Are you kidding? I’m supposed to be safe up here. I’m a bird."
    },
    {
      "character": "Futaba",
      "text": "It {i}is{/i} a sixty foot worm. You wouldn’t have been able to get high enough in just one turn to avoid it unless you used both your action {i}and{/i} bonus action on-"
    },
    {
      "character": "Maya",
      "text": "I retract my lesser restoration. Nithhala can stay poisoned."
    },
    {
      "character": "Rin",
      "text": "Nooo! I only have like 10 HP left! "
    },
    {
      "character": "Futaba",
      "text": "Then use a potion, Rin."
    },
    {
      "character": "Rin",
      "text": "No! I’m saving them for when I need them!"
    },
    {
      "character": "Ayane",
      "text": "Is this not-"
    },
    {
      "character": "Molly",
      "text": "Silence!"
    },
    {
      "character": "Molly",
      "text": "The worm manages to bite Urrheak's leg as it descends."
    },
    {
      "character": "Molly",
      "text": "Dealing a total of..."
    },
    {
      "character": "Molly",
      "text": "Dealing a total of 19 damage. Then another 5 damage to the rest of the party when it slams back into the ground, which Urrheak manages to avoid on account of being a bird."
    },
    {
      "character": "Maya",
      "text": "Jesus. Now I really want Nithhala to be poisoned again."
    },
    {
      "character": "Molly",
      "text": "Urrheak, go ahead and make a dex saving roll."
    },
    {
      "character": "Maya",
      "text": "And if I refuse?"
    },
    {
      "character": "Molly",
      "text": "You will be swallowed by the worm."
    },
    {
      "character": "Maya",
      "text": "The worm already landed. It’s on the ground now. Is it going to jump back into the sky to try and eat me? Because that seems a little excessive."
    },
    {
      "character": "Molly",
      "text": "{i}No.{/i} This is the second part of its bite attack. It bites you, then you have to make a dexterity saving throw to see whether or not you’re swallowed."
    },
    {
      "character": "Maya",
      "text": "I think I should get a pass on this since it already landed and damaged everyone else."
    },
    {
      "character": "Molly",
      "text": "You feckin’...fine! I’ll make sure to be {i}extra{/i} careful about the order in which I narrate things in the future."
    },
    {
      "character": "Maya",
      "text": "Thank you. I appreciate that."
    },
    {
      "character": "Sana",
      "text": "I’m starting to think this...worm is intentionally avoiding me...It keeps burrowing before I get the chance to attack it..."
    },
    {
      "character": "Futaba",
      "text": "It probably senses that you’re its biggest threat."
    },
    {
      "character": "Futaba",
      "text": "Molly, I should have knowledge of this creature based on my background, right? Because I know what it is, but I don’t want to share any details about it if it’s going to be meta-gaming."
    },
    {
      "character": "Molly",
      "text": "That is correct. Xessaxia would have a somewhat advanced knowledge of what this creature is based on her past as a hunter."
    },
    {
      "character": "Futaba",
      "text": "Is the worm’s turn over? Can I go now?"
    },
    {
      "character": "Molly",
      "text": "Yes, you may take your turn."
    },
    {
      "character": "Futaba",
      "text": "Zagull! Try and stay still! This creature can sense movement! It feels how heavy you are and is trying to stay away from you!"
    },
    {
      "character": "Ayane",
      "text": "I’m sure it doesn’t help that he keeps yelling either."
    },
    {
      "character": "Futaba",
      "text": "There is also that, yes."
    },
    {
      "character": "Sana",
      "text": "Stay still?! You expect the great Zagull Throat Spear to stay {i}still?!{/i} I will have this worm’s heart!"
    },
    {
      "character": "Sana",
      "text": "W...Worms have hearts, right?"
    },
    {
      "character": "Molly",
      "text": "Uh...p...probably?"
    },
    {
      "character": "Futaba",
      "text": "After warning Zagull about the worm, I retreat 30 feet and aim my bow at it."
    },
    {
      "character": "Futaba",
      "text": "Xessaxia draws the bowstring back and launches a ranged attack."
    },
    {
      "character": "Futaba",
      "text": "That is a...24."
    },
    {
      "character": "Molly",
      "text": "Hit. Roll for damage."
    },
    {
      "character": "Futaba",
      "text": "I’m going to use {i}colossus slayer{/i} here as well."
    },
    {
      "character": "Molly",
      "text": "Go ahead."
    },
    {
      "character": "Futaba",
      "text": "That is...13 points of damage."
    },
    {
      "character": "Futaba",
      "text": "Then, once the arrow connects, Xessaxia redraws the string and fires again."
    },
    {
      "character": "Futaba",
      "text": "This time it’s...a 21."
    },
    {
      "character": "Molly",
      "text": "Also a hit. Roll for damage."
    },
    {
      "character": "Futaba",
      "text": "Then, without colossus slayer, that’s another..."
    },
    {
      "character": "Futaba",
      "text": "That’s another 9 points of damage."
    },
    {
      "character": "Molly",
      "text": "Despite taking two direct hits from Xessaxia’s longbow, the great worm pays little attention to the damage it receives, completely ignoring the arrows stuck in its side!"
    },
    {
      "character": "Molly",
      "text": "You can tell the creature is nowhere near finished just yet as it lets out a shrill scream that carries across the abyss and sinks deep into the backs of your minds."
    },
    {
      "character": "Molly",
      "text": "But when it arrives there, it changes into something you can {i}understand.{/i}"
    },
    {
      "character": "Molly",
      "text": "While the shape it takes is not one of words or language, it’s one of nostalgia. It brings back memories from your past that you’d all but forgotten. But then...they fade."
    },
    {
      "character": "Molly",
      "text": "And you’re right back in the abyss, face to face with a creature that seems far too powerful to defeat."
    },
    {
      "character": "Rin",
      "text": "Nothing is too powerful for Nithhala, the tiefling warlock with 5 HP!"
    },
    {
      "character": "Molly",
      "text": "That’s very nice, Nithhala. But it’s Ram’s turn right now."
    },
    {
      "character": "Rin",
      "text": "Damn it. But what if Tsuneyo gets the last hit and I can’t feed its soul to my staff?"
    },
    {
      "character": "Molly",
      "text": "Were you not listening? The creature is nowhere near...actually, forget it. Ram, what do you want to do?"
    },
    {
      "character": "Molly",
      "text": "Remember, you still have all your spell slots available. And casting something with utility in a tense group battle like this should-"
    },
    {
      "character": "Tsuneyo",
      "text": "I would like to use {i}vicious mockery.{/i}"
    },
    {
      "character": "Rin",
      "text": "Good call. If we can’t defeat it, we might as well make it feel really insignificant right before it kills all of us."
    },
    {
      "character": "Molly",
      "text": "Are you...sure that’s what you want to do, Ram?"
    },
    {
      "character": "Tsuneyo",
      "text": "I have never been more sure of anything in my life. I have figured out this boss battle and am prepared to put an end to the great worm."
    },
    {
      "character": "Molly",
      "text": "Well, alright. Go ahead and insult the worm."
    },
    {
      "character": "Tsuneyo",
      "text": "{i}Great{/i} worm? More like not-so-great worm. Bam. Zoom. Mockery complete."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Tsuneyo",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "The worm does not react."
    },
    {
      "character": "Tsuneyo",
      "text": "Damn it. It must be deaf."
    },
    {
      "character": "Rin",
      "text": "Hey, for your bonus action, can you give me {i}bardic inspiration?{/i} I’ve got an idea for my next turn and, with {i}my{/i} rolls, I need all the help I can get."
    },
    {
      "character": "Tsuneyo",
      "text": "I am a failure. I can not inspire anyone. I end my turn."
    },
    {
      "character": "Rin",
      "text": "Ugh...god damn it."
    },
    {
      "character": "Molly",
      "text": "Nithhala, how do you proceed?"
    },
    {
      "character": "Rin",
      "text": "Question first — what is the current state of the worm’s mouth?"
    },
    {
      "character": "Molly",
      "text": "W-"
    },
    {
      "character": "Rin",
      "text": "Don’t say wet."
    },
    {
      "character": "Molly",
      "text": "I was going to say “what” because I have no idea what that means."
    },
    {
      "character": "Rin",
      "text": "Like, is its mouth open or closed?"
    },
    {
      "character": "Ayane",
      "text": "Why wouldn't you just-"
    },
    {
      "character": "Molly",
      "text": "Its mouth is open."
    },
    {
      "character": "Rin",
      "text": "Then, I want to use that scroll I found in a chest during our last adventure."
    },
    {
      "character": "Maya",
      "text": "You mean the “Scroll of TBD?”"
    },
    {
      "character": "Ayane",
      "text": "Is that its actual name? I thought that was just a placeholder."
    },
    {
      "character": "Futaba",
      "text": "Um...Rin? Shouldn’t you let someone who...can actually hit with spells...use that scroll?"
    },
    {
      "character": "Maya",
      "text": "I’m on Futaba’s side. That thing’s too mysterious to waste on a 5. I want to know what it does."
    },
    {
      "character": "Rin",
      "text": "No! It’s my scroll and I want to actually do something for once!"
    },
    {
      "character": "Rin",
      "text": "I refuse to go down without a fight and, as it stands, I’m going to die the next time this thing looks at me!"
    },
    {
      "character": "Rin",
      "text": "Molly, I activate the scroll and attempt to throw it into the worm's mouth."
    },
    {
      "character": "Molly",
      "text": "Uhh...okay. Go ahead and roll to hit, I guess?"
    },
    {
      "character": "Rin",
      "text": "I will! And I will now roll something that is hopefully higher than a 5!"
    },
    {
      "character": "Tsuneyo",
      "text": "We are all doomed. It has been a fun campaign."
    },
    {
      "character": "Sana",
      "text": "D...Don’t give up now, Tsuneyo...Rin might...I mean...N...Nithhala might..."
    },
    {
      "character": "Rin",
      "text": "Silence...I need to {i}focus.{/i}"
    },
    {
      "character": "Futaba",
      "text": "On...what?"
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "!......."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "..."
    },
    {
      "character": "Molly",
      "text": "..."
    },
    {
      "character": "Rin",
      "text": "Holy fuck, I rolled a 20!"
    },
    {
      "character": "Molly",
      "text": "What? No way. You-"
    },
    {
      "character": "Molly",
      "text": "Odin’s beard...that’s a natural 20."
    },
    {
      "character": "Rin",
      "text": "Maya...the dice you got me for Christmas broke my curse...I can roll higher than a 5 now!"
    },
    {
      "character": "Maya",
      "text": "Hooray. Now, here’s hoping you roll a 10,000 for damage so we can kill this thing and get our reward."
    },
    {
      "character": "Molly",
      "text": "Rin, I can’t believe I’m saying this, but roll for damage."
    },
    {
      "character": "Rin",
      "text": "Hell yeah! I’ve waited my whole life to hear those words!"
    },
    {
      "character": "Rin",
      "text": "That’s...30 points of damage."
    },
    {
      "character": "Molly",
      "text": "It's 60, actually. You see, this is an ancient scroll created by the Order of the Flame that combines all of the great fire magics into-"
    },
    {
      "character": "Rin",
      "text": "Awesome, yeah. Just tell me how much damage I do because I've never been able to actually {i}do{/i} any damage before and this is new and exciting to me."
    },
    {
      "character": "Molly",
      "text": "Uhh...Well, I suppose that depends on the worm’s dex saving roll. Let’s see."
    },
    {
      "character": "Futaba",
      "text": "It has to make a saving throw too?"
    },
    {
      "character": "Molly",
      "text": "Like I was saying, it's a very complicated spell that-"
    },
    {
      "character": "Rin",
      "text": "Doesn't matter! Numbers, please!"
    },
    {
      "character": "Molly",
      "text": "Hah..."
    },
    {
      "character": "Molly",
      "text": "That’s...yup."
    },
    {
      "character": "Molly",
      "text": "The worm takes 60 points of damage, but an additional effect triggers due to the missed save and now Maya has to make a dex saving throw as well."
    },
    {
      "character": "Rin",
      "text": "Wait, what?"
    },
    {
      "character": "Maya",
      "text": "Yeah, what? Why? Did this ancient order of fire mages have a thing against birds? Is there anti-avian technology embedded into the scroll?"
    },
    {
      "character": "Molly",
      "text": "No. It's because every creature in a 20-foot radius surrounding the scroll's point of impact is subject to an additional aftershock effect."
    },
    {
      "character": "Maya",
      "text": "I cure you and you {i}kill{/i} me? This is the thanks I get?"
    },
    {
      "character": "Rin",
      "text": "B-But! The...the scroll went into its mouth! Maya should be safe! The aftershock should like...hurt the worm's organs or something!"
    },
    {
      "character": "Maya",
      "text": "That’s right, Nithhala. You {i}beg{/i} to make this right."
    },
    {
      "character": "Molly",
      "text": "It {i}will{/i} damage the worm's organs. It will just {i}also{/i} damage Maya because the aftershock isn't impacted by corners and other LOS-breaking obstacles or obstructions."
    },
    {
      "character": "Rin",
      "text": "Mouths aren’t corners! They’re mouths!"
    },
    {
      "character": "Maya",
      "text": "{i}Unbelievable.{/i}"
    },
    {
      "character": "Futaba",
      "text": "Rin, it’s okay. Maya isn’t dead yet. And if she’s downed, she can heal herself as soon as we pick her back up."
    },
    {
      "character": "Molly",
      "text": "Maya. Your roll. And don’t even try to talk your way out of this one."
    },
    {
      "character": "Maya",
      "text": "Tch."
    },
    {
      "character": "Maya",
      "text": "That’s...17."
    },
    {
      "character": "Molly",
      "text": "The abyss glows orange as Nithhala activates the scroll!"
    },
    {
      "character": "Molly",
      "text": "The deafening sound of a roaring flame fills the room before a giant sphere of fire forms in the mouth of the worm, exploding seconds later and igniting both the worm {i}and{/i} the Aarakocra."
    },
    {
      "character": "Molly",
      "text": "The worm takes 60 points of damage and winces, yet still appears to be mostly unshaken once the initial pain is gone!"
    },
    {
      "character": "Molly",
      "text": "Thankfully for Urrheak, the force of the blast combined with his presence in the air sends him flying back 20 feet! But he still takes 30 points of damage from the fire and collapses to the floor."
    },
    {
      "character": "Rin",
      "text": "I’m sorry, Maya!"
    },
    {
      "character": "Maya",
      "text": "It’s fine. Just help me back up and I’ll heal myself like Futaba said."
    },
    {
      "character": "Sana",
      "text": "Who’s next?...It’s...Lidearel again, isn’t it?"
    },
    {
      "character": "Molly",
      "text": "Yes..."
    },
    {
      "character": "Molly",
      "text": "{i}But...{/i}"
    },
    {
      "character": "Molly",
      "text": "The worm pauses. You can sense that something is...{i}changing.{/i}"
    },
    {
      "character": "Molly",
      "text": "The smoke that occupied the space beneath the abyssal floor grows...you can see it expanding! Filling up and pressing against what you can only rationalize as an invisible barrier!"
    },
    {
      "character": "Molly",
      "text": "Lighting forms within the smoke, like storm clouds surging! Prepared to rain chaos on whatever lies beneath the surface!"
    },
    {
      "character": "Molly",
      "text": "But then it stops..."
    },
    {
      "character": "Molly",
      "text": "Everything stops..."
    },
    {
      "character": "Molly",
      "text": "Yet the darkness does not fade."
    },
    {
      "character": "Molly",
      "text": "The worm slumps down. It looks...{i}tired.{/i}"
    },
    {
      "character": "Molly",
      "text": "In that moment, though...you hear something."
    },
    {
      "character": "Molly",
      "text": "It’s not the sound of a coming storm or another scream that forces you back to a point in life you’d rather forget...it’s another rumbling."
    },
    {
      "character": "Molly",
      "text": "But this time, it comes from {i}inside{/i} the worm."
    },
    {
      "character": "Molly",
      "text": "It opens its mouth wider...You can smell the scorched flesh of its throat as chunks of it begin to peel and fall off, dissolving once they hit the ground."
    },
    {
      "character": "Molly",
      "text": "Then...a silhouette."
    },
    {
      "character": "Molly",
      "text": "From the back of the worm’s throat, you see a humanoid figure walking toward you...fearless. As if he’s walking down a hallway."
    },
    {
      "character": "Molly",
      "text": "But as the figure draws closer, that humanoid silhouette takes on an air of what could only be described as {i}godliness.{/i}"
    },
    {
      "character": "Molly",
      "text": "He towers over all of you, even from a distance — making the great worm’s teeth look like arm-guards as he uses them to regain his balance."
    },
    {
      "character": "Molly",
      "text": "He uses its tongue like a set of stairs...descending without a care in the world until he stands right before Urrheak."
    },
    {
      "character": "Molly",
      "text": "You notice his head, cloaked in white rags, revealing {i}nothing{/i} of his face. And the color of his skin, so white that it becomes a {i}new{/i} light in the darkness as Urrheak’s mace fizzles out."
    },
    {
      "character": "Molly",
      "text": "The worm slinks away...burrowing back into the ground and disappearing into the smoke as the giant man stands tall."
    },
    {
      "character": "Molly",
      "text": "He does not act. He does not attack. He simply stands there...waiting."
    },
    {
      "character": "Maya",
      "text": "But...he’s standing in front of me? Specifically?"
    },
    {
      "character": "Molly",
      "text": "Yes. But you’re unable to tell if it’s intentional or not as he does not speak. He does not even acknowledge your existence."
    },
    {
      "character": "Futaba",
      "text": "Do any of us know what sort of being this creature is?"
    },
    {
      "character": "Molly",
      "text": "Hm..."
    },
    {
      "character": "Molly",
      "text": "Ram, roll for history."
    },
    {
      "character": "Tsuneyo",
      "text": "You got it, dude."
    },
    {
      "character": "Rin",
      "text": "Ram? Why Ram?"
    },
    {
      "character": "Tsuneyo",
      "text": "I rolled a 5. Nithhala must have passed her curse onto me."
    },
    {
      "character": "Molly",
      "text": "No one knows what sort of being this creature is — but you can tell that, like the great worm, its power is on a level far from yours."
    },
    {
      "character": "Molly",
      "text": "Yet...it seems almost frail in a way. Like it’s not asking for help, but...{i}expecting{/i} it. And you can only imagine how powerful it would feel if it {i}received{/i} it."
    },
    {
      "character": "Maya",
      "text": "Should we, like...{i}ask?{/i} It’s obviously not hostile if it hasn’t attacked us yet."
    },
    {
      "character": "Futaba",
      "text": "I...don’t know. As Xessaxia, I mean. Because, as Futaba, I have an idea of...what it could be, but...I can’t really figure out why it would be inside of a worm."
    },
    {
      "character": "Rin",
      "text": "I think-"
    },
    {
      "character": "Maya",
      "text": "I don’t care about what you think. You nearly killed me."
    },
    {
      "character": "Rin",
      "text": "Yeah, that’s fair."
    },
    {
      "character": "Maya",
      "text": "Sana? Ayane? Any ideas?"
    },
    {
      "character": "Sana",
      "text": "I...don’t really know either."
    },
    {
      "character": "Maya",
      "text": "Ayane then?"
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Maya",
      "text": "Hello? Ayane? Are you still alive?"
    },
    {
      "character": "Ayane",
      "text": "Oh. Yeah...sorry. I..."
    },
    {
      "character": "Ayane",
      "text": "I don’t know either..."
    },
    {
      "character": "Maya",
      "text": "Then, I guess I’ll just speak to it since I can’t imagine we’ll be able to find a way out of here without its help."
    },
    {
      "character": "Rin",
      "text": "You know, it’s all Ami’s fault for getting us into this mess in the first place. And then she has the audacity to not even show up for the boss fight."
    },
    {
      "character": "Molly",
      "text": "Shush. Urrheak, what do you say to the figure?"
    },
    {
      "character": "Maya",
      "text": "Uh..."
    },
    {
      "character": "Maya",
      "text": "If-"
    },
    {
      "character": "Molly",
      "text": "Upon hearing Urrheak’s voice, the figures head immediately snaps downward, like a statue coming to life or a security camera identifying its target. It locks onto his eyes despite its face still being concealed."
    },
    {
      "character": "Maya",
      "text": "Uh..."
    },
    {
      "character": "Maya",
      "text": "If you wouldn’t mind, could you give me a hand? I’ve found myself slightly injured after playing with your {i}pet{/i} just now."
    },
    {
      "character": "Molly",
      "text": "The figure does not respond."
    },
    {
      "character": "Ayane",
      "text": "Maybe we should just...you know...leave the weird figure alone and go look for a way out? He might not be hostile, but it doesn’t seem like he wants to help."
    },
    {
      "character": "Maya",
      "text": "Maybe he just can’t hear us? He’s got that thing covering his head after all."
    },
    {
      "character": "Sana",
      "text": "He might...need us to free him? Like...he can’t remove the covering for some reason?..."
    },
    {
      "character": "Rin",
      "text": "Should one of us walk up to it? Urrheak’s still down, so he can’t. Right?"
    },
    {
      "character": "Molly",
      "text": "Enough time has passed for Urrheak to be able to pick himself back up if he wants to."
    },
    {
      "character": "Maya",
      "text": "I guess I can try. But maybe we should all heal ourselves first in case another fight starts?"
    },
    {
      "character": "Futaba",
      "text": "Can we take a short rest here?"
    },
    {
      "character": "Molly",
      "text": "You may not rest here, no."
    },
    {
      "character": "Rin",
      "text": "You’ve gotta be careful with healing too. It could interpret that as a hostile action."
    },
    {
      "character": "Sana",
      "text": "You’re just...saying that because you...don’t want to share any of your potions..."
    },
    {
      "character": "Rin",
      "text": "Maya can have one. She’s earned it."
    },
    {
      "character": "Maya",
      "text": "In that case, I take {i}two{/i} healing potions from Nithhala and use them on myself before making my way back over to the weird giant figure."
    },
    {
      "character": "Rin",
      "text": "Hey! I said one!"
    },
    {
      "character": "Maya",
      "text": "Sucks to suck."
    },
    {
      "character": "Maya",
      "text": "That’s...14 points of healing. Probably not ideal, but I don’t want to be out of spell slots if we wind up getting into another fight, so I’ll take it."
    },
    {
      "character": "Molly",
      "text": "Urrheak gulps down the potions and can feel his vitality beginning to return."
    },
    {
      "character": "Maya",
      "text": "I guess I have to fly up to this thing’s head then, right? Isn’t it like, crazy tall?"
    },
    {
      "character": "Molly",
      "text": "Is that what you do?"
    },
    {
      "character": "Maya",
      "text": "I guess so, yeah."
    },
    {
      "character": "Molly",
      "text": "You arrive at the figure’s head and find that it’s about twice the size of your body. Thanks to the silence in the void, you’re able to hear a strange {i}whirring{/i} sound emitting from behind the covering."
    },
    {
      "character": "Maya",
      "text": "A...whirring sound?"
    },
    {
      "character": "Molly",
      "text": "Yes, a whirring sound."
    },
    {
      "character": "Maya",
      "text": "Then...Urrheak attempts to remove the covering on the figure’s head."
    },
    {
      "character": "Molly",
      "text": "As Urrheak begins to peel away layer after layer of cloth, a wave of calm washes over him. He’s enjoying himself."
    },
    {
      "character": "Molly",
      "text": "He thinks back to when he was a cleric in training — still coming to terms with his faith and learning the ways of his god."
    },
    {
      "character": "Molly",
      "text": "He remembers wrapping bandages on troops returning from battle...and {i}unwrapping{/i} fresh loaves of bread and wheels of cheese that he’d purchased at the market for his family."
    },
    {
      "character": "Molly",
      "text": "Those days seemed so far away now..."
    },
    {
      "character": "Maya",
      "text": "What is happening?"
    },
    {
      "character": "Molly",
      "text": "As Urrheak continues to peel away at the cloth, he notices a faint purple light hiding behind it. It becomes clear that that’s where the whirring is coming from."
    },
    {
      "character": "Maya",
      "text": "Molly, what the fuck is this weird creature?"
    },
    {
      "character": "Molly",
      "text": "He continues to unwrap the cloth...but as he gets closer to the truth of the creature’s face, the calmness never fades. It just keeps growing...and growing...and growing..."
    },
    {
      "character": "Futaba",
      "text": "Urrheak! Come back down! I don’t like this!"
    },
    {
      "character": "Maya",
      "text": "Yeah. Urrheak’s going to head back down now."
    },
    {
      "character": "Molly",
      "text": "A voice in the back of Urrheak’s head begs him to stop, but he shrugs it off as he continues to unwrap the cloth. Then, he quickly forgets the voice ever existed in the first place."
    },
    {
      "character": "Maya",
      "text": "Isn’t there...some kind of saving throw I could use here? Maybe that dex roll I never got to use before?"
    },
    {
      "character": "Molly",
      "text": "Finally, the last bit of cloth drops to the floor. And once it does, Urrheak’s complacency vanishes."
    },
    {
      "character": "Molly",
      "text": "As he gazes at the figure, he notices no face — but a gaping hole with a deep purple glow circling the rim, and he feels {i}fear.{/i}"
    },
    {
      "character": "Molly",
      "text": "But he is unable to act."
    },
    {
      "character": "Futaba",
      "text": "Xessaxia draws her bowstring and-"
    },
    {
      "character": "Molly",
      "text": "The figure stomps its foot, destroying the barrier our heroes stood on in all but {i}one{/i} spot, {i}his...{/i}while the rest of them fall helplessly into the void."
    },
    {
      "character": "Molly",
      "text": "The whirring gets louder."
    },
    {
      "character": "Molly",
      "text": "Then, as Urrheak stares into the void inside a void — a gaping hole where a set of eyes should be, he has one more thought. But he can’t tell if it’s his or not."
    },
    {
      "character": "Molly",
      "text": "All it says is this."
    },
    {
      "character": "Molly",
      "text": "“I’ve accomplished nothing.”"
    },
    {
      "character": "Molly",
      "text": "The figure sucks him into the hole where its face should be."
    },
    {
      "character": "Molly",
      "text": "Urrheak takes 10,000 points of damage."
    },
    {
      "character": "narrator",
      "text": "{i}Urrheak has been slain!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "springtime14": {
      "from": null,
      "to": true
    }
  }
}