{
  "event_id": 320,
  "event_label": "springtime15",
  "dialogue": [
    {
      "character": "narrator",
      "text": "It sings in its sleep."
    },
    {
      "character": "narrator",
      "text": "Not the mouth on the head of the body with the arms that hold the world up, but the inarguable distance between the four points of focus on an uncapitalized letter T."
    },
    {
      "character": "narrator",
      "text": "The melody is like milk — white, but entirely impure. "
    },
    {
      "character": "narrator",
      "text": "Delicious, yet difficult to digest after going long periods of time without a sip or two."
    },
    {
      "character": "narrator",
      "text": "It coats your tongue as you drink it down and you revel in the sensation of its makeshift mucosal barrier protecting you from tasting the roof of your mouth."
    },
    {
      "character": "narrator",
      "text": "When you were younger, when the ring still wrapped around your limbs, this would be the type of thought you would focus on."
    },
    {
      "character": "narrator",
      "text": "On those long nights where the position of the moon would hurt your eyes as you tried to sleep, there was naught to do but pay homage to the little things."
    },
    {
      "character": "narrator",
      "text": "If you did it enough times — if you acknowledged every speck of matter in the room, you’d consider yourself protected from the light that kept you up."
    },
    {
      "character": "narrator",
      "text": "You’d consider yourself thankful enough to make it through this half-dark descent without so much as a divine scratch — for a scratch from a higher power would burn you from the inside out. "
    },
    {
      "character": "narrator",
      "text": "And you didn’t want that."
    },
    {
      "character": "narrator",
      "text": "And {i}because{/i} you didn’t want that, those little things were torturous. Yet you couldn’t resist focusing on them because that’s what you {i}always{/i} did."
    },
    {
      "character": "narrator",
      "text": "You focused on things."
    },
    {
      "character": "narrator",
      "text": "Those mittens hanging from that hook you hit your head on once."
    },
    {
      "character": "narrator",
      "text": "That picture of a cow jumping over the moon in the corner of the room and that mouse in this house that still felt like a tomb."
    },
    {
      "character": "narrator",
      "text": "But why?"
    },
    {
      "character": "narrator",
      "text": "Why did it feel that way?"
    },
    {
      "character": "narrator",
      "text": "This was before the world died off."
    },
    {
      "character": "narrator",
      "text": "This was {i}before{/i} you knew what love was. {i}Before{/i} you felt the sting of accidental abandonment and {i}before{/i} the only thing that mattered to you was avoiding those mittens and mice."
    },
    {
      "character": "narrator",
      "text": "You were too young to know something was wrong yet."
    },
    {
      "character": "narrator",
      "text": "But I watched you."
    },
    {
      "character": "narrator",
      "text": "I have always been that which lurks in the shadows — telling you to hush and submit to the all-seeing eye of the night."
    },
    {
      "character": "narrator",
      "text": "The creaking of my chair would be the only lullaby you’d need. And it would distract you from the sickening sounds of your growing inner monologue."
    },
    {
      "character": "narrator",
      "text": "Goodnight, you. Goodnight, moon."
    },
    {
      "character": "narrator",
      "text": "Goodnight everything everywhere, everyone too."
    },
    {
      "character": "narrator",
      "text": "But you never slept."
    },
    {
      "character": "narrator",
      "text": "You never slept."
    },
    {
      "character": "narrator",
      "text": "Why didn’t you ever sleep? "
    },
    {
      "character": "narrator",
      "text": "Why wasn’t my company good enough for you? "
    },
    {
      "character": "narrator",
      "text": "Why didn’t security make you feel secure? And why did that all-seeing eye so often overlook {i}you?{/i} Why YOU? What made {b}YOU{/b} special? Why was it always {size=+15}YOU?{/size}"
    },
    {
      "character": "narrator",
      "text": "At first, I couldn’t tell. But it became clearer as the days went by."
    },
    {
      "character": "narrator",
      "text": "And every time you’d stare at those mittens, I’d get a step closer to realizing something that separated the two of us. Something {i}more{/i} than a carpet and cats."
    },
    {
      "character": "narrator",
      "text": "It’s that I was big...and you were small."
    },
    {
      "character": "narrator",
      "text": "Even now, you’re small. And you’re so caught up in your routines and tendencies that I could abandon you altogether and nothing would change."
    },
    {
      "character": "narrator",
      "text": "You’d still neglect to neglect all matter and space. "
    },
    {
      "character": "narrator",
      "text": "Your eyes would still shut every time you heard the door open — begging for a miracle, but finding a ghost."
    },
    {
      "character": "narrator",
      "text": "You used to believe in God. But I imagine it’s just because you were asked to."
    },
    {
      "character": "narrator",
      "text": "Sometimes, another woman would enter the room and get into the bed with you. "
    },
    {
      "character": "narrator",
      "text": "She’d hold you close and cry into your shoulder, screaming at the top of her lungs about how you smelled like {i}him.{/i} But who {i}was{/i} he anyway? And why did she miss him so much?"
    },
    {
      "character": "narrator",
      "text": "She’d fall asleep beside you. You never knew what to do with your hands. And in those moments, you would always revert to something that made you feel comfortable."
    },
    {
      "character": "narrator",
      "text": "Or at least as close to comfort as you could get without wincing."
    },
    {
      "character": "narrator",
      "text": "Goodnight, clocks. Goodnight, socks. "
    },
    {
      "character": "narrator",
      "text": "Goodnight Jesus and Mary and Joseph and Josh."
    },
    {
      "character": "narrator",
      "text": "But most importantly — goodnight to the figure in the corner of the room."
    },
    {
      "character": "narrator",
      "text": "The one who was always watching over you. "
    },
    {
      "character": "narrator",
      "text": "We never spoke directly, but I could always tell you knew I was there."
    },
    {
      "character": "narrator",
      "text": "And maybe that’s why I still watch you."
    },
    {
      "character": "Ami",
      "text": "“Jim, dear,” she cried, “don’t look at me like that. I had my hair cut off and sold it. I couldn’t live through Christmas without giving you a gift.”"
    },
    {
      "character": "Ami",
      "text": "“My hair will grow again. You won’t care, will you? My hair grows very fast. It’s Christmas, Jim. Let’s be happy. You don’t know what a nice—what a beautiful nice gift I got for you.”"
    },
    {
      "character": "Ami",
      "text": "“You’ve cut off your hair?” asked Jim slowly. He seemed to labor to understand what had happened. He seemed not to feel sure he knew."
    },
    {
      "character": "Ami",
      "text": "“Cut it off and sold it,” said Della. “Don’t you like me now? I’m me, Jim. I’m the same without my hair.”"
    },
    {
      "character": "Ami",
      "text": "Jim looked around the room. “You say your hair is gone?” he said."
    },
    {
      "character": "Ami",
      "text": "“You don’t have to look for it,” said Della. “It’s sold, I tell you— sold and gone, too. It’s the night before Christmas, boy. Be good to me, because I sold it for you.”"
    },
    {
      "character": "Ami",
      "text": "“Maybe the hairs of my head could be counted,” she said, “but no one could ever count my love for you. Shall we eat dinner, Jim?”"
    },
    {
      "character": "Ami",
      "text": "Jim put his arms around his Della. “For ten seconds let us look in another direction. Eight dollars a week or a million dollars a year— how different are they?”"
    },
    {
      "character": "Ami",
      "text": "Someone may give you an answer, but it will be wrong. The magi brought valuable gifts, but that was not among them. My meaning will be explained soon. "
    },
    {
      "character": "Ami",
      "text": "From inside the coat, Jim took something tied in paper. He threw it upon the table. “I want you to understand me, Dell,” he said. “Nothing like a haircut could make me love you any less.”"
    },
    {
      "character": "Ami",
      "text": "“But if you’ll open that, you may know what I felt when I came in.” White fingers pulled off the paper. And then a cry of joy; and then a change to tears."
    },
    {
      "character": "Ami",
      "text": "For there lay The Combs—the combs that Della had seen in a shop window and loved for a long time. Beautiful combs, with jewels, perfect for her beautiful hair. "
    },
    {
      "character": "Ami",
      "text": "She had looked at them without the least hope of owning them. And now they were hers, but her hair was gone. "
    },
    {
      "character": "Ami",
      "text": "But she held them to her heart, and at last was able to look up and say: “My hair grows so fast, Jim!” "
    },
    {
      "character": "Ami",
      "text": "Wasn’t that such a pretty story, Sensei? Two people who love each other so much that they gave away the things that were most important to them just to help {i}each other?{/i}"
    },
    {
      "character": "Ami",
      "text": "Some people say that love is all about sacrifices, you know. And I think I agree! I mean, just look at everything I’ve sacrificed for you."
    },
    {
      "character": "Ami",
      "text": "Doesn’t that make you happy? Aren’t you glad to know I cherish you so much that I’m willing to let my grades slip to take care of you? Which isn’t to say they’ve ever been good, but still."
    },
    {
      "character": "Ami",
      "text": "Oh, and don’t worry about me missing all that work at the maid cafe either. You’re still getting checks from school and I’ve been using them to take care of all the bills so the water can stay on."
    },
    {
      "character": "Ami",
      "text": "We wouldn’t want this to be like Grandma’s house, would we? Like, could you {i}imagine{/i} having to collect water from the lake just to take a bath? That sounds horrible."
    },
    {
      "character": "Ami",
      "text": "I’m just glad our house is so safe, you know? Especially with all the extra stuff I’ve done to make sure nobody can hurt you in here. But it’s not like we’ll need that forever!"
    },
    {
      "character": "Ami",
      "text": "Once you’re all better, we can take down the locks and you can go back to being a teacher like you’ve always wanted! "
    },
    {
      "character": "Ami",
      "text": "{i}Only{/i} when you’re better, though. Which means being strong enough to keep other people from taking advantage of you all the time. Got it, mister? "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Nuh-uh. You’re doing a {i}great{/i} job, [amimaster]! I mean that! And you’re the only person I’d never ever lie to."
    },
    {
      "character": "Ami",
      "text": "It hurts a little, you know. Having to be the bad guy, I mean. It’d be {i}great{/i} to let everybody back into the house again. It’d be {i}great{/i} being able to go to the Christmas party."
    },
    {
      "character": "Ami",
      "text": "It just isn’t safe anymore. Too many people are trying to take advantage of you. And since I’m your wonderful, loving, amazing, beautiful, gorgeous niece, I refuse to let that happen."
    },
    {
      "character": "Ami",
      "text": "But maybe once people can gain my trust back, I’ll let them in. Like Ayane, for example! She’s been coming here so often that I’m starting to think she might actually want to help you."
    },
    {
      "character": "Ami",
      "text": "Visits would be supervised, of course. She {i}has{/i} had a crush on you for a long time, but I think she’s close to understanding her place now and won’t try anything stupid."
    },
    {
      "character": "Ami",
      "text": "And if she does, I’ll just have to make sure she’s never able to again. But how would I do that, I wonder?"
    },
    {
      "character": "Ami",
      "text": "Do you have any ideas, Sensei?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Ah! Sensei! I’m happy you’re so dedicated to me, but surely you don’t think we’d have to do something {i}that{/i} serious, do you? I mean...we’ve known Ayane forever. I love her!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "No, of course I don’t love her as much as I love you. I’m just saying that-"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "I mean...that {i}is{/i} a good point."
    },
    {
      "character": "Ami",
      "text": "Plus, for all we know, she might just be {i}pretending{/i} to be on our side because she thinks I’m gullible. But I’m not gullible at all. I’m way smarter than anybody gives me credit for."
    },
    {
      "character": "Ami",
      "text": "Like, just look at what I was able to do with the windows. Not everyone could learn how to install bars after just watching a couple Youtube videos, you know?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Hmm...{i}yeah.{/i} Now that you mention it, she {i}has{/i} seemed a little different lately."
    },
    {
      "character": "Ami",
      "text": "I’m glad at least [[redacted] is back to normal, though. She was really starting to get on my nerves. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh, I know. I won’t let her anywhere close, don’t worry. I know how horrible she makes you feel. And my top priority will always be keeping you safe. Okay?"
    },
    {
      "character": "Ami",
      "text": "I love [[redacted]. Girls like her can’t be trusted, though. Especially around awesome and attractive guys like you."
    },
    {
      "character": "Ami",
      "text": "Like, did you know I caught her having sex at the shrine once? "
    },
    {
      "character": "Ami",
      "text": "She denies it was her, of course. And it’s not like I tried to open the door because {i}ew.{/i} But I know [[redacted]’s voice when I hear it. And {i}boy,{/i} did I hear it."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "I know! Like, have some decency. Not only are you supposed to be working, but the shrines are where the gods reside. And doing anything to make a {i}god{/i} angry is a total death sentence."
    },
    {
      "character": "Ami",
      "text": "But yeah, even {i}I{/i} don’t trust her completely. I mean, why would I when she’s so obviously playing at something?"
    },
    {
      "character": "Ami",
      "text": "She’s probably like everybody else at the end of the day — trying to get closer to you so she can fulfill her crazy, perverted fantasies. She’ll never actually {i}love{/i} you, though."
    },
    {
      "character": "Ami",
      "text": "Nobody will. Which isn’t to say there’s something wrong with you, of course. You’re perfect. "
    },
    {
      "character": "Ami",
      "text": "But there are parts of you I know you’ll never share with anyone else. And you can’t love someone romantically if you only know {i}half{/i} of their story, right?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Really? You don’t know {i}anything{/i} about her? "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Then, that’s probably why she makes you so uncomfortable. But like I said, you don’t have to worry about [[redacted]. I can’t imagine she’ll be bothering you so long as you’re here."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Well, why didn’t you just say so?! It’s not like I’m {i}trying{/i} to kill the Christmas mood. I just thought you were getting bored of all your old books since I’ve been reading them to you all night."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "One of {i}my{/i} poems? Are you sure? There are like, a zillion people who are better than me when it comes to that stuff."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Jeez! You too?"
    },
    {
      "character": "Ami",
      "text": "I swear, it’s like {i}everybody’s{/i} been on my case since I won that contest thingy. You’re all blowing this way out of proportion. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh, not at all! It gets on my nerves when {i}they{/i} bug me about it, but I could never be annoyed with you, Sensei. Of course I’ll read you a poem. "
    },
    {
      "character": "Ami",
      "text": "I just can’t guarantee you’ll enjoy it since it’s the first time I’ve ever made one with, like...a Christmas theme to it."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Yeah. Just don’t be {i}too{/i} harsh on me if it’s not good."
    },
    {
      "character": "Ami",
      "text": "I break easily, you know. "
    },
    {
      "character": "Ami",
      "text": "It’s the 25th at 2:00 AM — I just heard Santa leave. "
    },
    {
      "character": "Ami",
      "text": "I can’t wait to see my gifts this year. I’ve been up since Christmas Eve."
    },
    {
      "character": "Ami",
      "text": "Mom says to stay put in my room — Dad says I must be good."
    },
    {
      "character": "Ami",
      "text": "But good girls get excited too. I wish they understood-"
    },
    {
      "character": "Ami",
      "text": "How badly that I want those gifts. How wondrous they must be-"
    },
    {
      "character": "Ami",
      "text": "I didn’t even make a list this year. Santa, what’s in store for me?"
    },
    {
      "character": "Ami",
      "text": "A pony or a peony? A dollhouse or a doll?"
    },
    {
      "character": "Ami",
      "text": "Maybe Santa gave me all of them? Maybe Rudolph’s in the hall?"
    },
    {
      "character": "Ami",
      "text": "I can’t help but break the rules this time. I’m so gleeful, I can’t wait."
    },
    {
      "character": "Ami",
      "text": "So I throw open my bedroom door! Sprint down the stairs, but..."
    },
    {
      "character": "Ami",
      "text": "It’s too late."
    },
    {
      "character": "Ami",
      "text": "There’s nothing near the Christmas tree, but that fat man drank the milk."
    },
    {
      "character": "Ami",
      "text": "He ate my homemade cookies and spilled crumbs across the Christmas silk."
    },
    {
      "character": "Ami",
      "text": "Now I’m grounded and in trouble. Mom is angry, Dad is pissed."
    },
    {
      "character": "Ami",
      "text": "And I can’t help but sit and wonder what would happen if I made a list."
    },
    {
      "character": "Ami",
      "text": "If I turned the cuckoo backward, would it cry again at midnight?"
    },
    {
      "character": "Ami",
      "text": "Would Santa break into our home? Should I turn back on the light?"
    },
    {
      "character": "Ami",
      "text": "I’m a good girl every other day. It’s just one rule I defied."
    },
    {
      "character": "Ami",
      "text": "So why should {i}I{/i} be punished while the bad girls play outside?"
    },
    {
      "character": "Ami",
      "text": "With their peonies and ponies. Their dollhouses and dolls."
    },
    {
      "character": "Ami",
      "text": "I watch them from my window. Footsteps echo down the hall-"
    },
    {
      "character": "Ami",
      "text": "I think it’s Santa here again. No, I think it might be God."
    },
    {
      "character": "Ami",
      "text": "He mocks me from behind the door, but I see through his facade."
    },
    {
      "character": "Ami",
      "text": "As it turns out, Santa isn’t real. I’ve accepted nothing is."
    },
    {
      "character": "Ami",
      "text": "That some girls just draw the short straw due to helplessness or haplessness. "
    },
    {
      "character": "Ami",
      "text": "I’m giving up on Christmas. I’m giving up on fate."
    },
    {
      "character": "Ami",
      "text": "Starting now, I’ll make my own gifts. Starting now, I’ll..."
    },
    {
      "character": "Ami",
      "text": "Oh. I forgot to come up with a rhyme for the last line."
    },
    {
      "character": "Ami",
      "text": "Oh well! That was pretty long anyway, wasn’t it?"
    },
    {
      "character": "Ami",
      "text": "It’s no “Visit from St. Nicholas,” but I think it’s pretty okay for the most part."
    },
    {
      "character": "Ami",
      "text": "How did {i}you{/i} feel about it, Sensei?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "No, I don’t think it’s sad at all! In fact, I think it’s pretty hopeful. You see, sometimes, we can’t always get what we want even if we deserve it. So-"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Heheh! Were you not paying attention? I literally {i}just{/i} said we can’t always get what we want. Even {i}if{/i} we deserve it."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh yeah? Are my cookies not good enough for you? You really {i}need{/i} a Christmas cake? "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "[amimaster], do you have any idea what time it is right now? All the shops around here close early on Christmas. I’d have to walk like five miles to find a cake."
    },
    {
      "character": "Ami",
      "text": "Maybe I can bake you one instead? We don’t have enough eggs right now, but I could run to the convenience store really quick if you don’t mind waiting for me. Is that okay?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Yes, I can get you chicken too. I’m sorry for not thinking to pick some up earlier. I have failed you as a niece."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "I love you too..."
    },
    {
      "character": "Ami",
      "text": "Now, just lie right there and don’t move a muscle."
    },
    {
      "character": "Ami",
      "text": "I’ll be back before you even realize I’m gone."
    },
    {
      "character": "narrator",
      "text": "{i}Ami’s affection has increased by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "springtime15": {
      "from": null,
      "to": true
    }
  }
}