{
  "event_id": 322,
  "event_label": "springtime17",
  "dialogue": [
    {
      "character": "narrator",
      "text": "The scene opens with our former hero positioned in the center of his bed, wearing a festive cap while surrounded by fish."
    },
    {
      "character": "narrator",
      "text": "Drool leaks from his mouth — the remnants of an unending dream left there to air dry until his {b}CARETAKER{/b} returns home."
    },
    {
      "character": "narrator",
      "text": "His eyes should be somewhat glazed over or, at the very least, aimed in a direction where it’s not entirely apparent if he is gazing straight forward or into the camera."
    },
    {
      "character": "narrator",
      "text": "It is at this moment that the audience should begin to question just how much of what they are seeing is real if they have not already begun to do this."
    },
    {
      "character": "narrator",
      "text": "A nostalgic knocking sound from a better game plays through the speakers or headphones- but could fall upon deaf ears if the ears in question belong to someone who still doesn’t get it after all this time."
    },
    {
      "character": "narrator",
      "text": "The fish flop about, acting all fish-like, as the narration drones on in an effort to buy some more time until the falling actions of the update commence, ultimately leading to another melancholic montage."
    },
    {
      "character": "narrator",
      "text": "The reader should focus on the phrase “falling actions” in the prior sentence, harkening back to an earlier event in which the words were used to describe our former hero."
    },
    {
      "character": "narrator",
      "text": "Despite his condition, readers should not feel bad for him as he is a terrible man who does terrible things. "
    },
    {
      "character": "narrator",
      "text": "His misery is justified and conceptually sickening given just whose disappearance has evoked such a faulty state."
    },
    {
      "character": "narrator",
      "text": "He should look helpless and lost and readers should take note of that because it’s a new development."
    },
    {
      "character": "narrator",
      "text": "By now, the reader should realize that the knocking on the door was all in our former hero’s head. "
    },
    {
      "character": "narrator",
      "text": "So much of what they’ve seen has been in his head. "
    },
    {
      "character": "narrator",
      "text": "But as they gaze down at him from above, they should once again recall the fish, acting all fish-like, and think to themselves, “This {i}can’t{/i} be in his head if his head is both empty and in-focus.”"
    },
    {
      "character": "narrator",
      "text": "In thinking this, they will be correct. But they should accept the shared delusions as it makes for a more interesting narrative with more room for symbolism and evocative imagery."
    },
    {
      "character": "narrator",
      "text": "They should now be questioning just what is so “evocative” about fish acting all fish-like — or how their inclusion in the recent segments of the story contributes in any form."
    },
    {
      "character": "narrator",
      "text": "The audience does not and will not receive an answer to these questions as the fourth chapter of our story is the saddest of them all."
    },
    {
      "character": "narrator",
      "text": "The love story is over — and left on the bed is a husk of a man who must be brought back to life by force as he has lost all will to live on his own."
    },
    {
      "character": "narrator",
      "text": "Again, a sound plays through the speakers. But this time, it is a more concerning one."
    },
    {
      "character": "Uta",
      "text": "Ah! That was way louder than I thought it would be!"
    },
    {
      "character": "Io",
      "text": "We just broke a window. What did you expect?"
    },
    {
      "character": "narrator",
      "text": "In fact, there have been noises present this entire time."
    },
    {
      "character": "narrator",
      "text": "But despite those noises from the outside leaking in, the man on the bed and the fish do not move. "
    },
    {
      "character": "narrator",
      "text": "For the man, it’s because there is no reason to. It’s because he’s already blocked everything else out and hasn’t even {i}noticed.{/i} Nor could he if he wanted to."
    },
    {
      "character": "narrator",
      "text": "For the fish, it is because they are fish."
    },
    {
      "character": "Uta",
      "text": "Oh god...what if his neighbors heard us? What if they call the cops?! "
    },
    {
      "character": "Io",
      "text": "Can this not wait until we’re inside? Here, I’ll give you a lift. "
    },
    {
      "character": "narrator",
      "text": "NOT PICTURED — Io Ichimonji clasps her hands together, making a flesh-step for Uta Ushibori to use in order to get inside of her teacher’s room."
    },
    {
      "character": "narrator",
      "text": "She obliges and places her foot on the flesh-step, hoisting herself up toward the window as Io pushes."
    },
    {
      "character": "narrator",
      "text": "Uta Ushibori manages to avoid cutting her hands on the glass but, unbeknownst to her, she was about to encounter a much more serious problem."
    },
    {
      "character": "Uta",
      "text": "Okay! I think I’ve got it from- ah!"
    },
    {
      "character": "narrator",
      "text": "She falls."
    },
    {
      "character": "narrator",
      "text": "But it’s not her first experience with falling."
    },
    {
      "character": "Uta",
      "text": "Ngh...ow..."
    },
    {
      "character": "narrator",
      "text": "She’d been gaining a great deal of experience in that field over the last year or so. "
    },
    {
      "character": "narrator",
      "text": "And while the last two months may have caused that to slow down a bit, they do little to slow the beating of her heart when she opened her eyes."
    },
    {
      "character": "narrator",
      "text": "Thump thump. Thump thump. Thump thump."
    },
    {
      "character": "narrator",
      "text": "Hers wasn’t the only heart still beating. But as her hand on the former hero’s sweaty chest becomes familiar with the rhythm of a black heart, she finds no comfort."
    },
    {
      "character": "narrator",
      "text": "Yet she {i}does{/i} find solace."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Uh? Hello? A hand, please?"
    },
    {
      "character": "Uta",
      "text": "Sensei?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Hey — you didn’t die, did you? Did a shard of glass get lodged in your-"
    },
    {
      "character": "Uta",
      "text": "Io! I think...I think something’s wrong!"
    },
    {
      "character": "Io",
      "text": "Well...how wrong? Sensei’s in there, isn’t he?"
    },
    {
      "character": "Uta",
      "text": "I..."
    },
    {
      "character": "Uta",
      "text": "I’m not sure..."
    },
    {
      "character": "narrator",
      "text": "NOT PICTURED — Uta Ushibori breaks away from the man and retreats to the window to help her friend climb inside."
    },
    {
      "character": "narrator",
      "text": "She neglects to stare at his exposed penis, signifying just how serious this situation is."
    },
    {
      "character": "Io",
      "text": "Dorm 7 rescue squad, reporting in for duty! Sorry for the racket. I had a bit of trouble getting the bars off."
    },
    {
      "character": "Uta",
      "text": "Io, I don’t think he’s going to respond to you."
    },
    {
      "character": "Io",
      "text": "Yeah, he doesn’t look too great. But hey, at least he’s got a cute hat on."
    },
    {
      "character": "Uta",
      "text": "Io! Really?!"
    },
    {
      "character": "Io",
      "text": "Sensei, blink if you can hear me. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Io",
      "text": "Yeah, you’re right. Something’s definitely wrong. But his eyes are open, so at least it’s not like he’s in a coma or anything. Probably just catatonic."
    },
    {
      "character": "Uta",
      "text": "But why?..."
    },
    {
      "character": "Io",
      "text": "Well, I imagine we wouldn’t be here if we knew the answer to that. But we are, which means we’ve gotta get a move on before Ami gets back or we’re {i}really{/i} in trouble."
    },
    {
      "character": "Uta",
      "text": "Shouldn’t we call an ambulance or something instead?"
    },
    {
      "character": "Io",
      "text": "Uta, we just broke into a house. I don’t think we should be calling {i}anyone.{/i}"
    },
    {
      "character": "Io",
      "text": "Besides, there’s a chance he’s just {i}on{/i} something. You’ve seen me get like that before after taking too much of my meds. "
    },
    {
      "character": "Io",
      "text": "And if he’s as messed up as Ami’s been making it sound, chances are she’s giving him something to keep him...grounded."
    },
    {
      "character": "Uta",
      "text": "Grounded?...He doesn’t even know we’re here. This isn’t {i}grounded.{/i} He’s {i}gone.{/i}"
    },
    {
      "character": "Io",
      "text": "Lucky for him, I have a million things back at our room that might be able to help with that. But, that’s the thing. {i}We need to get back to our room.{/i} Now, sit him up while I get rid of the broken glass."
    },
    {
      "character": "Io",
      "text": "Getting him through the window will be the hardest part. Just make sure not to knock over the replacement on the way down or I’ll have nothing to...you know, replace the window {i}with.{/i}"
    },
    {
      "character": "Uta",
      "text": "So we’re...{i}really{/i} kidnapping him, huh?"
    },
    {
      "character": "Sensei",
      "text": "No..."
    },
    {
      "character": "Uta",
      "text": "Huh?! Sensei?! Are you awake?!"
    },
    {
      "character": "Sensei",
      "text": "Want..................stay........................."
    },
    {
      "character": "Uta",
      "text": "You...You {i}want{/i} to stay?..."
    },
    {
      "character": "Uta",
      "text": "But-"
    },
    {
      "character": "Io",
      "text": "Could be Stockholm Syndrome. Without knowing what the fuck Ami is doing, it’s hard to say. Like...maybe he really {i}is{/i} just super messed up right now."
    },
    {
      "character": "Uta",
      "text": "S-Sensei! Do you...Can we talk? I really- {i}we{/i} really miss you and...we want to know you’re okay."
    },
    {
      "character": "Sensei",
      "text": "Nothing good.........leaving the house........."
    },
    {
      "character": "Sensei",
      "text": "Learned.......my lesson..........."
    },
    {
      "character": "Sensei",
      "text": "This.........castle..............."
    },
    {
      "character": "Sensei",
      "text": "Things..............protect................."
    },
    {
      "character": "Sensei",
      "text": "L.........."
    },
    {
      "character": "Sensei",
      "text": "Leave me..............."
    },
    {
      "character": "Sensei",
      "text": "Alone.........."
    },
    {
      "character": "Io",
      "text": "Well, that certainly makes this harder."
    },
    {
      "character": "Uta",
      "text": "Io..."
    },
    {
      "character": "Uta",
      "text": "I think we might’ve made a mistake..."
    },
    {
      "character": "Io",
      "text": "Again, we don’t {i}know{/i} that. But we’re definitely not going to find out while we’re in {i}here.{/i} So I say we stick to the original plan of you sitting him up while I get rid of all the glass. Then, we lift."
    },
    {
      "character": "Io",
      "text": "Ami will obviously know Sensei’s missing when she gets back. But I can cover our tracks well enough so  she won’t know it was {i}us{/i} who got him out of here."
    },
    {
      "character": "Io",
      "text": "She’ll probably just think he left on his own and then, boom — Sensei is free again and everything goes back to normal."
    },
    {
      "character": "Uta",
      "text": "Yeah...Yeah. "
    },
    {
      "character": "Uta",
      "text": "He doesn’t actually...{i}want{/i} to stay here. He just..."
    },
    {
      "character": "Uta",
      "text": "He {i}thinks{/i} he does..."
    },
    {
      "character": "Uta",
      "text": "But..."
    },
    {
      "character": "Uta",
      "text": "But that’s not..."
    },
    {
      "character": "Uta",
      "text": "He’s not..."
    },
    {
      "character": "Uta",
      "text": "He’s not supposed to be here..."
    },
    {
      "character": "Ami",
      "text": "What do {i}you{/i} know about where my uncle is {i}supposed{/i} to be?"
    },
    {
      "character": "Uta",
      "text": "A-Ami! It’s not-"
    },
    {
      "character": "Ami",
      "text": "What do {i}you{/i} know about the pain he’s felt?...Or the struggles he’s endured?...Or the dreams that keep him up at night?..."
    },
    {
      "character": "Io",
      "text": "We-"
    },
    {
      "character": "Ami",
      "text": "What do you know about {i}anything?{/i}"
    },
    {
      "character": "Io",
      "text": "We just-"
    },
    {
      "character": "Ami",
      "text": "It’s a rhetorical question. You’re not {i}supposed{/i} to answer because the three of us already know the truth."
    },
    {
      "character": "Ami",
      "text": "You heard it yourself. He doesn’t {i}want{/i} to leave. He wants to stay with {i}me{/i} because {i}I’m{/i} the one he trusts. {i}I’m{/i} the one who wants to protect him. Not {i}you.{/i}"
    },
    {
      "character": "Ami",
      "text": "Like, who even {i}are{/i} you? "
    },
    {
      "character": "Ami",
      "text": "You isolate yourself from ever getting to know any of us then turn around and try to kidnap my {i}uncle{/i} instead? No wonder you’re on so many pills. You’re a fucking lunatic."
    },
    {
      "character": "Uta",
      "text": "Ami! That-"
    },
    {
      "character": "Ami",
      "text": "And {i}you...{/i}"
    },
    {
      "character": "Ami",
      "text": "I thought we were {i}friends.{/i} Now you’re breaking into my house? "
    },
    {
      "character": "Ami",
      "text": "Were you just using me to get to Sensei as well? Is that all {i}everyone{/i} does nowadays? Because it sure seems like it."
    },
    {
      "character": "Uta",
      "text": "It’s not like that! We were worried about him! We haven’t seen him since Halloween and we don’t even know what happened!"
    },
    {
      "character": "Ami",
      "text": "And that makes it okay to break into my house?! "
    },
    {
      "character": "Ami",
      "text": "I know you’re an idiot, Uta, but come on! Are you serious?! Is that really the best you can do?! You were {i}worried?!{/i}"
    },
    {
      "character": "Io",
      "text": "Yeah...we were. Is that so hard to understand? "
    },
    {
      "character": "Ami",
      "text": "A little bit, yeah! "
    },
    {
      "character": "Ami",
      "text": "I mean, you didn’t see {i}me{/i} break into {i}your{/i} room when I found nudes of Uta in Sensei’s phone! And I think that’s a {i}way{/i} bigger thing to worry about than a teacher taking an extended vacation!"
    },
    {
      "character": "Io",
      "text": "Wha-"
    },
    {
      "character": "Uta",
      "text": "Huh?! What?! But I never-"
    },
    {
      "character": "Ami",
      "text": "Granted I’m not {i}sure{/i} they were Uta’s nudes since they didn’t come from her. And the girl in the picture probably hadn’t even hit puberty yet."
    },
    {
      "character": "Ami",
      "text": "The resemblance was kinda uncanny, though. But, hey! I gave you the benefit of the doubt because, again-"
    },
    {
      "character": "Ami",
      "text": "I thought we were friends."
    },
    {
      "character": "Ami",
      "text": "But now I’m starting to regret ever letting you around him in the first place."
    },
    {
      "character": "Io",
      "text": "Did..."
    },
    {
      "character": "Io",
      "text": "Did Sensei really..."
    },
    {
      "character": "Ami",
      "text": "Again, {i}who{/i} are you? Because you’re sure not some girl who’s about to pretend she knows even a fraction of the person my uncle is."
    },
    {
      "character": "Io",
      "text": "I...obviously don’t think I know him better than you do. But-"
    },
    {
      "character": "Ami",
      "text": "As much as I appreciate you deciding to finally try and have a conversation with me, I’m not really sure how fond I am of it happening with glass all over my uncle’s bed."
    },
    {
      "character": "Ami",
      "text": "Do you have any idea what I would do to you if he got hurt? Because {i}I{/i} don’t. And you know it’s bad when even {i}I{/i} don’t know something."
    },
    {
      "character": "Uta",
      "text": "Io...Io was going to fix the window...we weren’t going to just leave things like that."
    },
    {
      "character": "Ami",
      "text": "Oh! Well, why didn’t you just say so?! That makes everything a zillion times better!"
    },
    {
      "character": "Io",
      "text": "Hey, quick question while you’re smiling — are you drugging him? Because he seems {i}pretty{/i} out of it for just “being sick.”"
    },
    {
      "character": "Ami",
      "text": "Why do you ask? Want some? "
    },
    {
      "character": "Io",
      "text": "For the record, I’m not going to hold it against you if you are. I just want to know how serious this is and whether or not he needs {i}actual{/i} medical help."
    },
    {
      "character": "Ami",
      "text": "And I want to know why you think I give a shit about whether or not you’re going to “hold something against me.”"
    },
    {
      "character": "Ami",
      "text": "No one knows what’s better for my uncle than I do because {i}I{/i} have done this before."
    },
    {
      "character": "Ami",
      "text": "That man you met and grew oh-so attached to in school is only {i}that man{/i} in the first place because I was able to help him overcome his fears."
    },
    {
      "character": "Ami",
      "text": "Which is exactly what I’ve {i}been{/i} doing since Halloween! Until {i}you two{/i} decided to go and ruin it! Now, I have to start all over!"
    },
    {
      "character": "Uta",
      "text": "We’re sorry...we knew it was a stupid plan, but-"
    },
    {
      "character": "Ami",
      "text": "I don’t care."
    },
    {
      "character": "Ami",
      "text": "But...you know what? "
    },
    {
      "character": "Ami",
      "text": "Since it’s Christmas...and I am a {i}very{/i} generous girl..."
    },
    {
      "character": "Ami",
      "text": "Why don’t I give you guys ten seconds to get the fuck out of my house before things gets a lot messier? Then, we can forget this ever happened! Sound good? Good!"
    },
    {
      "character": "Uta",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "Ten."
    },
    {
      "character": "Ami",
      "text": "Nine."
    },
    {
      "character": "Io",
      "text": "Let’s go, Uta. She can fix her own window."
    },
    {
      "character": "Ami",
      "text": "Eight."
    },
    {
      "character": "Ami",
      "text": "Seven."
    },
    {
      "character": "Ami",
      "text": "Six."
    },
    {
      "character": "Uta",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Five."
    },
    {
      "character": "Ami",
      "text": "Four."
    },
    {
      "character": "Uta",
      "text": "Please be good to him."
    },
    {
      "character": "Ami",
      "text": "Three. "
    },
    {
      "character": "Ami",
      "text": "Two."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "One."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Uta",
      "text": "What the fuck what the fuck what the fuck what the fuck what the fuck what the fuck what the fuck?!"
    },
    {
      "character": "Io",
      "text": "Right?!"
    },
    {
      "character": "Io",
      "text": "Like, I’ve heard that she can be kind of unhinged, but what the fuck was that?!"
    },
    {
      "character": "Uta",
      "text": "Right?!?!"
    },
    {
      "character": "Io",
      "text": "I mean...we {i}did{/i} break into her house and try to kidnap her uncle....but still! "
    },
    {
      "character": "Uta",
      "text": "Why didn’t Sensei want to leave?! Why was Ami so...creepy?!"
    },
    {
      "character": "Io",
      "text": "And why does he have your fucking pictures?!"
    },
    {
      "character": "Uta",
      "text": "I don’t know! But now I’ll never be able to look at him again without remembering that piece of information and I have no idea how that makes me feel!"
    },
    {
      "character": "Io",
      "text": "Uhh...I mean...shouldn’t it make you feel gross? And, like...kind of disgusted by him? "
    },
    {
      "character": "Uta",
      "text": "Yes! But there are a lot more things swimming through my head and I can’t get ahold of any feeling long enough to decide what to do about {i}anything!{/i}"
    },
    {
      "character": "Uta",
      "text": "We’ve gotta get him out of there, Io..."
    },
    {
      "character": "Uta",
      "text": "Ami might’ve made some good points just now, but...there’s something still really fishy about all of this."
    },
    {
      "character": "Uta",
      "text": "And I just...I don’t think he’s safe in there."
    },
    {
      "character": "Io",
      "text": "And I’m not convinced she isn’t drugging him...so I agree. But what the fuck are we supposed to do now that she knows we’re actively {i}trying?{/i} We could get in serious trouble if we come back here again."
    },
    {
      "character": "Uta",
      "text": "I have no clue..."
    },
    {
      "character": "Uta",
      "text": "I don’t even know where to {b}begin.{/b}"
    }
  ],
  "state_changes": {
    "springtime17": {
      "from": null,
      "to": true
    },
    "uta_love -": {
      "from": null,
      "to": 10
    },
    "io_love -": {
      "from": null,
      "to": 10
    }
  }
}