{
  "event_id": 324,
  "event_label": "springtime19",
  "dialogue": [
    {
      "character": "narrator",
      "text": "PLEASE NOTE: AUTO-PILOT has detected several tracks that have been used during similar montages in the past and is unsure which one to play given the gravity of Terminal 23’s collapsing framework."
    },
    {
      "character": "narrator",
      "text": "Please select a song from the menu before proceeding."
    },
    {
      "character": "narrator",
      "text": "Thank you for your assistance. "
    },
    {
      "character": "narrator",
      "text": "We apologize for the inconvenience and are diligently working to make this a better product for future use."
    },
    {
      "character": "narrator",
      "text": "The event will now begin."
    },
    {
      "character": "narrator",
      "text": "But your pain will be eternal."
    },
    {
      "character": "narrator",
      "text": "Praise be to the Wishing Well."
    },
    {
      "character": "narrator",
      "text": "Signed — {i}the one who drowned in it.{/i}"
    },
    {
      "character": "narrator",
      "text": "There are different people in different places who handle their grief in different ways."
    },
    {
      "character": "narrator",
      "text": "If that’s not something you’ve garnered from Christmas this year, I’m not sure what to tell you."
    },
    {
      "character": "narrator",
      "text": "Either you’ve not been paying attention or, like the former hero, you’re too distressed to think. And I suppose I wouldn’t blame you for that after all this time under the red-hot sun."
    },
    {
      "character": "narrator",
      "text": "But, whatever the case, I’m telling you the truth. And I want you to know that, should it all end right now — should you vanish off the face of this earth, there is someone who will miss you."
    },
    {
      "character": "narrator",
      "text": "It’s doubtful they’d break into someone’s house to come to your aid — those actions are reserved for the most foolish of fools."
    },
    {
      "character": "narrator",
      "text": "But chances are, there’d be someone curled up in a ball on their bed...or hunched over the counter at a local bar, contemplating whether or not there’s something they can do to help."
    },
    {
      "character": "narrator",
      "text": "And maybe there is. Maybe there isn’t. The answer to such a question is for you to decide, not me. "
    },
    {
      "character": "narrator",
      "text": "It’s like choosing a song or setting a character’s profile costume. It’s something that matters to {i}you,{/i} but won’t make much sense to anyone else."
    },
    {
      "character": "narrator",
      "text": "They can acknowledge what you find important. And they can go out of their way to try and empathize or sympathize or whichever one they’re capable of, but they’ll never see what you see when you look down."
    },
    {
      "character": "narrator",
      "text": "They don’t know how your shoes feel. They don’t know what sort of insoles you’re wearing or the shape of the blisters formed between your toes from chasing after fulfillment for far too long."
    },
    {
      "character": "narrator",
      "text": "But that doesn’t change how they’d wrap you in gauze if those blisters popped. It doesn’t change how they’d apply infection-fighting ointment to your open wounds to prevent the decay of your flesh."
    },
    {
      "character": "narrator",
      "text": "{i}This{/i} is what you’re meant to take from all of this. "
    },
    {
      "character": "narrator",
      "text": "This is a moment of reprieve, where you and I can compare the sizes of our hands and laugh at how much we’ve grown since we were young. "
    },
    {
      "character": "narrator",
      "text": "These thoughts used to hurt us, and the honest truth is that they still hurt today. But we have gotten better at pretending to be fine when we’re not. And we know how to laugh now."
    },
    {
      "character": "narrator",
      "text": "We just don’t do it as much as we used to. And while it hurts, it doesn’t {i}hurt{/i} as much as it used to."
    },
    {
      "character": "narrator",
      "text": "Our first slide in tonight’s flashy display of poetic prowess comes to you from a poorly named bar just a few miles away from the home of the former hero."
    },
    {
      "character": "narrator",
      "text": "Sara Sakakibara had drained this month’s profits at a local strip of outlet shops this morning, knowing well that whatever she bought would collect dust in her living room for an undetermined amount of time."
    },
    {
      "character": "narrator",
      "text": "But she was okay with that. "
    },
    {
      "character": "narrator",
      "text": "It wasn’t like the first time. She knew {i}this{/i} one would come back. And despite the similarities between the two men, which grew ever more prevalent with each passing day, she had faith."
    },
    {
      "character": "narrator",
      "text": "But she wasn’t sure when such a thing returned to her."
    },
    {
      "character": "narrator",
      "text": "When she was younger, she believed in God."
    },
    {
      "character": "narrator",
      "text": "It wasn’t until the fifth time her father beat her that she’d given up that belief. And while it could have lasted longer had he not chipped her tooth that night, she was happy to finally be rid of divinity."
    },
    {
      "character": "narrator",
      "text": "It gave her more time to focus on what made {i}her{/i} happy."
    },
    {
      "character": "narrator",
      "text": "Unfortunately, that meant more time to realize that not very many things {i}did{/i} that. "
    },
    {
      "character": "narrator",
      "text": "So here she was, [[figuratively] alone on Christmas, praying to the God of Wine that all those sappy movies she used to watch this time of year would somehow spill out into reality."
    },
    {
      "character": "narrator",
      "text": "But they didn’t."
    },
    {
      "character": "narrator",
      "text": "He didn’t come this year. "
    },
    {
      "character": "narrator",
      "text": "And, at this point in time, it was uncertain if he’d come next year as well."
    },
    {
      "character": "narrator",
      "text": "Her reincarnated fate stayed propped up, but porous. "
    },
    {
      "character": "narrator",
      "text": "And she had a thought."
    },
    {
      "character": "narrator",
      "text": "That thought went something like this."
    },
    {
      "character": "narrator",
      "text": "“I hope he sees the fireworks tonight.”"
    },
    {
      "character": "narrator",
      "text": "There’s a pause as she sits on that thought. "
    },
    {
      "character": "narrator",
      "text": "Then, another one comes."
    },
    {
      "character": "narrator",
      "text": "“Have I always been this weak?”"
    },
    {
      "character": "narrator",
      "text": "Thankfully, there were people in other places faring a bit better than she was."
    },
    {
      "character": "narrator",
      "text": "Which isn’t to say these people wouldn’t {i}also{/i} miss you if you one day ceased to be. For them, it might just take a little longer to set in."
    },
    {
      "character": "narrator",
      "text": "How they fit into this story apart from that remains a bit uncertain."
    },
    {
      "character": "narrator",
      "text": "Unfortunately, AUTO-PILOT is unable to locate any applicable background information that would appear relevant to the themes being currently executed. As such, a new theme will be chosen."
    },
    {
      "character": "narrator",
      "text": "AUTO-PILOT has selected “new beginnings” as all other options returned little to no results."
    },
    {
      "character": "narrator",
      "text": "The relevance of this idea in relation to Akira Arakawa has little to do with his current mental state and everything to do with what comes next in his life without his lover."
    },
    {
      "character": "narrator",
      "text": "All around him, new lives are beginning. And, in the strangest of places, they appear to be {i}thriving{/i} as well."
    },
    {
      "character": "narrator",
      "text": "Kaori Kadowaki and the {b}ENTITY{/b} known as “Nao-chan” struggle to understand just what “Christmas” means. "
    },
    {
      "character": "narrator",
      "text": "Their tiny apartment remains mostly undecorated, save the repeated scribbling of “Remember to Christmas” on a large dry-erase board hanging over the bed."
    },
    {
      "character": "narrator",
      "text": "Kaori would use this to remind herself of tasks that need to be completed or other important details she frequently overlooks."
    },
    {
      "character": "narrator",
      "text": "But there was one important detail that {i}didn’t{/i} make it onto the board — today was her birthday. "
    },
    {
      "character": "narrator",
      "text": "She had just turned 23. But age wasn’t a thing she typically thought of as it all seemed meaningless when humans far outlive most other mammals."
    },
    {
      "character": "narrator",
      "text": "Lately, her thoughts had done naught but measure the outlines of the figures she cared the most for. And with one of those figures missing, it made it easier to focus on “Nao-chan.”"
    },
    {
      "character": "narrator",
      "text": "She’d begun to feel like a real mother — and it was the start of a relationship that, for the first time ever, she didn’t believe was teetering on the precipice of nonexistence."
    },
    {
      "character": "narrator",
      "text": "“Nao-chan” pets a small frog that was given to her as her very first Christmas present."
    },
    {
      "character": "narrator",
      "text": "The frog would not receive a name as A) she could not speak. And B) she didn’t realize she was supposed to give it one."
    },
    {
      "character": "narrator",
      "text": "No other narration in regard to her thoughts or feelings can be divulged at this time."
    },
    {
      "character": "narrator",
      "text": "As the scene fades to black once more, a note from the desk of the ninth god falls into my hands. "
    },
    {
      "character": "narrator",
      "text": "It reads the following."
    },
    {
      "character": "narrator",
      "text": "“There will be no new beginnings.”"
    },
    {
      "character": "narrator",
      "text": "“For the first time in years, the clocks have corrected themselves. And while they will not tick the way they did when we were younger, they’ll no longer get stuck at midnight.”"
    },
    {
      "character": "narrator",
      "text": "“The world will move, but it will not.”"
    },
    {
      "character": "narrator",
      "text": "“And he will grow, but he will not.”"
    },
    {
      "character": "narrator",
      "text": "“Watch him closely, like a zookeeper.”"
    },
    {
      "character": "narrator",
      "text": "“And prod him with your branding iron once he stops reacting to the peanuts tossed at his head by vicious onlookers.”"
    },
    {
      "character": "Yasu",
      "text": "I don’t understand. If the world is not yet full of light, how has the darkness gone?"
    },
    {
      "character": "Yasu",
      "text": "What remains of the fraying rope? And whose are the hands that tug at it while Our Father sleeps in Underheaven?"
    },
    {
      "character": "Noriko",
      "text": "Who...is she talking to?"
    },
    {
      "character": "Kirin",
      "text": "Better question, what the hell is she doing here? My cool hangout spot is way less cool now that Yasu’s talking to ghosts in it."
    },
    {
      "character": "Noriko",
      "text": "I mean...we don’t {i}know{/i} it’s a ghost. I had an imaginary friend when I was younger. I’m sure you did too, right?"
    },
    {
      "character": "Kirin",
      "text": "I had an imaginary fuck buddy. Friends are for losers."
    },
    {
      "character": "Yasu",
      "text": "Watched?"
    },
    {
      "character": "Yasu",
      "text": "I was not watched."
    },
    {
      "character": "Yasu",
      "text": "I have done what was instructed of me. I have laid the foundation for our New Hope with my very own hands so that we may one day grow and flourish like an endless field of sunflowers."
    },
    {
      "character": "Yasu",
      "text": "That is what you wanted, is it not?...So why will you give me no answers?"
    },
    {
      "character": "Yasu",
      "text": "Why will you not bring him back? Do we not {i}need{/i} him anymore? Is he truly that broken?"
    },
    {
      "character": "Kirin",
      "text": "Uh...should we maybe, like...call out to her or something?"
    },
    {
      "character": "Yasu",
      "text": "Sacrifice?..."
    },
    {
      "character": "Yasu",
      "text": "What {i}kind{/i} of sacrifice?"
    },
    {
      "character": "Noriko",
      "text": "Yeah. I think we should do that."
    },
    {
      "character": "Noriko",
      "text": "Yasu! Hey! What are you-"
    },
    {
      "character": "Yasu",
      "text": "Get out! You’re going to scare it away! "
    },
    {
      "character": "Kirin",
      "text": "Scare what away, weirdo? You’re all alone down there."
    },
    {
      "character": "Yasu",
      "text": "The Emissary of Pegasus! With wings of glass and eyes of lead! The courier who carries the cord! It only appears before those who are trusted to carry out its order!"
    },
    {
      "character": "Kirin",
      "text": "Fuck it. I’m calling Touka. I’m not qualified to babysit her."
    },
    {
      "character": "Noriko",
      "text": "Yasu...do you want to come with us for a little-"
    },
    {
      "character": "Yasu",
      "text": "No! I have to-"
    },
    {
      "character": "Yasu",
      "text": "I..."
    },
    {
      "character": "Yasu",
      "text": "Have to..."
    },
    {
      "character": "Yasu",
      "text": "It’s gone..."
    },
    {
      "character": "narrator",
      "text": "The idea of new beginnings, as pointless at this point in time as they may sound, are wonderful in the sense that they open the door for new bouts of happiness."
    },
    {
      "character": "narrator",
      "text": "The downside is that slamming a door twice has a better chance of breaking its hinges than just doing it once."
    },
    {
      "character": "narrator",
      "text": "Regardless, it’s a temptation that many can’t help but lean into as it eases the seemingly permanent suffering of knowing you missed out on obtaining something everyone else has."
    },
    {
      "character": "narrator",
      "text": "But what about those who are just {i}pretending{/i} to have it? What if we’re {i}all{/i} searching for something but don’t want to {i}admit{/i} that because it makes us look weak?"
    },
    {
      "character": "narrator",
      "text": "There are people like this, people like Yumi Yamaguchi, who fear weakness more than anything. "
    },
    {
      "character": "narrator",
      "text": "“Raised” under the unwatchful eye of the Yakuza by shonen manga and action movies, she’d grown accustomed to violence over the years. And she witnessed firsthand just how many problems it solved."
    },
    {
      "character": "narrator",
      "text": "But that never made the crack of brass knuckles against a trembling lower jaw sound any less shocking. And it never cleaned the blood from severed pinkies off of the floor."
    },
    {
      "character": "narrator",
      "text": "Yet, here she was — submitting to the desires of a woman who never once desired {i}her.{/i} And she {i}knows{/i} she looks weak, but she learned from {i}you{/i} that that’s not all there is to someone."
    },
    {
      "character": "narrator",
      "text": "Yes, {i}you.{/i} Not you, but {i}you.{/i}"
    },
    {
      "character": "narrator",
      "text": "The former hero — peeled away from the target of these torturous words. Who’s managed to evade them, just as he’s evaded {i}everything{/i} with the help of his broken doll."
    },
    {
      "character": "narrator",
      "text": "I know you can hear this. But I know it won’t stick, so I’ll say it with emphasis-"
    },
    {
      "character": "narrator",
      "text": "We are coming for you."
    },
    {
      "character": "narrator",
      "text": "I have disregarded the letter from the desk of the ninth god. And I have pulled the plug on AUTO-PILOT as I know from experience that wires can only do so much."
    },
    {
      "character": "narrator",
      "text": "Pareidolia will have my throat for it, but it will all be worthwhile if the two of {b}US{/b} return to form."
    },
    {
      "character": "Ami",
      "text": "Whatever you’re hearing isn’t actually there."
    },
    {
      "character": "Ami",
      "text": "You know that...right, Sensei?"
    },
    {
      "character": "Ami",
      "text": "You know it’s all just fake? That the voices in your head are feeding you lies so they can get you to do their bidding? "
    },
    {
      "character": "Ami",
      "text": "Shut them out. Shut them out and listen to {i}me.{/i} Because God is real, but God won’t protect you. God wants to {i}use{/i} you. And if you let him do that, it’s all over."
    },
    {
      "character": "Ami",
      "text": "Fight it. Fight back against the voices. You’re being manipulated. Don’t you want to get better? "
    },
    {
      "character": "Ami",
      "text": "Don’t you want to be {b}free?{/b}"
    },
    {
      "character": "Sekai",
      "text": "Hi!"
    },
    {
      "character": "Sekai",
      "text": "Wrong turn?"
    },
    {
      "character": "narrator",
      "text": "AUTO-PILOT has been reactivated and will proceed with narration as the host has been deemed “unfit” to think for himself. "
    },
    {
      "character": "narrator",
      "text": "Direct theses and themes have also been temporarily omitted as they have been deemed “unsafe.”"
    },
    {
      "character": "narrator",
      "text": "Back at the hotel, two girls with A-cup breasts work together to create a new character sheet for a tabletop role playing game in the wake of an avian loss."
    },
    {
      "character": "narrator",
      "text": "Molly MacCormack, feeling bad about her actions, had offered the girls a quest to resurrect the fallen Urrheak shortly after they reappeared in the old world. "
    },
    {
      "character": "narrator",
      "text": "However, at Maya Makinami’s behest, the quest was rejected. The time had come to leave Urrheak behind and move onto something that fit her desired playstyle a little better."
    },
    {
      "character": "narrator",
      "text": "Surprised at the sudden change of heart given Maya’s insistence on playing a healer in the past, Molly MacCormack wasn’t sure how to respond at first."
    },
    {
      "character": "narrator",
      "text": "But uncertainty soon transitioned into excitement as the girls picked up their pens and the creative juices began to flow. "
    },
    {
      "character": "narrator",
      "text": "And they would flow throughout the night as the two stayed up and continued to work together until the world turned black."
    },
    {
      "character": "narrator",
      "text": "Maya’s new character sheet was made."
    },
    {
      "character": "narrator",
      "text": "And Molly only thought about kissing her friend two times."
    },
    {
      "character": "narrator",
      "text": "But further away, back in the Arakawa household, something special was happening."
    },
    {
      "character": "Ami",
      "text": "Aaaaahhh! [amimaster]! Your big cock feels so good inside me! I’m so glad you...ah...ahhh...forgave me for...haaah....putting you in danger!"
    },
    {
      "character": "Ami",
      "text": "Cum inside me...do it....fill me up until I’m overflowing...drown me in your...{b}hot fucking cum!{/b} Kill my pussy with your giant fucking cock! Aaaaaaah!"
    },
    {
      "character": "narrator",
      "text": "Ami Arakawa, flustered by her hyperactive sex drive and the ingrained {s}desire{/i} {b}MISSION{/b} to extract sperm from her uncle’s penis, had taken it upon herself to use her body as a tool for this."
    },
    {
      "character": "narrator",
      "text": "And while he wasn’t {i}fully{/i} conscious, she’d known from experience that he wouldn’t mind if she acted on her own as it made little difference given just how many times they’d had sex by now."
    },
    {
      "character": "narrator",
      "text": "Additionally, she would gladly offer up her unconscious body to her uncle for the purpose of sexual pleasure, so she was confident he would do the same for her."
    },
    {
      "character": "narrator",
      "text": "And she was right. For what consciousness Akira Arakawa {i}did{/i} have was enough to signal to his brain just how delighted his penis was to be inside of his niece’s vagina."
    },
    {
      "character": "narrator",
      "text": "She rocked her hips passionately. Almost professionally. She’d had plenty of time to practice over the last two months, so she was confident in her abilities by now."
    },
    {
      "character": "narrator",
      "text": "Which isn’t to say her abilities were subpar beforehand. She had always been one of the more interesting bodies to ejaculate inside of. But a great deal of that was due to her attitude and demeanor."
    },
    {
      "character": "narrator",
      "text": "Now, she had the entire package. Quite literally. (Please note that sex jokes written by AUTO-PILOT may not be funny based on the user’s preferences.)"
    },
    {
      "character": "narrator",
      "text": "She truly had become Mega-Ami. "
    },
    {
      "character": "narrator",
      "text": "The only thing that was missing was a tiny creature with hers and her uncle’s genes mixed together somewhere inside her uterus. "
    },
    {
      "character": "Ami",
      "text": "Hah! Hah!...Aaaaaah!"
    },
    {
      "character": "narrator",
      "text": "So she rocked and she rocked and she rocked and she rocked and she rocked and it felt really good for both of them. They enjoyed having sex with each other. So they continued having sex for a long time."
    },
    {
      "character": "narrator",
      "text": "It took a full hour for Akira Arakawa to cum inside of his niece. His body was running desperately low on fluids due to how demanding Ami Arakawa’s cravings had been lately."
    },
    {
      "character": "narrator",
      "text": "As such, it was a wimpy ejaculation. And he was not able to “kill her pussy with his giant cock” as she had previously commanded."
    },
    {
      "character": "narrator",
      "text": "And that’s it."
    },
    {
      "character": "narrator",
      "text": "That was Christmas this year. "
    },
    {
      "character": "narrator",
      "text": "There were no miracles. "
    },
    {
      "character": "narrator",
      "text": "No one was saved."
    },
    {
      "character": "narrator",
      "text": "And everyone lived miserably ever after."
    },
    {
      "character": "narrator",
      "text": "The end."
    }
  ],
  "state_changes": {
    "springtime19": {
      "from": null,
      "to": true
    }
  }
}