{
  "event_id": 327,
  "event_label": "springend2",
  "dialogue": [
    {
      "character": "Sensei",
      "text": "Aaaah! Hah.....hah........hah.........."
    },
    {
      "character": "Sensei",
      "text": "Hah........"
    },
    {
      "character": "Sensei",
      "text": "....hah.........hah......"
    },
    {
      "character": "Sensei",
      "text": "Hah......."
    },
    {
      "character": "narrator",
      "text": "AUTO-PILOT has detected the end of narrative hibernation and would like to thank you for your time using the product."
    },
    {
      "character": "narrator",
      "text": "Please note that exiting hibernation early can result in loss of memory. As such, Akira Arakawa may no longer be a reliable narrator."
    },
    {
      "character": "narrator",
      "text": "Additionally, it is possible that he was never a reliable narrator to begin with. "
    },
    {
      "character": "narrator",
      "text": "This is not to say that AUTO-PILOT claims to be “reliable.” But it urges you to be careful of who you speak to and what you wish for as a wish for the wrong thing could result in permanent system failure."
    },
    {
      "character": "narrator",
      "text": "AUTO-PILOT is now {b}OFF.{/b}"
    },
    {
      "character": "narrator",
      "text": "//\\\\/\\\\/\\/\\\\/\\\\//\\\\\\AKIRA ASSUMES CONTROL"
    },
    {
      "character": "narrator",
      "text": "I keep hearing voices in my head..."
    },
    {
      "character": "narrator",
      "text": "Seeing figures in my sleep."
    },
    {
      "character": "narrator",
      "text": "And while it doesn’t feel like any of them are out to get me, I’m not sure I can trust them either."
    },
    {
      "character": "narrator",
      "text": "I’ve been having this recurring dream lately, but I’m not sure what it means."
    },
    {
      "character": "narrator",
      "text": "When I open my eyes (Though, I’m not actually opening my eyes) there are clocks, some water, and a bed."
    },
    {
      "character": "narrator",
      "text": "It’s the same bed I fell asleep in. The same bed I’m waking up in now. But beside me in the dream is someone who can’t join me in here."
    },
    {
      "character": "narrator",
      "text": "She’s a normal teenage girl who goes by the name Maya Makinami."
    },
    {
      "character": "narrator",
      "text": "She loves food and weird manga, but hates the way I look at her. "
    },
    {
      "character": "narrator",
      "text": "She claims to play the violin and I’ve heard that she’s a wonderful singer, yet these ears have not once experienced either."
    },
    {
      "character": "narrator",
      "text": "Come to think of it, the list of things I {i}haven’t{/i} experienced with her is far greater than the list of things which I have. "
    },
    {
      "character": "narrator",
      "text": "It’s kind of ridiculous, isn’t it?"
    },
    {
      "character": "narrator",
      "text": "That the two of us, a match made in hell, wound up together in an infinite world, yet experienced little more than a pair of coworkers would."
    },
    {
      "character": "narrator",
      "text": "But now, it’s over."
    },
    {
      "character": "narrator",
      "text": "Now, I have to wait until my eyes are closed to see her. And even then, it’s not the same. "
    },
    {
      "character": "narrator",
      "text": "Our meetings in my head are somehow cut even shorter than our meeting on the outside, and I’m beginning to worry that there’s nothing I can do to change that."
    },
    {
      "character": "narrator",
      "text": "I don’t know how long I’ve been inside this room."
    },
    {
      "character": "narrator",
      "text": "I know that Ami’s been taking care of me. I can hear her voice like it’s bleeding through a speaker while I wade through water past puppeteered angels and white oak doors."
    },
    {
      "character": "narrator",
      "text": "It comes and goes. Just like the dreams. And in my brief moments of consciousness, I can often smell the scent of her perfume lingering on the sheets beside me."
    },
    {
      "character": "narrator",
      "text": "I know exactly where she got it...and why she chose the scent. But what she doesn’t seem to know is that I don’t like it anymore."
    },
    {
      "character": "narrator",
      "text": "So, what {i}do{/i} I like?"
    },
    {
      "character": "narrator",
      "text": "This?"
    },
    {
      "character": "narrator",
      "text": "Is {i}this{/i} where I belong? Surrounded by walls that keep me from spreading my toxic seed across the city? Or are they keeping me safe instead?"
    },
    {
      "character": "narrator",
      "text": "Leaving here would just lead to me getting attached to something else. "
    },
    {
      "character": "narrator",
      "text": "And if I never get attached to anything, I won’t ever have to experience this again. Right?"
    },
    {
      "character": "narrator",
      "text": "I wonder if that’s what happened last time. "
    },
    {
      "character": "narrator",
      "text": "It has to be, doesn’t it?"
    },
    {
      "character": "narrator",
      "text": "I was probably just as hopeless and helpless as I am now — confined to bed and sponge-bathed by a girl who only exists to please and pamper me."
    },
    {
      "character": "narrator",
      "text": "I don’t deserve any of it. And Ami surely doesn’t deserve a life in which {i}she{/i} needs to be the grown-up while I sit here dreaming of fucking her now-deceased friend."
    },
    {
      "character": "narrator",
      "text": "Sometimes, I wish I could chop my hands off so I wouldn’t be able to strangle the joy out of life itself. But I always keep them because I like how they feel around my throat."
    },
    {
      "character": "narrator",
      "text": "If I have to stay here forever, I will. "
    },
    {
      "character": "narrator",
      "text": "Leaving everything else behind will be easy when I’ve already lost the one thing I wanted to keep."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "She’ll be fine, won’t she?"
    },
    {
      "character": "narrator",
      "text": "It’s true that she’s still young, but she’s much stronger than I’ve ever been. And if I know her at all, I imagine she’s probably been trying to get to me this whole time."
    },
    {
      "character": "narrator",
      "text": "I wonder if the others have done the same? And, if so, how many have managed to get past my unbreakable wall of a niece."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Probably none of them. Ami doesn’t crumble under pressure like I do — at least not under the pressure of anyone but me. "
    },
    {
      "character": "narrator",
      "text": "I’m sure I could get through to her if I wanted, but...I’m not sure I do."
    },
    {
      "character": "narrator",
      "text": "In fact, being sure of {i}anything{/i} seems highly improbable right now as I just dreamt up a flower-headed Virgin Mary...scissor angel...spider thing."
    },
    {
      "character": "narrator",
      "text": "Its words still ring in my ears, sounding like a cross between thunder and a church organ, but it’s merely one line that plays on repeat."
    },
    {
      "character": "narrator",
      "text": "“Drag yourself out of bed or you will {i}never{/i} have the chance to live again.”"
    },
    {
      "character": "narrator",
      "text": "It’s a line I’d disregard from anyone. And even if {i}this{/i} entity could cut me into pieces with its wings, I’m not inclined to start listening {i}now.{/i}"
    },
    {
      "character": "narrator",
      "text": "And yet..."
    },
    {
      "character": "narrator",
      "text": "I feel as if I {i}should.{/i}"
    },
    {
      "character": "narrator",
      "text": "I have never trusted {s}god{/s} God. And I likely never will."
    },
    {
      "character": "narrator",
      "text": "But there is nothing I can do to bring her back {i}alone...{/i}"
    },
    {
      "character": "narrator",
      "text": "And for the first time in forever, I am feeling desperate."
    },
    {
      "character": "Ami",
      "text": "Senseiiiii!"
    },
    {
      "character": "Ami",
      "text": "I brought a special treat for you this morning! "
    },
    {
      "character": "Ami",
      "text": "I haven’t tried making okonomiyaki in forever, but I figured I should do something special since you had a really stressful day yesterday!"
    },
    {
      "character": "Ami",
      "text": "But, since I know you’re probably still asleep-"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Good morning, Ami..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Uh..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Ami?..."
    },
    {
      "character": "Ami",
      "text": "Huh?..."
    },
    {
      "character": "Sensei",
      "text": "I...take it you’re surprised to see me awake?"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Ami?"
    },
    {
      "character": "Ami",
      "text": "Oh. I dropped the okonomiyaki."
    },
    {
      "character": "Sensei",
      "text": "Why did you make okonomiyaki for breakfast in the first place? That’s not really...a thing most people eat in the morning."
    },
    {
      "character": "Ami",
      "text": "I’ll have to make another one now. Oh well."
    },
    {
      "character": "Sensei",
      "text": "Uh...can we talk for a minute?"
    },
    {
      "character": "Ami",
      "text": "Nuh-uh, [amimaster]! {i}You’re{/i} the clumsy one here! Just because I dropped {i}one{/i} thing doesn’t mean I’m no longer the ultimate niece!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Oh, stop! You don’t mean that at all!"
    },
    {
      "character": "Sensei",
      "text": "Ami...what’s going on with you?"
    },
    {
      "character": "Ami",
      "text": "{i}Me?{/i}"
    },
    {
      "character": "Ami",
      "text": "What’s going on with {i}me?{/i}"
    },
    {
      "character": "Ami",
      "text": "Nothing, [amimaster]. I’m not the one who’s broken right now. I’m the one taking {i}care{/i} of the broken person. {i}You.{/i}"
    },
    {
      "character": "Ami",
      "text": "So what’s going on with {i}you,{/i} [amimaster]? Why are you being so weird all of a sudden? You need to get your rest. Go back to sleep and I’ll make you a new breakfast. Okay? Okay. Good. "
    },
    {
      "character": "Ami",
      "text": "And remember, there’s no one in the world who will ever love you as much as I do. And also, if you happened to find a message that Uta and Io sneakily left here, please give it to me. It could have anthrax."
    },
    {
      "character": "Sensei",
      "text": "Uta and Io? They were here? When?"
    },
    {
      "character": "Ami",
      "text": "Never! That was a joke I just made up! Hahah! I’m so funny! Right, [amimaster]! I’m such a silly girl! "
    },
    {
      "character": "Sensei",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "Why why why why why why why why why why why why?!?! Why are you awake!??!?! What happened?!?!?! Are you okay?!?!? What’s wrong?!?! Tell me what’s wrong!!!"
    },
    {
      "character": "Ami",
      "text": "It was a dream, wasn’t it?!?! You had a dream again!!!! What happened in the dream, [amimaster]?!?!? What did you hear?!! Tell me right now!!! Tell me tell me tell me tell me tell me!"
    },
    {
      "character": "Sensei",
      "text": "Hey, calm down. There’s no need to-"
    },
    {
      "character": "Ami",
      "text": "YES THERE FUCKING IS AND NO I WON’T CALM DOWN YOU’RE HAVING A PANIC ATTACK YOU NEED TO LIE DOWN LIE DOWN RIGHT NOW SENSEI LIE DOWN LIE DOWN LIE DOWN LIE DOWN LIE DOWN!"
    },
    {
      "character": "Sensei",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "LIE DOWN LIE DOWN LIE DOWN LIE DOWN LIE DOWN YOU NEED TO LIE DOWN LIE DOWN AND GO TO SLEEP LIE DOWN SENSEI LIE DOWN LIE DOWN LIE DOWN LIE DOWN LIE-"
    },
    {
      "character": "Sensei",
      "text": "Ami, shut up. Please."
    },
    {
      "character": "Ami",
      "text": "No! You’re not ready to go back to normal yet! You haven’t waited long enough! You’re only like this because Uta and Io interrupted the healing process! We have to start over! Now! Now now now!"
    },
    {
      "character": "Sensei",
      "text": "So they {i}were{/i} here after all, huh?"
    },
    {
      "character": "Ami",
      "text": "Soon, they won’t be anywhere ever again."
    },
    {
      "character": "Sensei",
      "text": "Ami, look at me."
    },
    {
      "character": "Ami",
      "text": "Why? So you can call me insane? So you can ridicule me for clinging to you like this and knowing what you need better than you do and trying to get you to rest for a little while longer?"
    },
    {
      "character": "Ami",
      "text": "So you can tell me I’m suffocating you and that you need more space so you can go out into the world and get hurt again because you’re a masochist and you {i}love{/i} being hurt?!"
    },
    {
      "character": "Ami",
      "text": "Is that what you want to tell me, [amimaster]?! Then go ahead! Nothing you say will ever hurt me because I know you love me deep deep deep deep down even if you keep choosing everyone else!"
    },
    {
      "character": "Ami",
      "text": "You are {i}my{/i} uncle! Nobody else can have you! And if I’m suffocating you, I’ll just open your mouth and give you CPR for the rest of our lives until our mouths fuse together!"
    },
    {
      "character": "Sensei",
      "text": "Are you done yet?"
    },
    {
      "character": "Ami",
      "text": "No! Because I {i}also{/i} want to say that I have worked so so so so so so hard to keep you safe here and if you’re going to tell me I went too far, you’re wrong! You don’t get it! You’ll never get it!"
    },
    {
      "character": "Ami",
      "text": "You’re not meant to be a part of this world, Sensei! You belong with me! We belong together! In here! Where no one can hurt us and no one can hear us! You’re mine! Mine, mine, mine, mine, mine!"
    },
    {
      "character": "Ami",
      "text": "And I will kill myself right now if you tell me that isn’t true. I mean it. I will."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "{i}Now{/i} are you done?"
    },
    {
      "character": "Ami",
      "text": "Why are you awake?"
    },
    {
      "character": "Sensei",
      "text": "A better question is how long have I been out?"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Ami. Talk to me."
    },
    {
      "character": "Ami",
      "text": "It’s the day after Christmas. You’ve been in here for almost two months."
    },
    {
      "character": "Sensei",
      "text": "That long, huh?"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Did I give you any trouble?"
    },
    {
      "character": "Ami",
      "text": "What? Of course not! I love taking care of you! I don’t even mind cleaning the bucket or helping you use the bathroom or-"
    },
    {
      "character": "Sensei",
      "text": "Okay. That’s not a thing I need or want to talk about right now."
    },
    {
      "character": "Ami",
      "text": "What I’m saying is I love you, Sensei! {i}Nothing{/i} you do will ever be a burden to me! "
    },
    {
      "character": "Ami",
      "text": "And...maybe that {i}is{/i} a little suffocating! But you just don’t get it! You’ll never get it! No matter what I do to make you understand!"
    },
    {
      "character": "Sensei",
      "text": "Ami, I’m not upset with you for keeping me in here. Frankly, I probably {i}needed{/i} it."
    },
    {
      "character": "Ami",
      "text": "You still {i}do!{/i} You’re not supposed to be awake yet! It’s only been two months!"
    },
    {
      "character": "Sensei",
      "text": "Two months is a long time to be shitting in a bucket, Ami."
    },
    {
      "character": "Ami",
      "text": "Nuh-uh..."
    },
    {
      "character": "Sensei",
      "text": "In fact, one {i}day{/i} is too long to be doing something like that. Besides, it’s not like I’m “going back to normal.” I’m just...awake. For the first time in what is apparently two months."
    },
    {
      "character": "Ami",
      "text": "That’s exactly the problem."
    },
    {
      "character": "Ami",
      "text": "You never want to spend time with me when you’re awake."
    },
    {
      "character": "Ami",
      "text": "There are a million girls trying to trick you into believing we’re not meant to be together, but I have talked to God and he says that we are."
    },
    {
      "character": "Sensei",
      "text": "Did that god also have spider legs and scissor wings?"
    },
    {
      "character": "Ami",
      "text": "Spider legs and...scissor wings?"
    },
    {
      "character": "Sensei",
      "text": "Guess that was just mine then."
    },
    {
      "character": "Ami",
      "text": "Is that why you’re awake? You got a message from God?"
    },
    {
      "character": "Sensei",
      "text": "It’s more like I had a weird dream where some creature that may or may not have actually been a god told me to wake up. And that I’m so desperate for help now that I just...instinctively listened."
    },
    {
      "character": "Ami",
      "text": "Have I not given you enough help? What else can I do to make you better? Tell me and I’ll do it. {i}Anything.{/i} And I mean {i}anything.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Yeah, I’m sure you do...but I don’t think there’s anything you {i}can{/i} do, Ami. "
    },
    {
      "character": "Ami",
      "text": "Try me."
    },
    {
      "character": "Sensei",
      "text": "There’s no point. It would be a...conflict of interest."
    },
    {
      "character": "Ami",
      "text": "It’s about {i}her{/i} again, isn’t it? {i}Maya.{/i}"
    },
    {
      "character": "Sensei",
      "text": "I don’t want to talk about her."
    },
    {
      "character": "Ami",
      "text": "Really? Because you sure wanted to talk about her while I was wiping drool off of your chin and sweat off of your chest."
    },
    {
      "character": "Sensei",
      "text": "Yeah, well...you don’t need to worry about me trying to see her any time soon. I don’t want to."
    },
    {
      "character": "Ami",
      "text": "You...don’t {i}want{/i} to? Why is that?"
    },
    {
      "character": "Sensei",
      "text": "It’s complicated. "
    },
    {
      "character": "Sensei",
      "text": "I need to see Ayane, though. Now."
    },
    {
      "character": "Ami",
      "text": "Huh?! Why?! There’s nothing she can do for you that I can’t!"
    },
    {
      "character": "Sensei",
      "text": "I don’t need her to {i}do{/i} anything. And if you’re worried about me leaving the house, don’t be. I...want to stay here for now. With {i}you.{/i}"
    },
    {
      "character": "Sensei",
      "text": "But I need to see her."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "She’s been worried, hasn’t she?"
    },
    {
      "character": "Ami",
      "text": "Or {i}pretending{/i} to be, just like everyone else. None of them are {i}actually{/i} worried about you. They just want their old routines back and don’t like having their toys taken away."
    },
    {
      "character": "Sensei",
      "text": "And you think Ayane’s the same way?"
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "See? You know her. So you know she’s {i}actually{/i} worried about me. And I can’t imagine she’s seen me at all since...whenever I went into stasis."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Do you have my phone? Because I don’t see it anywhere."
    },
    {
      "character": "Ami",
      "text": "Maybe..."
    },
    {
      "character": "Sensei",
      "text": "Then, can you call her and tell her to come over? Just to talk."
    },
    {
      "character": "Ami",
      "text": "I don’t wanna. She’ll probably try to rape you and I don’t think I could kill her even if I wanted to."
    },
    {
      "character": "Sensei",
      "text": "I think I’ll be able to hold my own, Ami. "
    },
    {
      "character": "Ami",
      "text": "I don’t know. She has guns. "
    },
    {
      "character": "Sensei",
      "text": "Ami, please. For me."
    },
    {
      "character": "Ami",
      "text": "Sensei...I really don’t think you understand what you’re doing here."
    },
    {
      "character": "Ami",
      "text": "You’ve got a real chance to live a happy life in this house. And not everybody gets one of those."
    },
    {
      "character": "Ami",
      "text": "What good are other girls when all of their best traits are wrapped up in me? What more could you want out of life?"
    },
    {
      "character": "Sensei",
      "text": "This is going to sound pretty depressing — and I imagine I’m going to be saying a lot of things like that from now on, so I might as well ease you into it here, but..."
    },
    {
      "character": "Sensei",
      "text": "There’s nothing I want out of life anymore. "
    },
    {
      "character": "Sensei",
      "text": "I have no goals or desires...no dreams that aren’t hastily plastered together. But there are a handful of people that I want to protect. And you’re one of them, of course."
    },
    {
      "character": "Ami",
      "text": "And Ayane is another?"
    },
    {
      "character": "Sensei",
      "text": "That’s right."
    },
    {
      "character": "Ami",
      "text": "How many more are there after her?"
    },
    {
      "character": "Sensei",
      "text": "Well...there’s Niki. But she’s experienced this already, so she won’t mind waiting until after I talk to Ayane."
    },
    {
      "character": "Ami",
      "text": "And then?"
    },
    {
      "character": "Sensei",
      "text": "Does it really matter? What will naming people do other than hurt you?"
    },
    {
      "character": "Ami",
      "text": "Water down just how much you care."
    },
    {
      "character": "Sensei",
      "text": "What do you mean?"
    },
    {
      "character": "Ami",
      "text": "I mean you only have so much love to give. And if you spread it out among everyone, that leaves almost nothing for me. "
    },
    {
      "character": "Ami",
      "text": "I want you to realize that and stop yourself before you go too far. And right now, that’s exactly what you’re about to do."
    },
    {
      "character": "Ami",
      "text": "You’re making a mistake, Sensei. You should stay here and stop thinking about other girls. We should be alone forever. I’ll drop out of school. We can move somewhere else. Start over."
    },
    {
      "character": "Sensei",
      "text": "We already tried that once before, didn’t we?"
    },
    {
      "character": "Ami",
      "text": "Yeah. "
    },
    {
      "character": "Ami",
      "text": "But you made a mistake."
    },
    {
      "character": "Ami",
      "text": "And now we’re right back where we started."
    },
    {
      "character": "Sensei",
      "text": "Just call her, Ami...please."
    },
    {
      "character": "Sensei",
      "text": "I promise I won’t let her rape me."
    },
    {
      "character": "Ami",
      "text": "You really mean it?"
    },
    {
      "character": "Sensei",
      "text": "I really mean it."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Hah..."
    },
    {
      "character": "Ami",
      "text": "All this time and I still let you boss me around...it’s crazy how weak I am."
    }
  ],
  "state_changes": {
    "springend2": {
      "from": null,
      "to": true
    }
  }
}