{
  "event_id": 328,
  "event_label": "ayanespring1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "Ami leaves the room and I’m left alone again."
    },
    {
      "character": "narrator",
      "text": "I can hear the sounds of seven different locks being closed and, if I hadn’t already realized just how desperately she’s been trying to keep me safe, I’d know it now for sure."
    },
    {
      "character": "narrator",
      "text": "I don’t hear her call Ayane. And I’m not sure I’d even want to as I’m positive the call would be laced with countless clauses and concerns Ami has."
    },
    {
      "character": "narrator",
      "text": "I just sit there, on a bed drenched in sweat, and wonder what will happen next."
    },
    {
      "character": "narrator",
      "text": "I wonder what she’ll say when she sees me. Or if she even {i}will{/i} see me if she’s not open to adhering to whatever my niece’s demands are."
    },
    {
      "character": "narrator",
      "text": "She probably will be."
    },
    {
      "character": "narrator",
      "text": "She’s probably desperate by now."
    },
    {
      "character": "narrator",
      "text": "I know this to be true because that’s the case for me. And while Ayane might be able to put on a brave face in my times of peril, there are limits to just how brave that face can be."
    },
    {
      "character": "narrator",
      "text": "She’s only human, after all."
    },
    {
      "character": "narrator",
      "text": "She’s just a girl, after all."
    },
    {
      "character": "narrator",
      "text": "If the fraying of the ropes that hold me up does not cease within the coming days, I will fall for the rest of my life. So why should I abstain from reaching out for someone who can cover it in knots?"
    },
    {
      "character": "narrator",
      "text": "I owe her the chance to save my life after all she’s done for me. And I’m sure that sounds selfish. The things I say seldom don’t."
    },
    {
      "character": "narrator",
      "text": "But when she fails, and she likely will, I hope she won’t hate herself for being incapable of cushioning the blow."
    },
    {
      "character": "narrator",
      "text": "Because right now, I feel as if I could crack my head on anything."
    },
    {
      "character": "narrator",
      "text": "I feel as if it’s egg time."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Are you sure it’s okay? I can really go in?"
    },
    {
      "character": "Ami",
      "text": "Actually, Ayane, I’m {i}not{/i} sure. This obviously wasn’t my idea. {i}I{/i} want you as far away from my house and my uncle as humanly possible."
    },
    {
      "character": "Ami",
      "text": "But he’s weak right now...and I’m not going to tell him he can’t have something when I know he truly wants it. And, for some reason, he wants {i}you.{/i}"
    },
    {
      "character": "Ayane",
      "text": "He asked for me specifically? Not, like...you know...{i}anyone else?{/i}"
    },
    {
      "character": "Ami",
      "text": "He’s been calling a different name in his sleep. But since the two of you have gotten so {i}close{/i} behind my back, I assume you already know who that is. Correct?"
    },
    {
      "character": "Ayane",
      "text": "Ami..."
    },
    {
      "character": "Ami",
      "text": "If you do {i}anything{/i} to hurt him while you’re in there, you will never see either one of us again. Do you understand?"
    },
    {
      "character": "Ayane",
      "text": "Ami, I’ve been telling you this whole time — I have no intention of hurting him. "
    },
    {
      "character": "Ami",
      "text": "See, I don’t really care about your {i}intentions.{/i} Even if you hurt him on {i}accident,{/i} you will never see either one of us again. {i}Do you understand?{/i}"
    },
    {
      "character": "Ayane",
      "text": "Yes. I understand. And thank you, Ami. I mean it."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "I really, really mean it."
    },
    {
      "character": "Ami",
      "text": "We’ve known each other a long time, haven’t we?"
    },
    {
      "character": "Ayane",
      "text": "We have. "
    },
    {
      "character": "Ami",
      "text": "Do you love me, Ayane? Like...really {i}really{/i} love me?"
    },
    {
      "character": "Ayane",
      "text": "I do."
    },
    {
      "character": "Ami",
      "text": "Why? "
    },
    {
      "character": "Ayane",
      "text": "{i}Why?{/i}"
    },
    {
      "character": "Ami",
      "text": "I’ve been getting on your nerves a lot lately, haven’t I? Between keeping Sensei here...and ditching you in the woods...and forcing myself into your “private affairs...”"
    },
    {
      "character": "Ami",
      "text": "Even the way I’ve looked at you...{i}argued{/i} with you. Despite all of that “Waaaah, my friends are leaving me” crap, what I {i}really{/i} wanted was some peace and quiet."
    },
    {
      "character": "Ami",
      "text": "I don’t care if you hate me. I don’t care if {i}anyone{/i} hates me. The only person who will ever {i}really{/i} matter to me is Sensei. And I would trade {i}your{/i} happiness for {i}his{/i} complacency in a heartbeat. "
    },
    {
      "character": "Ayane",
      "text": "Why are you telling me this?..."
    },
    {
      "character": "Ami",
      "text": "Because, for whatever reason, you’ve stopped falling for it. And I trust Sensei enough to trust that {i}you{/i} will not go out of your way to “rescue” him from this house. He does not need to be {i}rescued.{/i}"
    },
    {
      "character": "Ami",
      "text": "Do I make myself clear, Ayane? "
    },
    {
      "character": "Ami",
      "text": "If Sensei goes back to school like none of this ever happened, it will ruin everything. {i}Everything.{/i} And even if I know what’s best for him, I can’t {i}keep{/i} him here if he doesn’t want to {i}be{/i} here."
    },
    {
      "character": "Ayane",
      "text": "What do you mean by “like none of this ever happened?” And “it will ruin everything?” Because I’m pretty sure you have no idea what even {i}happened{/i} in the first place."
    },
    {
      "character": "Ami",
      "text": "And that’s something you {i}do{/i} know?"
    },
    {
      "character": "Ayane",
      "text": "Yes! I tried to tell you in the karaoke booth! But you were so focused on getting Sensei back home that you wouldn’t listen to what-"
    },
    {
      "character": "Ami",
      "text": "I don’t care about {i}what.{/i} I care about {i}why.{/i}"
    },
    {
      "character": "Ami",
      "text": "{i}Why{/i} do you know what’s wrong, Ayane? This shouldn’t involve you."
    },
    {
      "character": "Ami",
      "text": "You should be back at the dorms, goofing around and playing games with Sana. Or practicing karate at the dojo. Or...getting kicked out of various local businesses or whatever it is you’re {i}supposed{/i} to do."
    },
    {
      "character": "Ami",
      "text": "But you’re not. You’re {i}here.{/i} And I’m having a little trouble understanding how that could possibly be a good thing for {i}any{/i} of us or {i}why{/i} it’s even happening in the first place."
    },
    {
      "character": "Ayane",
      "text": "I don’t care about what’s “good” or what I’m “supposed” to be doing anymore. I’m just worried about Sensei. And I know you can relate to that, Ami. If {i}anyone{/i} can relate to that, it’s you."
    },
    {
      "character": "Ami",
      "text": "Stop comparing your “love” for him to mine. It’s going to make me sick."
    },
    {
      "character": "Ayane",
      "text": "Ami-"
    },
    {
      "character": "Ami",
      "text": "You have ten minutes. Go in there, say what is you have to say, listen to whatever it is {i}Sensei{/i} has to say...then leave."
    },
    {
      "character": "Ami",
      "text": "Go back to your normal routine. Find someone else to burden with your undying affection. Just leave my uncle out of it."
    },
    {
      "character": "Ami",
      "text": "You two were never meant to be."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "You know...I feel really bad for you, Ami. "
    },
    {
      "character": "Ami",
      "text": "Yeah. You’re kind of supposed to."
    },
    {
      "character": "Ayane",
      "text": "Do you want to know why, though?"
    },
    {
      "character": "Ami",
      "text": "Not really. I still have to make breakfast since the first dish I made wound up all over the floor."
    },
    {
      "character": "Ayane",
      "text": "It’s because you think you understand what love is, but I’m not sure you’ve actually {i}felt{/i} it even once in your life."
    },
    {
      "character": "Ami",
      "text": "Cute. How long have you been holding onto that line for?"
    },
    {
      "character": "Ayane",
      "text": "Depends. How long have you been holding onto literally everything you’ve said to me today?"
    },
    {
      "character": "Ami",
      "text": "You don’t want to know."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "It’s hard to explain the look that was on Ayane’s face when she first walked into the room, but I think I’d describe it as somewhere between pity, gratefulness, and frustration."
    },
    {
      "character": "narrator",
      "text": "I’m not sure if she was expecting me to look a little more “broken” than I currently am given just how long I’ve been away, but it took all of three seconds to make me feel as if I disappointed her."
    },
    {
      "character": "narrator",
      "text": "Besides, what’s on the outside very rarely exemplifies the way my heart moves."
    },
    {
      "character": "narrator",
      "text": "Right now, there are a million different thoughts swirling through my head. And if you’ve ever lost anyone before, I’m sure you know that none of them are good."
    },
    {
      "character": "narrator",
      "text": "Finding a way to shelve them for the sake of communicating with someone else, especially someone who reminds you of that person, isn’t easy."
    },
    {
      "character": "narrator",
      "text": "But she knows I’m alive, at least. And that’s more than everyone else has gotten as of late."
    },
    {
      "character": "narrator",
      "text": "Where do we begin, though? What words can I say to break the two month silence in a way suitable to her perception of me as a human being?"
    },
    {
      "character": "narrator",
      "text": "Is this the part where I attempt to make a joke and fail miserably? Should I apologize for my absence? Would it be normal to say something mildly sexual? Just wrap my arm around her and tell her I love her?"
    },
    {
      "character": "narrator",
      "text": "What am I like? Who am I supposed to be? The answers to such questions used to only be slightly more difficult than breathing. But now, it’s like I’m struggling with both."
    },
    {
      "character": "narrator",
      "text": "And I can’t even retreat to the self-soothing plea that “I want to go home” because I’m already here."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Sensei...you don’t have to talk. I’m sure it’s...not exactly easy after all you’ve been through."
    },
    {
      "character": "Sensei",
      "text": "I can talk. But you’re right...it’s not easy. "
    },
    {
      "character": "Sensei",
      "text": "I can barely even move my limbs right now. And between that and my complete inability to remember how to converse with another person, it’s like I’m the world’s most miserable mannequin."
    },
    {
      "character": "Ayane",
      "text": "Staying in bed for two months will do that to a person..."
    },
    {
      "character": "Ayane",
      "text": "I imagine you’ll be feeling pretty terrible for at least another few weeks. But...at least you’re conscious? I think? Unless...you’ve {i}been{/i} conscious this whole time?"
    },
    {
      "character": "Ayane",
      "text": "I don’t...really know what’s been going on in here, to be honest. Nobody does. Ami’s kept you guarded like the vaults of Fort Knox."
    },
    {
      "character": "Sensei",
      "text": "Then kudos to Uta and Io for managing to break in last night."
    },
    {
      "character": "Ayane",
      "text": "Oh, is {i}that{/i} what happened to the window? I was wondering what the boards were all about."
    },
    {
      "character": "Sensei",
      "text": "Yeah. According to Ami, they were here. I don’t really know any of the details, though."
    },
    {
      "character": "Ayane",
      "text": "I guess that explains why they weren’t at the party, then. I’m glad it was that and not them just...growing distant from everybody else."
    },
    {
      "character": "Ayane",
      "text": "Which isn’t to say Io’s already not like that, but...yeah..."
    },
    {
      "character": "Ayane",
      "text": "I’m...happy you’re okay. Even {i}if{/i} okay doesn’t really mean “okay” in this context. "
    },
    {
      "character": "Ayane",
      "text": "I guess what I’m saying is I’m just happy to see you again. Even if the situation itself is kind of...the worst thing that could have possibly happened."
    },
    {
      "character": "Sensei",
      "text": "It could have been worse. You could be gone too."
    },
    {
      "character": "Ayane",
      "text": "Without spending too much time whining about {i}my{/i} problems, the last couple months have made me feel like that wouldn’t have changed much."
    },
    {
      "character": "Sensei",
      "text": "Has it been hard? Being alone this whole time, I mean. Because at least I’ve had Ami. Even if I haven’t really been {i}present{/i} at all within that time."
    },
    {
      "character": "Ayane",
      "text": "Well...here’s where things get interesting. Because I {i}haven’t{/i} been alone. Makoto made it to the rooftop that night as well."
    },
    {
      "character": "Sensei",
      "text": "Makoto {i}what?{/i}"
    },
    {
      "character": "Ayane",
      "text": "Yeah...so that’s a new development. A development I obviously don’t blame you for not remembering since you were kind of catatonic when the reset happened."
    },
    {
      "character": "Sensei",
      "text": "Then...who actually {i}started{/i} the reset? It had to be you, right?"
    },
    {
      "character": "Ayane",
      "text": "Uhhhhh..."
    },
    {
      "character": "Ayane",
      "text": "Sure. Let’s just go with that."
    },
    {
      "character": "Sensei",
      "text": "...What?"
    },
    {
      "character": "Ayane",
      "text": "Anyway...Maya’s still here too. It’s just...you know...her {i}memories{/i} that..."
    },
    {
      "character": "Sensei",
      "text": "What’s she like? Without being jaded by centuries of meaningless time travel?"
    },
    {
      "character": "Ayane",
      "text": "Honestly...not that different. "
    },
    {
      "character": "Ayane",
      "text": "Like, she kind of blends in with everyone else a little better since she’s not so busy trying to figure out the secrets of the universe all the time."
    },
    {
      "character": "Ayane",
      "text": "But other than that, she’s just sort of...sassier. But in a typical Maya sort of way."
    },
    {
      "character": "Sensei",
      "text": "Has she said anything about me?"
    },
    {
      "character": "Ayane",
      "text": "Just...the same kind of stuff she always says when other people are around. Like how you’re gross and...a pervert and...you know. Stuff like that."
    },
    {
      "character": "Sensei",
      "text": "Well, at least that hasn’t changed. "
    },
    {
      "character": "Ayane",
      "text": "Yeah..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Um..."
    },
    {
      "character": "Ayane",
      "text": "I...talked to Chika too. Last night."
    },
    {
      "character": "Sensei",
      "text": "Oh, good. I can only imagine how she’s handling this."
    },
    {
      "character": "Ayane",
      "text": "Yeah...she hasn’t been doing so great. She’s cutting class almost every day now that you’re not around anymore...And, weirdly enough, Yumi’s been showing up {i}more.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Yeah, that also makes sense."
    },
    {
      "character": "Ayane",
      "text": "But, uhh..."
    },
    {
      "character": "Ayane",
      "text": "You know, Chika had a really good idea. And she called me last night to talk about it since she figured I’d be the easiest way to infiltrate your house."
    },
    {
      "character": "Ayane",
      "text": "Little did she know, I had no clue when I’d even be able to {i}do{/i} that until just a little while ago. "
    },
    {
      "character": "Ayane",
      "text": "But she thought it might be good for you if all of us, like...put a card together for you. To tell you that we’re all waiting for you to come back and stuff."
    },
    {
      "character": "Sensei",
      "text": "And you managed to collect everyone’s signature in just one night?"
    },
    {
      "character": "Ayane",
      "text": "Um...no."
    },
    {
      "character": "Ayane",
      "text": "See, she didn’t call me until it was really late and...I kind of just took her idea and ran with it. So, this is a card. Yeah. But it’s...from me. I didn’t get anyone else’s signature."
    },
    {
      "character": "Sensei",
      "text": "Then...can I read it now? Or do you want me to wait until you’re gone?"
    },
    {
      "character": "Ayane",
      "text": "You can read it now, but...I’m sorry in advance if it seems frantic or rushed or anything like that. It’s...weirdly difficult putting your feelings down on paper when you have so many of them."
    },
    {
      "character": "Ayane",
      "text": "You’d think after all the ones I wrote for my mom that I’d be better at this by now, but...nope. Still suck."
    },
    {
      "character": "Ayane",
      "text": "I should have just written you an essay instead."
    },
    {
      "character": "Sensei",
      "text": "You’ve been writing letters to your mom?"
    },
    {
      "character": "Ayane",
      "text": "I keep them in a box underneath my bed in case I ever find out where she lives now. I’ve got...probably hundreds down there."
    },
    {
      "character": "Ayane",
      "text": "And I know I’ll be holding onto them for the rest of my life, but...miracles happen sometimes. And I’m dumb enough to keep believing in them."
    },
    {
      "character": "Ayane",
      "text": "I shouldn’t be greedy, though."
    },
    {
      "character": "Ayane",
      "text": "Like, who would I be to ask for a second miracle with the first one sitting right beside me?"
    },
    {
      "character": "Sensei",
      "text": "Bold move to flirt with me while Ami is very likely right outside the door."
    },
    {
      "character": "Ayane",
      "text": "Oh, she’s definitely right outside the door. And she gave me a real earful when I first came in. But I’ve been keeping my voice low enough that she won’t be able to hear it."
    },
    {
      "character": "Ayane",
      "text": "Either way, though...I’m not worried about her."
    },
    {
      "character": "Ayane",
      "text": "Ami loves you, Sensei. In a way that...I don’t think any of us will ever understand. I just don’t think she understands how crazy that can make her look at times."
    },
    {
      "character": "Ayane",
      "text": "Like, she’s been even worse than normal when it comes to you lately. {i}A lot{/i} worse. To the point where some of the girls have thought about reporting your case to the police."
    },
    {
      "character": "Ayane",
      "text": "I think some might have even gone through with it. Especially since Uta and Io were willing to go as far as breaking into your house. A little report seems like nothing by comparison."
    },
    {
      "character": "Ayane",
      "text": "I guess nothing ever came of it, though, if Ami’s still got you locked up after all this time."
    },
    {
      "character": "Sensei",
      "text": "Either that or she killed and buried all of the police who were brave enough to come knocking on the door."
    },
    {
      "character": "Ayane",
      "text": "Hahah...yeah..."
    },
    {
      "character": "Ayane",
      "text": "Let’s maybe not joke about that."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Ayane’s letter is just as frantic and rushed as she said it might be. But it’s honest in the same way Niki’s old letters were when Noriko handed a box of them to me a few Christmases ago."
    },
    {
      "character": "narrator",
      "text": "Granted, this one is far less insane- and it focuses primarily on recapping everything that’s happened while I’ve been over here in agony."
    },
    {
      "character": "narrator",
      "text": "Imani and Wakana are losing it. Rin and Otoha broke up. Makoto’s joined the Rooftop Apocalypse Squad and Sana’s been-"
    },
    {
      "character": "narrator",
      "text": "Sana’s been acting differently..."
    },
    {
      "character": "narrator",
      "text": "There are other things in here too. Like how much she misses me or how different school is now that she’s actually required to work again."
    },
    {
      "character": "narrator",
      "text": "She likes it. It keeps her busy so she’s not stuck thinking about me all the time. But of course, those thoughts pick back up at night."
    },
    {
      "character": "narrator",
      "text": "She’s been crying a lot. The letter doesn’t say that, but there’s a smudge near the bottom left corner of the page that I’m pretty sure is a tear drop."
    },
    {
      "character": "narrator",
      "text": "I put my arm around her. But I do it because I want to, not because I want to comfort her."
    },
    {
      "character": "narrator",
      "text": "And for a brief moment in time, I forget just why I’m here in the first place. "
    },
    {
      "character": "narrator",
      "text": "I forget the grief and the loss and the sensation of connecting with someone who seemed so out of reach for so, so long. "
    },
    {
      "character": "narrator",
      "text": "But it comes back near the end of the letter when she talks about {i}her.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}I watched Maya struggle with her collar after school the other day. The one with the bell she always wears.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Were you the one who bought that for her? Was it so you could always hear her coming? Did the sound of walking beside her cheer you up like it always does for me?{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Regardless of the reason, I watched her struggle. She couldn’t get the clasp to work and she slammed it down on the table.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}For a moment, it looked like she was going to cry. But she held her breath, tried again, and eventually got the clasp to work.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}I’m pretty sure she misses you. Even if she won’t say it.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Please, come back to us.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Please.{/i}"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Thank you, Ayane."
    },
    {
      "character": "Ayane",
      "text": "You don’t have to thank me. In fact, I’d prefer if you didn’t. Things have been so hectic lately that I didn’t even remember to get you a real present for Christmas."
    },
    {
      "character": "Sensei",
      "text": "This is more than enough. And way more than I’ve ever gotten you for any occasion."
    },
    {
      "character": "Ayane",
      "text": "You’re right. You should buy me presents more often."
    },
    {
      "character": "Sensei",
      "text": "I should."
    },
    {
      "character": "Ayane",
      "text": "You should say more nice things to me and spend more time with me and tell me you love me more often and stuff."
    },
    {
      "character": "Sensei",
      "text": "I should."
    },
    {
      "character": "Ayane",
      "text": "You should marry me."
    },
    {
      "character": "Sensei",
      "text": "I should."
    },
    {
      "character": "Ayane",
      "text": "!..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Uhh..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ayane",
      "text": "Saying it like that kind of makes it sound like you’re actually...considering it?"
    },
    {
      "character": "Sensei",
      "text": "Does it? Interesting."
    },
    {
      "character": "Ayane",
      "text": "{i}Interesting?{/i}"
    },
    {
      "character": "Sensei",
      "text": "It’s risky, though. Makoto already has my signature on a marriage registration and I’m pretty sure submitting both might cause some problems."
    },
    {
      "character": "Ayane",
      "text": "Why does Makoto have your signature on a wedding registration, exactly?"
    },
    {
      "character": "Sensei",
      "text": "It was an accident."
    },
    {
      "character": "Ayane",
      "text": "And I’m going to guess your penis also wound up inside of her after the two of you slipped on a banana peel?"
    },
    {
      "character": "Sensei",
      "text": "It was a large banana. You’re familiar with them. You know how it works."
    },
    {
      "character": "Ayane",
      "text": "Sensei...do you really-"
    },
    {
      "character": "Sensei",
      "text": "Ayane."
    },
    {
      "character": "Ayane",
      "text": "What? What is it?"
    },
    {
      "character": "Sensei",
      "text": "I need your help talking to Ami."
    },
    {
      "character": "narrator",
      "text": "{i}Ayane’s affection has increased by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "ayane_love +": {
      "from": 3,
      "to": 10
    },
    "ayanespring1": {
      "from": null,
      "to": true
    }
  }
}