{
  "event_id": 331,
  "event_label": "springend5",
  "dialogue": [
    {
      "character": "narrator",
      "text": "There is no warm welcome when I make it back to class, but I’d be lying if I said I expected one."
    },
    {
      "character": "narrator",
      "text": "There’s no welcome at all, come to think of it. But there {i}is{/i} silence in the classroom for the first time since I was reborn here. So at least there’s that to think about."
    },
    {
      "character": "narrator",
      "text": "In a sense though, maybe this silence {i}is{/i} my welcome? "
    },
    {
      "character": "narrator",
      "text": "Maybe it’s what I get after {b}ABANDONING{/b} these girls the same way I {b}ABANDONED{/b} her."
    },
    {
      "character": "narrator",
      "text": "Maybe I should line them up and fuck them into oblivion right here and now before throwing myself off the roof of this building and starting over from scratch."
    },
    {
      "character": "narrator",
      "text": "I keep thinking I might see her again if I do. But I’m unable to think about it for very long as the pungent stench of a nearby rotting meat puppet is rather distracting and out of place."
    },
    {
      "character": "narrator",
      "text": "These are my girls."
    },
    {
      "character": "narrator",
      "text": "This is my class."
    },
    {
      "character": "narrator",
      "text": "This is where I stand when I “teach” class."
    },
    {
      "character": "narrator",
      "text": "But unlike the beginning of this so-called life, my motivation has been shot. And those once-ulterior motives of mine can no longer be called “motives” at all."
    },
    {
      "character": "narrator",
      "text": "Now, they’re just impulses. Holes for me to hide in when predators begin to circle me, excitedly awaiting the perfect moment to swoop down and rip my head off of my body."
    },
    {
      "character": "narrator",
      "text": "There’s a fleeting memory that creeps in as I stare down this ocean of unease."
    },
    {
      "character": "narrator",
      "text": "A hawk and a half-eaten squirrel."
    },
    {
      "character": "narrator",
      "text": "The drops of blood that stained my summer uniform."
    },
    {
      "character": "narrator",
      "text": "I need to speak now."
    },
    {
      "character": "narrator",
      "text": "I need to tell them why I’m here."
    },
    {
      "character": "Sensei",
      "text": "Um..."
    },
    {
      "character": "Sensei",
      "text": "If anyone wants to yell at me, please do it now. But also note that Miss Watabe covered everything about how being here is my “responsibility” and how not doing that was kind of a dick move."
    },
    {
      "character": "narrator",
      "text": "Of course, no one responds. And my half-hearted attempt at a tongue-in-cheek introduction has done nothing but lay the groundwork for several oral blisters."
    },
    {
      "character": "narrator",
      "text": "However, as excited as I am to taste the fluid they conceal, I must save some of it or I won’t have anything left to spew all over these girls but the same liquid lifeline I so often squeeze out of my cock."
    },
    {
      "character": "Sensei",
      "text": "Right. So, I guess I owe you all an explanation as to why I haven’t been here in two months. But apologies in advance since you likely all know just how bad I am at explaining things by now."
    },
    {
      "character": "Sensei",
      "text": "Without beating around the bush, I lost something I cared about. Something I..."
    },
    {
      "character": "Sensei",
      "text": "Something I loved. There’s no sense in dancing around it at this point. That’s how it was. That’s how it {i}is.{/i} And without it, I’m kind of hopeless. {i}More{/i} hopeless."
    },
    {
      "character": "Sensei",
      "text": "Like...there’s no chance to improve or...{i}get better{/i} anymore. And any shot I had at that vanished along with the thing I lost. "
    },
    {
      "character": "Sensei",
      "text": "I’m not going to pretend I’m okay now or act like things are going to go back to normal. They’re not. And I owe it to all of you, who’ve been by my side this whole time, to be as truthful as I can."
    },
    {
      "character": "Sensei",
      "text": "The problem with that is I can only be {i}so{/i} truthful as lying is just part of my nature at this point. But I won’t embellish on that as it would only cause more problems and that’s not what I’m here to do."
    },
    {
      "character": "Sensei",
      "text": "I’ve spent the last two months in bed at home. "
    },
    {
      "character": "Sensei",
      "text": "Ami’s taken care of me the entire time and I don’t want any of you holding that against her as that’s what I would have {i}wanted{/i} her to do if I was...you know. Conscious."
    },
    {
      "character": "Sensei",
      "text": "And she did a great job, I think. Even if it meant disappointing or angering any of you who may have wanted to come visit me."
    },
    {
      "character": "Sensei",
      "text": "Be happy you didn’t, though. And be happy you didn’t get to see me in whatever sorry state I was in because I highly doubt it’d be anything you’d {i}want{/i} to see."
    },
    {
      "character": "Miku",
      "text": "Wait, I got a question! That thing ya lost, what was it? There really ain’t no way for us to help you get it back?"
    },
    {
      "character": "Makoto",
      "text": "Miku, let him finish."
    },
    {
      "character": "Kirin",
      "text": "No, Miku’s right. If you’re going to try to be as “truthful as you can,” can’t you give us that much? "
    },
    {
      "character": "Nodoka",
      "text": "If I didn’t know any better, I’d say he was referring to a lover of some sort. But it appears that everyone he’d ever rightfully consider as a candidate for {i}love{/i} is here in this very room."
    },
    {
      "character": "Sensei",
      "text": "I’m not going to tell you what it was since it would make me sound insane — which you’re probably all thinking right now anyway-"
    },
    {
      "character": "Futaba",
      "text": "Not at all! None of us hold this against you, Sensei! We were...we were just worried!"
    },
    {
      "character": "Otoha",
      "text": "Yeah, even {i}I{/i} was thinking about breaking into your house like dorm 7 did."
    },
    {
      "character": "Kirin",
      "text": "Wait, what? There was a break-in and I wasn’t invited?"
    },
    {
      "character": "Uta",
      "text": "{i}Io! You told her?!{/i}"
    },
    {
      "character": "Io",
      "text": "It came up naturally. "
    },
    {
      "character": "Kirin",
      "text": "Io, what the fuck?!"
    },
    {
      "character": "Io",
      "text": "What? Do you seriously think I’d invite {i}you{/i} to any-"
    },
    {
      "character": "Imani",
      "text": "Hey! Quiet down. You’ll all have plenty of time to talk once Sensei’s done filling you in on his situation."
    },
    {
      "character": "Imani",
      "text": "Go ahead, Senpai. If they interrupt you again, I’ll start cracking domes."
    },
    {
      "character": "Sensei",
      "text": "Thanks, Imani."
    },
    {
      "character": "Sensei",
      "text": "Fortunately, I don’t have much left in terms of “filling you all in.” I’ve just regained some amount of sentience and figured I should let you all know I’m alive so you don’t have to worry anymore."
    },
    {
      "character": "Rin",
      "text": "So we don’t have to worry?...Do you seriously think this is going to make us {i}stop{/i} worrying about you?"
    },
    {
      "character": "Touka",
      "text": "If I can add something here...I do believe this does more harm than good in that regard, Sensei. {i}Alive{/i} as you may be, you still seem rather...shell-shocked, to say the least."
    },
    {
      "character": "Tsuneyo",
      "text": "To say the most, it is my belief that you look even uglier than normal, bro."
    },
    {
      "character": "Sensei",
      "text": "Thank you, Tsuneyo. And Touka. And Rin. And all of you. "
    },
    {
      "character": "Sensei",
      "text": "Perhaps saying that you won’t have to worry anymore was putting it a little too lightly. I’m well aware of how I look right now and how...different this is from the way I normally “handle” things."
    },
    {
      "character": "Sensei",
      "text": "I just don’t know what else to do anymore now that I’ve lost the one bit of hope I had left."
    },
    {
      "character": "Noriko",
      "text": "There’s more...you {i}know{/i} there’s more! You’ve come back from this before! And you’ve got us here to help you this time!"
    },
    {
      "character": "Molly",
      "text": "The psion preaches truth, Sir! You have my axe! And anything else you may want- including (but not limited to) a frail Irish shoulder to cry on."
    },
    {
      "character": "Sensei",
      "text": "Again, thank you. I’m sorry for how depressing this all sounds and how...{i}childish{/i} it must seem for a grown man to basically cry about his problems in front of an entire classroom."
    },
    {
      "character": "Sensei",
      "text": "I just..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I think I need some time away from this."
    },
    {
      "character": "Sensei",
      "text": "I don’t want to be here anymore."
    },
    {
      "character": "Makoto",
      "text": "As in...as in you’re quitting? You’re not going to be our teacher anymore?"
    },
    {
      "character": "Yumi",
      "text": "To be fair, was he ever?"
    },
    {
      "character": "Uta",
      "text": "Fuck off, Yumi! Sensei’s in pain right now and hitting him while he’s down is-"
    },
    {
      "character": "Yumi",
      "text": "Easy, deerfucker. You tryin’ to arm wrestle again?"
    },
    {
      "character": "Uta",
      "text": "I-"
    },
    {
      "character": "Imani",
      "text": "Enough! Both of you!"
    },
    {
      "character": "Sensei",
      "text": "I’m not {i}quitting.{/i} I just..."
    },
    {
      "character": "Sensei",
      "text": "I’m not ready to come back yet."
    },
    {
      "character": "Sensei",
      "text": "So I guess I should throw an apology to Imani in here as well since I’ll be asking her to keep covering for me until I feel more...human."
    },
    {
      "character": "Kirin",
      "text": "Can we, like...still hang out with you, at least? {i}Outside{/i} of school."
    },
    {
      "character": "Sensei",
      "text": "Maybe. I don’t know."
    },
    {
      "character": "Sensei",
      "text": "I’ll come find you if I want to see you. Just don’t expect too much from me since I have nothing left to give."
    },
    {
      "character": "narrator",
      "text": "I pause, half-expecting the silence to disappear in favor of uncertain whispers or anxious mumbles, but all eyes remain on me while {i}my{/i} eyes remain on the floor."
    },
    {
      "character": "narrator",
      "text": "My irises have grown far too heavy to lift any further than this. And despite how much I want to hide them in the depths of forty others, I simply can’t move. "
    },
    {
      "character": "narrator",
      "text": "If you could see the world through my eyes...right now, all you’d see is shame and guilt, twisted into the shape of a chalk outline on a blue-tiled floor."
    },
    {
      "character": "narrator",
      "text": "You’d see my shadow. And if you inherited my present state-of-mind, you’d perceive it as a monster. Something you need to run away from."
    },
    {
      "character": "narrator",
      "text": "But your legs would lock like a fainting goat. Then, you’d wait to be devoured."
    },
    {
      "character": "narrator",
      "text": "Maybe that rotting stench of meat has been me all along. And maybe this class will turn to vultures and pick me clean like the detritivores they are."
    },
    {
      "character": "narrator",
      "text": "Every one of us is a scavenger. And it isn’t long until someone here makes the first move and the true colors of our rapidly fading rainbow will finally be revealed."
    },
    {
      "character": "narrator",
      "text": "If life is like a work of art, let my body be the brush. "
    },
    {
      "character": "narrator",
      "text": "May I be dunked in lead-based paint and dragged across the canvas until I’m stiff and worthless and dropped into a trash bag. "
    },
    {
      "character": "narrator",
      "text": "I hope Heaven is a pile of waste so that I may once more catch a glimpse of all the bitter fruit I discarded."
    },
    {
      "character": "narrator",
      "text": "I hope the enzymes from her decayed carcass destroy my technicolor crust and reunite us beneath a mountain of tissues and maggots and everything in between."
    },
    {
      "character": "narrator",
      "text": "I hope this is the last time I am hurt."
    },
    {
      "character": "narrator",
      "text": "But if there is anything I know about God and Its awful plan, it’s that it won’t be."
    },
    {
      "character": "narrator",
      "text": "It’s that I have much more hurting to do."
    },
    {
      "character": "Yasu",
      "text": "Oh..."
    },
    {
      "character": "Yasu",
      "text": "My lamb..."
    },
    {
      "character": "Yasu",
      "text": "He has returned..."
    },
    {
      "character": "Rin",
      "text": "Touka, come get your girl. I have too many questions about what the hell that could possibly mean."
    },
    {
      "character": "Touka",
      "text": "I-"
    },
    {
      "character": "Ami",
      "text": "I also have a question!"
    },
    {
      "character": "Ami",
      "text": "Well, I guess it’d be more accurate to say it’s not a question. Just a thing I want to mention in regard to my uncle’s situation."
    },
    {
      "character": "Ami",
      "text": "So...Sensei! If it’s okay, may I have a word with the class next?"
    },
    {
      "character": "Sensei",
      "text": "I don’t...know if that’s the best idea, Ami."
    },
    {
      "character": "Ami",
      "text": "Why? You’re not insinuating that I’ve been going crazy, are you? Just look at my adorable smile! I’m more than capable of talking to all of my friends without saying anything rash or mean!"
    },
    {
      "character": "Io",
      "text": "Yeah, I don’t know if I believe that."
    },
    {
      "character": "Uta",
      "text": "Maybe...wait until {i}after{/i} class is over, Ami?"
    },
    {
      "character": "Ami",
      "text": "Nobody will listen to me {i}after{/i} class, Uta! Besides, you should hear this speech too! Like, really! Before you lose even more of my trust!"
    },
    {
      "character": "Ayane",
      "text": "Ami...don’t."
    },
    {
      "character": "Ami",
      "text": "Don’t what? I haven’t done anything yet."
    },
    {
      "character": "Ayane",
      "text": "Just don’t...please..."
    },
    {
      "character": "Ami",
      "text": "Boy, you sure are {i}weird{/i} today, Ayane!"
    },
    {
      "character": "Ami",
      "text": "Sensei! May I speak now?"
    },
    {
      "character": "Sensei",
      "text": "I-"
    },
    {
      "character": "Ami",
      "text": "Great! Thanks for yielding the floor to me!"
    },
    {
      "character": "Imani",
      "text": "{i}Senpai...you sure this is okay? Doesn’t she seem a little...off to you?{/i}"
    },
    {
      "character": "Sensei",
      "text": "Huh?...What?..."
    },
    {
      "character": "Sensei",
      "text": "Ami?..."
    },
    {
      "character": "Ami",
      "text": "Hi, everybody! My name’s Ami Arakawa, but most of you probably know that already!"
    },
    {
      "character": "Ami",
      "text": "My interests include my uncle, cooking for my uncle, cleaning my uncle’s room, washing my uncle’s clothes, and talking about my uncle!"
    },
    {
      "character": "Yumi",
      "text": "Bitch just described half the god damn class."
    },
    {
      "character": "Ami",
      "text": "Hahaha! I really did, didn’t I? And I’m glad you mentioned that, Yumi! Because that’s kind of what I wanted to talk to you guys about!"
    },
    {
      "character": "Ami",
      "text": "As you can see, Sensei’s fallen on some pretty tough times recently. And his mental health has taken a real turn for the worse!"
    },
    {
      "character": "Ami",
      "text": "And while I’m sure there are many of you who are suuuuuuuper-duper worried about that, you should probably just leave him alone!"
    },
    {
      "character": "Ami",
      "text": "And by “probably” I mean you should {i}definitely{/i} leave him alone because A — you don’t get it. And B — you just want him to fuck your silly little brains out! Teehee!"
    },
    {
      "character": "Maya",
      "text": "!..."
    },
    {
      "character": "Ami",
      "text": "Oh! Is something wrong, [[REDACTED]?"
    },
    {
      "character": "Maya",
      "text": "Nope...just hit my knee on the desk. "
    },
    {
      "character": "Ami",
      "text": "Wow! It sounded pretty painful! Maybe you should go to the nurse’s office and make sure it’s not broken."
    },
    {
      "character": "Maya",
      "text": "Good idea. I’ll do that right now."
    },
    {
      "character": "Ami",
      "text": "Okaaaaay! See you later! Hope your “knee” is okay!"
    },
    {
      "character": "Ayane",
      "text": "{i}I knew it...I fucking knew it...{/i}"
    },
    {
      "character": "Imani",
      "text": "Listen, Ami. I’m gonna take it easy since I know the past couple months haven’t exactly been a cake-walk for {i}you{/i} either, but you can’t say shit like that in school. Ever. Don’t do it again."
    },
    {
      "character": "Ami",
      "text": "Are you saying that because you’re a teacher and it’s your {i}job{/i} to say it? Or because you just don’t like the thought of him having sex with anyone who isn’t you?"
    },
    {
      "character": "Imani",
      "text": "Oh, this fucking-"
    },
    {
      "character": "Sensei",
      "text": "Imani, wait."
    },
    {
      "character": "Imani",
      "text": "Wait?! The hell you mean, “wait?!” Did you hear what she just said to me?!"
    },
    {
      "character": "Sensei",
      "text": "I can handle this. "
    },
    {
      "character": "Sensei",
      "text": "Ami, go home. Now."
    },
    {
      "character": "Ami",
      "text": "No!"
    },
    {
      "character": "Imani",
      "text": "Wow! Great job, Senpai! You really showed her!"
    },
    {
      "character": "Sensei",
      "text": "Ami, I mean it. Go. Home. Before you make things even worse."
    },
    {
      "character": "Ami",
      "text": "No thanks! I need to make sure that {i}everybody{/i} here knows that you have {i}no{/i} interest in them whatsoever and that any affection you ever showed to {i}any{/i} of them was all out of pity or obligation!"
    },
    {
      "character": "Ami",
      "text": "I understand that he’s super handsome and charismatic and smart and funny and hot and awesome and that those qualities might make it {i}impossible{/i} to stay away from him, but figure it out!"
    },
    {
      "character": "Ami",
      "text": "Because if I find out that any of you so much as lay a {i}finger{/i} on him from this point on, I will strangle you with your own organs! Do you understand? Thank you!"
    }
  ],
  "state_changes": {
    "springend5": {
      "from": null,
      "to": true
    }
  }
}