{
  "event_id": 332,
  "event_label": "chikaspring1",
  "dialogue": [
    {
      "character": "Chika",
      "text": "{b}You creepy, clingy, incestuous bitch! Who the {i}fuck{/i} do you think you are?!{/b}"
    },
    {
      "character": "Ami",
      "text": "Ami Arakawa! Were you not paying attention to my introduction?"
    },
    {
      "character": "Yumi",
      "text": "Chika...chill. Don’t do anythin’ you might regret. She’s obviously off her fuckin’ rocker. Ain’t nobody takin’ her seriously right now. Just let it go."
    },
    {
      "character": "Noriko",
      "text": "Ami...maybe you should listen to Sensei and go home early today?"
    },
    {
      "character": "Chika",
      "text": "No, fuck that! I’m not gonna let her get away with standing up there and making {i}everyone else{/i} in this room feel small just so {i}she{/i} can feel wanted for the first time in her miserable fucking life."
    },
    {
      "character": "Yumi",
      "text": "Chika, seriously. Don’t do this."
    },
    {
      "character": "Ami",
      "text": "Chika, if you have a question, you’re supposed to raise your hand. I can’t call on you if you don’t do that!"
    },
    {
      "character": "Chika",
      "text": "Miss Arakawa! I have a question."
    },
    {
      "character": "Ami",
      "text": "Yes, Miss Chosokabe! What is it?"
    },
    {
      "character": "Chika",
      "text": "Just out of curiosity, how does it feel knowing your uncle isn’t ever going to fuck you and that your sheer existence is causing him an excruciating amount of pain?"
    },
    {
      "character": "Ami",
      "text": "I’m not sure I understand. Didn’t you hear him talking about how good of a job I did just a few minutes ago? Or were you too busy pretending he’d rather sleep with {i}you{/i} instead? Because that’s just sad."
    },
    {
      "character": "Chika",
      "text": "I’m going to rip your spine out."
    },
    {
      "character": "Yumi",
      "text": "Fuck it. Let {i}me{/i} handle this. It ain’t gonna make a difference if {i}I{/i} get kicked outta school again. Yo, Ami! Why don’t you tell me again what you just said about my best friend?!"
    },
    {
      "character": "Touka",
      "text": "Both of you, please settle down. We can solve this without violence."
    },
    {
      "character": "Chika",
      "text": "Touka, I love you, but stay the fuck out of this. "
    },
    {
      "character": "Yumi",
      "text": "Yeah, me and Chika have this shit on lock."
    },
    {
      "character": "Chika",
      "text": "You stay out of this too. I’d prefer to be the one to teach her a lesson today, thank you very much."
    },
    {
      "character": "Ami",
      "text": "Oooooh, yeah. Really sorry about that, but my speech isn’t over yet. I haven’t gotten to the part where I talk about what I’ll do to all of you {i}after{/i} I remove your organs."
    },
    {
      "character": "Chika",
      "text": "Then why don’t I come a little closer so you can tell it to me personally?!"
    },
    {
      "character": "Yumi",
      "text": "Chika, come on! You’re better than this!"
    },
    {
      "character": "Ami",
      "text": "No, I don’t think she is. In fact, I’m starting to think she’s the most obsessed out of all of you. "
    },
    {
      "character": "Ami",
      "text": "Hate to break it to you, Chika, but Sensei doesn’t have very much money. So why don’t you be a good little girl and go dig for gold somewhere else. Okay? Okay!"
    },
    {
      "character": "Chika",
      "text": "You think I care about his {i}money?{/i} Is that how it looks to you? "
    },
    {
      "character": "Ami",
      "text": "That or you’re just a slut. Which, you know, really wouldn’t be all that surprising since your costumes at all of our holiday parties always come off as super desperate and icky."
    },
    {
      "character": "Chika",
      "text": "Almost as {i}desperate and icky{/i} as forcing your uncle to come with you into dressing rooms. Or getting up in front of the class and pretending like you have {i}any{/i} say in who he does or doesn’t sleep with."
    },
    {
      "character": "Imani",
      "text": "Senpai, what the fuck is going on right now?"
    },
    {
      "character": "Sensei",
      "text": "I don’t...I..."
    },
    {
      "character": "Ami",
      "text": "Why wouldn’t I have a say in that? As his future wife and the mother of his children, I think I have the right to express disinterest in him cheating on me. Even {i}if{/i} he’s cheating down."
    },
    {
      "character": "Ami",
      "text": "Like way down. Beneath the poverty line. "
    },
    {
      "character": "Chika",
      "text": "He’s not your plaything, you psychotic cunt! He’s a man! A good man! And he’d never stoop to the levels you’re insinuating! Not everyone is as deranged as you, Ami! Not everyone wants to fuck their family!"
    },
    {
      "character": "Ami",
      "text": "Stop yelling, you’re scaring me~"
    },
    {
      "character": "Chika",
      "text": "Bitch, you {i}should{/i} be scared. ‘Cause I ain’t fuckin’ around anymore, Ami. And I will gut you like a fucking {i}pig{/i} if you think for a second that you can tell me what to do with {i}my{/i} life."
    },
    {
      "character": "Ami",
      "text": "I’m not telling you what to do with your life. Just that Sensei doesn’t have any interest in you or anyone else because you’re all gross and he loves me. "
    },
    {
      "character": "Ami",
      "text": "And that ignoring his interests {i}may{/i} lead to some light organ removal as I will interpret it as an attack on his well-being."
    },
    {
      "character": "Chika",
      "text": "Have you considered at all that maybe {i}you’re{/i} what’s damaging his well-being? Because I recall you mentioning something about him calling you...what was it again? Suffocating?"
    },
    {
      "character": "Chika",
      "text": "And he’s never said anything like that to {i}me.{/i} So I think this might be a you problem. And I think that maybe {i}you{/i} should stay as far away from your uncle as humanly possible. "
    },
    {
      "character": "Chika",
      "text": "The bottom of the ocean might be a good fit. I can help you get there, you know. ‘Cause I might be poor, but concrete’s pretty cheap. An 80lb bag only goes for ¥1,000 last time I checked."
    },
    {
      "character": "Kirin",
      "text": "How the fuck does she know that?"
    },
    {
      "character": "Yumi",
      "text": "Hell if I know. This is exactly why you don’t fuck with Chika."
    },
    {
      "character": "Imani",
      "text": "Easy on the death threats, okay? I’ve accepted that today is just gonna be “drama day,” but there are like...ten different lines you guys shouldn’t cross and you’re standing on all of them right now."
    },
    {
      "character": "Sensei",
      "text": "Both of you...stop. Please."
    },
    {
      "character": "Chika",
      "text": "You gonna open your eyes, Ami? Or are you just gonna keep standing there smiling like a fucking-"
    },
    {
      "character": "Ami",
      "text": "This you?"
    },
    {
      "character": "Chika",
      "text": "Huh? Wha-"
    },
    {
      "character": "Imani",
      "text": "Hm? What’s she got there?"
    },
    {
      "character": "Chika",
      "text": "You..."
    },
    {
      "character": "Chika",
      "text": "{i}You went through his fucking phone?...{/i}"
    },
    {
      "character": "Rin",
      "text": "What’s Ami showing her? I can’t hear from all the way back here."
    },
    {
      "character": "Futaba",
      "text": "I can’t...really tell..."
    },
    {
      "character": "Nodoka",
      "text": "I think I know what’s happening right now. And it makes me sad to know that I’m the only one who appreciates the beauty of this perfect full circle."
    },
    {
      "character": "Imani",
      "text": "Senpai?..."
    },
    {
      "character": "Ami",
      "text": "Cute picture, Chika. Blonde suited you way better than whatever you have going on right now."
    },
    {
      "character": "Chika",
      "text": "You...are {i}dead.{/i} Do you hear me?"
    },
    {
      "character": "Ami",
      "text": "What was that? I’m gonna need you to speak up."
    },
    {
      "character": "Sensei",
      "text": "Both of you. My office. Now."
    },
    {
      "character": "narrator",
      "text": "I push past Imani and grab Chika’s arm before she’s able to attack Ami. Meanwhile, Imani and the others look on in shock."
    },
    {
      "character": "narrator",
      "text": "I can’t tell you what’s going through their heads. And I don’t have the time to sit here and think about it right now. Not while two girls I love are trying to kill each other."
    },
    {
      "character": "narrator",
      "text": "Is this the right time to talk about love? To question its validity? To ask what exactly it means?"
    },
    {
      "character": "Chika",
      "text": "You disgusting, little demonspawn! You probably touched yourself to that picture, didn’t you?! Hope you liked it since it’s the closest you’ll ever get to Sensei’s dick, you fucking monster!"
    },
    {
      "character": "narrator",
      "text": "No. Now is probably not the right time."
    },
    {
      "character": "narrator",
      "text": "But I’m sure we’ll touch on it later since the thought of love as a whole right now just makes me want to puke."
    },
    {
      "character": "Ami",
      "text": "I’ve seen his penis a zillion times. We live together, remember? It’s not like I lied and manipulated him into showing me like you had to."
    },
    {
      "character": "Chika",
      "text": "Someone could have seen that, you fucking moron! You could have ruined his career! "
    },
    {
      "character": "Ami",
      "text": "See? I knew you were only concerned about his money. So how about this? I'll give you my next week’s allowance, and you can use it to go fuck off where you can’t bother us anymore."
    },
    {
      "character": "Chika",
      "text": "Sensei! Let go of me so I can fucking kill her! She’ll expose {i}everything{/i} at this rate! "
    },
    {
      "character": "Ami",
      "text": "Awwww, she thinks there’s more to your relationship than just unwanted nudes and forced physical contact. "
    },
    {
      "character": "Chika",
      "text": "Do you hear this shit?! Because if {i}you’re{/i} just going to let her say it, at least give {i}me{/i} the pleasure of knocking her teeth out!"
    },
    {
      "character": "Sensei",
      "text": "Don’t hit her, Chika. She needs help. She isn’t always like this."
    },
    {
      "character": "Chika",
      "text": "What do you mean she “isn’t always like this?!” Because she sure as fuck seems like the crazy, obsessive freak she’s always been to me!"
    },
    {
      "character": "Chika",
      "text": "We all know she wants to fuck you! You know it too! But we let it slide and never did shit about it because we always thought it was harmless! But it isn’t fucking harmless anymore, Sensei!"
    },
    {
      "character": "Chika",
      "text": "She’s {i}trying{/i} to hurt us now! She’s weaponizing her ditzy fucking cuteness and gaslighting you into thinking she’s helping when all she’s {i}really{/i} doing is making everything worse! "
    },
    {
      "character": "Ami",
      "text": "Oh, give me a fucking break. You wouldn’t last five minutes in my shoes. You’d see how much work it is and then fuck off to the next hot, big-dicked guy who’s willing to pay for your phone bill."
    },
    {
      "character": "Ami",
      "text": "Which I canceled, by the way. Your service should be shutting off tomorrow or the next day. But hey, maybe you can start selling your nudes or something. You sure seem to like taking them."
    },
    {
      "character": "Chika",
      "text": "{b}KANTOTERO!!!!!!!! ANAK NG PUTA!!!!!!!!!! SIPSIPIN MO ANG TITI KO!!!!!!!!!!!{/b}"
    },
    {
      "character": "Ami",
      "text": "Awwww, I love you too! I just love you more when you’re not tricking my uncle into thinking you actually care about him."
    },
    {
      "character": "Chika",
      "text": "You have no fucking clue what you’re talking about, Ami! What he and I have is bigger and better than {i}anything{/i} you’ll ever get from him! You’re just a jealous little cunt who doesn’t know her place!"
    },
    {
      "character": "Ami",
      "text": "My place is beside my uncle. Which is something {i}you’ll{/i} never understand since you don’t know the first thing about where his pain comes from."
    },
    {
      "character": "Ami",
      "text": "None of you do. But you all {i}loooooooove{/i} to pretend that you’d be fine swapping places with me because the side of him {i}you{/i} know is a facade. And you probably think it’ll just be more of that."
    },
    {
      "character": "Ami",
      "text": "But that’s just the thing, Chika. The person I take care of and the person you pretend to “love” aren’t the same. They just have the same shell."
    },
    {
      "character": "Ami",
      "text": "The problem is, I really like that shell. And I don’t want you to mess it up with all your cheap makeup and perfume and stuff."
    },
    {
      "character": "Ami",
      "text": "So if you could do me a favor and mind your own fucking business from now on, that’d be really swell. Oh, and since the rest of the girls seem to like you, let {i}them{/i} know playtime’s over too."
    },
    {
      "character": "Ami",
      "text": "Because I might not have Sensei’s phone anymore, but that doesn’t mean I won’t notice if he disappears into the bathroom with it for an...{i}extended{/i} period of time."
    },
    {
      "character": "Chika",
      "text": "Bullshit. I’m the only person who sends him anything like that. Right, Sensei?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "Sensei! Chika asked you a question."
    },
    {
      "character": "Chika",
      "text": "Right?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Ami",
      "text": "He’s hiding something when he stays quiet like that."
    },
    {
      "character": "Chika",
      "text": "E-Even if he is...it doesn’t change that you’re a fucking maniac and that you’ve gone so far out of line this time that I should wring your fucking neck."
    },
    {
      "character": "Chika",
      "text": "But out of respect for Sensei, I won’t."
    },
    {
      "character": "Ami",
      "text": "Aww, how kind."
    },
    {
      "character": "Chika",
      "text": "To be clear, I won’t {i}this{/i} time. But if I find out that you’re {i}still{/i} being a fucking creep when you walk out of here today...and doing {i}more{/i} shit that puts him in an uncomfortable position-"
    },
    {
      "character": "Chika",
      "text": "I will flay the skin from your body and feed it to the homeless people outside of my house. "
    },
    {
      "character": "Chika",
      "text": "And {i}yes.{/i} There {i}are{/i} homeless people outside of my house. {i}Yes,{/i} I am poor as shit. {i}Yes,{/i} Sensei paid for my phone bill up until you canceled it..."
    },
    {
      "character": "Chika",
      "text": "But don’t you {i}dare{/i} insinuate {i}that{/i} being the reason I’m in love with him."
    },
    {
      "character": "Ami",
      "text": "Oh, I didn’t mean to insinuate you being “in love” with him at all. So I’m sorry if it came across that way. But thankfully, you’ll be staying away from now on. Right?"
    },
    {
      "character": "Chika",
      "text": "Not. A. Fucking. Chance."
    },
    {
      "character": "Ami",
      "text": "Hm."
    },
    {
      "character": "Ami",
      "text": "I was afraid you’d say something like that."
    },
    {
      "character": "Sensei",
      "text": "Ami, go home."
    },
    {
      "character": "Ami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Now."
    },
    {
      "character": "Ami",
      "text": "Are you gonna fuck her, Sensei?"
    },
    {
      "character": "Chika",
      "text": "I’ll be sure to send you a picture if and when he does."
    },
    {
      "character": "Ami",
      "text": "This is {i}really{/i} how you want to celebrate being out in the world again? Sex with...{i}her?{/i} Wander down any narrow alley in the urban district and you can find someone twice as hot for half the price."
    },
    {
      "character": "Sensei",
      "text": "What I do with my own time is none of your business.  "
    },
    {
      "character": "Ami",
      "text": "Yes it is. "
    },
    {
      "character": "Chika",
      "text": "No it’s not."
    },
    {
      "character": "Ami",
      "text": "Yes it is."
    },
    {
      "character": "Chika",
      "text": "No it’s not."
    },
    {
      "character": "Sensei",
      "text": "Shut up. Both of you. "
    },
    {
      "character": "Sensei",
      "text": "Ami...I think we need to stay at home for a little while longer. And I think {i}you{/i} need some rest before you start acting out even worse than you did today."
    },
    {
      "character": "Ami",
      "text": "Oh, this wasn’t bad at all. But I agree. We should spend more time alone, Sensei. "
    },
    {
      "character": "Ami",
      "text": "I’ll warm up your onahole so you can have something to relieve yourself into when having sex with Chika feels more like throwing a hot dog down a hallway."
    },
    {
      "character": "Ami",
      "text": "That is, unless you want to relieve yourself in {i}me.{/i} But you’d neeeeeeever want to do that because you’re not attracted to your family. Riiiiiiight?"
    },
    {
      "character": "Sensei",
      "text": "Go. Home."
    },
    {
      "character": "Ami",
      "text": "Boooooooooooring! You’ll call me when you’re on the way, right? You’re leaving right after me?"
    },
    {
      "character": "Sensei",
      "text": "Yes, I’ll call you. Just leave."
    },
    {
      "character": "Ami",
      "text": "Okaaaaay! Love you, Sensei!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I’m...so sorry you had to deal with that."
    },
    {
      "character": "Chika",
      "text": "Sorry?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "You think saying {i}sorry{/i} is going to make me feel better?"
    },
    {
      "character": "Chika",
      "text": "You leave me in the dark for two fucking months and the first thing I get when you come back is an argument with your niece and the revelation that you have nudes from {i}other girls{/i} on your phone?!"
    },
    {
      "character": "Chika",
      "text": "You didn’t even think to tell me about that?! How long have they been on there?! Whose are they?! Are you responding?! Are they just sending them to you out of nowhere?! What the fuck?!"
    },
    {
      "character": "Sensei",
      "text": "Chika, I think the Ami thing is a more pressing matter than that right now."
    },
    {
      "character": "Chika",
      "text": "They’re both “pressing matters,” asshole! I’ve been looking forward to this reunion since the second I found out you weren’t feeling well, but {i}now{/i} I just feel like another face in the crowd!"
    },
    {
      "character": "Chika",
      "text": "Did you miss me {i}at all?{/i} Did you even think about me {i}at all?{/i}"
    },
    {
      "character": "Sensei",
      "text": "Chika, I didn’t think about {i}anything{/i} at all. I’ve been in what was effectively a coma. I hadn’t even taken a real bath until just a few days ago."
    },
    {
      "character": "Chika",
      "text": "Well, what the fuck happened?! What could you have possibly lost that hurt you that badly?! Was it a family member? A friend? What happened, Sensei?"
    },
    {
      "character": "Chika",
      "text": "I can’t help you if I don’t know what-"
    },
    {
      "character": "Sensei",
      "text": "You wouldn’t be able to help me even if you did."
    },
    {
      "character": "Chika",
      "text": "But Ami {i}can?...{/i}"
    },
    {
      "character": "Sensei",
      "text": "Better than you can, at least. And I really {i}hate{/i} saying that after everything I just saw her say to you and everyone else, but she’s right about one thing — you guys {i}don’t{/i} get it."
    },
    {
      "character": "Sensei",
      "text": "She and I have been together forever, and she’s seen me at my worst. She knows better than anyone the things that hurt me and...she creates an environment where they don’t have to."
    },
    {
      "character": "Sensei",
      "text": "But it’s not a {i}good{/i} environment. It doesn’t {i}fix{/i} me. I just wind up feeling numb and broken until something forces me out of bed again."
    },
    {
      "character": "Chika",
      "text": "What was it that forced you out of bed this time?"
    },
    {
      "character": "Sensei",
      "text": "An angel with scissor wings and spider legs."
    },
    {
      "character": "Chika",
      "text": "I don’t get it."
    },
    {
      "character": "Sensei",
      "text": "Neither do I. But the point is that Ami is just as broken as me, Chika. And instead of being stuck in bed for two months, she’s lashing out like this and trying to shape the world back into what {i}she{/i} wants."
    },
    {
      "character": "Chika",
      "text": "Yeah, but what she wants is your dick. And a lifetime worth of nothing but you. It’s unrealistic, irrational, and entirely selfish."
    },
    {
      "character": "Sensei",
      "text": "And that’s just the kind of girl she is."
    },
    {
      "character": "Chika",
      "text": "So, what? You want me to just...{i}like{/i} her? Because I seriously {i}will{/i} kill her if she pulls that shit again, Sensei. I don’t care about the consequences."
    },
    {
      "character": "Sensei",
      "text": "Then you’re just as unrealistic, irrational, and selfish as she is. You have a sister to take care of."
    },
    {
      "character": "Chika",
      "text": "And a boyfriend."
    },
    {
      "character": "Sensei",
      "text": "I can take care of myself."
    },
    {
      "character": "Chika",
      "text": "Apparently not if Ami’s the only one who’s able to help in that department."
    },
    {
      "character": "Sensei",
      "text": "Chika-"
    },
    {
      "character": "Chika",
      "text": "Listen...I don’t want our first day back together to be a big fight, so I’m just going to go home. I don’t know if you’ve heard, but I haven’t been showing up all that much lately anyway."
    },
    {
      "character": "Sensei",
      "text": "Because of me, right?"
    },
    {
      "character": "Chika",
      "text": "Well, obviously! It’s kind of hard to focus when I can’t stop worrying!"
    },
    {
      "character": "Chika",
      "text": "But...you’re okay now. Well, not {i}okay.{/i} But...you know what I mean. And just knowing that helps...{i}way{/i} more than you can imagine."
    },
    {
      "character": "Sensei",
      "text": "I’m sorry you had to worry, Chika. I’m sorry for everything."
    },
    {
      "character": "Chika",
      "text": "If you’re really sorry, you’ll babysit for me tomorrow."
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Chika",
      "text": "I said, if you’re really sorry-"
    },
    {
      "character": "Sensei",
      "text": "I heard what you said. I just...don’t think I’m really in the correct mindset to be babysitting right-"
    },
    {
      "character": "Chika",
      "text": "Well, then I guess you’re not sorry and I guess I’m going to have to kill your niece."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Fine. But after that, I need to stay with Ami. Okay?"
    },
    {
      "character": "Chika",
      "text": "We’ll see."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "Also, my address is going to be a little different. But I’m closer to you now, so..."
    },
    {
      "character": "Sensei",
      "text": "You moved?"
    },
    {
      "character": "Chika",
      "text": "I’m {i}moving.{/i} My boiler busted so I was going to take some of mine and Chinami’s stuff to the new place after school today. Guess I’m able to get started early now, huh?"
    },
    {
      "character": "Sensei",
      "text": "Does this...new place happen to be-"
    },
    {
      "character": "Chika",
      "text": "You’ll see tomorrow. It’s a {i}surprise.{/i}"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "Well...I guess I’ll be going then."
    },
    {
      "character": "Sensei",
      "text": "And I guess I’ll see you tomorrow."
    },
    {
      "character": "Chika",
      "text": "Poison Ami’s water for me."
    },
    {
      "character": "Sensei",
      "text": "I don’t think I can do that, Chika."
    },
    {
      "character": "Chika",
      "text": "Rats."
    },
    {
      "character": "narrator",
      "text": "Chika leaves without saying anything else, and..."
    },
    {
      "character": "narrator",
      "text": "Suddenly, I’m alone again."
    },
    {
      "character": "narrator",
      "text": "For a second, it’s like nothing even changed."
    },
    {
      "character": "narrator",
      "text": "But the air feels a little bit heavier."
    },
    {
      "character": "narrator",
      "text": "My plant in the corner of the room looks dryer than normal. "
    },
    {
      "character": "narrator",
      "text": "And I-"
    },
    {
      "character": "Chika",
      "text": "Hey. You don’t by any chance want to have sex right now, do you?"
    },
    {
      "character": "Sensei",
      "text": "Not right now, Chika."
    },
    {
      "character": "Chika",
      "text": "Fair. I just wanted to make sure."
    },
    {
      "character": "narrator",
      "text": "And I-"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "What was I saying again?"
    },
    {
      "character": "narrator",
      "text": "Oh, right."
    },
    {
      "character": "narrator",
      "text": "I have one less student to worry about than I used to."
    },
    {
      "character": "narrator",
      "text": "{i}Chika’s affection has increased by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "chikaspring1": {
      "from": null,
      "to": true
    },
    "chika_love +": {
      "from": 1,
      "to": 10
    }
  }
}