{
  "event_id": 334,
  "event_label": "sanaspring1",
  "dialogue": [
    {
      "character": "narrator",
      "text": "Before I know it, the sun begins to set. And just like I’ve done a million times before, I waste away my school day pretending that I don’t deserve a thousand needles beneath my nails."
    },
    {
      "character": "narrator",
      "text": "But on the bright side, my inability to smile has cascaded into a glorious spectacle providing hours and hours of entertainment for a bunch of girls who are young enough to be my daughters."
    },
    {
      "character": "narrator",
      "text": "Meanwhile, the two girls who are {i}like{/i} daughters to me begin to panic and worry as I replace my manic Monday with one of melancholy."
    },
    {
      "character": "narrator",
      "text": "What I mean is I’m missing calls from Ayane now as well. And while it would be infinitely easier to just turn off my phone, I like the attention. I like knowing they’re worried."
    },
    {
      "character": "narrator",
      "text": "It’s a beautiful contrast to these four, who seem more inclined to rebuild the status quo from the ground up rather than attempt to reconstruct it."
    },
    {
      "character": "narrator",
      "text": "I’m sure there’s another life in which I’d choose differently. And in that life (Or lives, if I’m fortunate enough to find myself conscious in even more places), I hope that choice makes me happy."
    },
    {
      "character": "narrator",
      "text": "Because I’m sure it’s obvious, but right now, I can’t come close to saying that’s the way I feel."
    },
    {
      "character": "narrator",
      "text": "This whole trip has been a game of charades in which I pretend I didn’t destroy the world."
    },
    {
      "character": "narrator",
      "text": "It is a game that I have lost."
    },
    {
      "character": "narrator",
      "text": "So let my premature death be a warning to all of you-"
    },
    {
      "character": "Rin",
      "text": "Sensei!"
    },
    {
      "character": "narrator",
      "text": "If you know you don’t deserve something, just leave it alone. "
    },
    {
      "character": "narrator",
      "text": "Black sheep can’t blend in with cats."
    },
    {
      "character": "Rin",
      "text": "You zoning out again? We didn’t push you too hard, did we?"
    },
    {
      "character": "Sensei",
      "text": "You did, actually. But any amount of pushing is too hard when your body feels like it’s been hit by a truck."
    },
    {
      "character": "Molly",
      "text": "Being hit by a truck would likely to be preferable to your current situation, Sir. If there’s anything I’ve learned from anime, it’s that truck fatalities are typically a blessing in disguise."
    },
    {
      "character": "Rin",
      "text": "Molly, stop. You’re gonna give him ideas."
    },
    {
      "character": "Molly",
      "text": "All I’m saying is it would greatly increase his chances of creating an elf harem."
    },
    {
      "character": "Sensei",
      "text": "Now you’re going to give Futaba ideas."
    },
    {
      "character": "Futaba",
      "text": "I can’t believe I actually missed you."
    },
    {
      "character": "Rin",
      "text": "Ignoring Futaba’s elf fetish, {i}please{/i} don’t get hit by a truck on the way home. Because I’d probably blame myself for dragging you around and it would weigh on me for the rest of my life."
    },
    {
      "character": "Molly",
      "text": "Agreed, Sir! And thank you for escorting us back to the dorms. It is at this point where I would ideally like to give you a quest reward. But unfortunately, all I have on me are the clothes on my back."
    },
    {
      "character": "Sensei",
      "text": "I’ll take the tie. I can use it to hang myself later."
    },
    {
      "character": "Rin",
      "text": "That isn’t funny, Sensei."
    },
    {
      "character": "Molly",
      "text": "It’d be best to remember who you’re talking to when you make {i}jokes{/i} like that, Sir. "
    },
    {
      "character": "Sensei",
      "text": "Oh...shit. Molly, I forgot. I’m sorry."
    },
    {
      "character": "Molly",
      "text": "Hah...‘tis fine. Just use your hearthstone and get some rest. We all know you’re having a tough go of it right now. And I’m sure being around us didn’t help at all."
    },
    {
      "character": "Sensei",
      "text": "Is there something you’d like to add, Sana? You’re the only one who still looks like they want to kill me."
    },
    {
      "character": "Sana",
      "text": "No dying allowed...that’s my biggest and...only rule..."
    },
    {
      "character": "Sensei",
      "text": "At the risk of accidentally offending {i}you{/i} as well, I’ll just nod and agree."
    },
    {
      "character": "Futaba",
      "text": "Do you need us to call you a cab, Sensei? Because I assume you won’t be coming inside. "
    },
    {
      "character": "Molly",
      "text": "Well, if he does it in the cab, it’ll just...oh. Never mind. I greatly misunderstood where that sentence was going."
    },
    {
      "character": "Futaba",
      "text": "Ignore her."
    },
    {
      "character": "Sensei",
      "text": "I’ll be fine. But thanks for offering. And apologies again for being terrible company and making you all feel terrible about yourselves today."
    },
    {
      "character": "Rin",
      "text": "God, you’re like...even worse than Io right now. Please get better soon, Sensei. I really hate seeing you like this."
    },
    {
      "character": "Futaba",
      "text": "We all do. But I suppose we’ve done all we can today and...all that’s left is to...wait and see if you call us."
    },
    {
      "character": "Molly",
      "text": "Which you can do any time you want, Sir. The offer to stay with the Kendo Princess and me stands."
    },
    {
      "character": "Sensei",
      "text": "I’ll keep that in mind. And I’ll see you guys around. Hopefully under better circumstances."
    },
    {
      "character": "Sana",
      "text": "A...Actually...would you want to...walk with me? I have work, so...I’m not going back to the dorms just yet..."
    },
    {
      "character": "Rin",
      "text": "Like...just you two alone?"
    },
    {
      "character": "Sana",
      "text": "Is that...weird?...Don’t we all...hang out with Sensei alone at times?..."
    },
    {
      "character": "Rin",
      "text": "It’s not weird. Just wondering."
    },
    {
      "character": "Molly",
      "text": "I’d be open to walking with you as well, Zagull. We can talk more about the mechanics for your new arm. "
    },
    {
      "character": "Sana",
      "text": "That’s...nice, but..."
    },
    {
      "character": "Sana",
      "text": "I kind of...just want it to be Sensei..."
    },
    {
      "character": "Molly",
      "text": "Oh. Well, I guess I’ll just fuck myself then."
    },
    {
      "character": "Sana",
      "text": "Is that...okay?"
    },
    {
      "character": "Sensei",
      "text": "You just have to stop by the bar, right? You’re not going to drag me to some sort of pit-stop along the way where I’ll have to talk about my {i}feelings?{/i}"
    },
    {
      "character": "Sana",
      "text": "I think...that’d just make me late, so...we can pass on the...feelings..."
    },
    {
      "character": "Sensei",
      "text": "Then sure. It’s not like one more detour is going to make any sort of difference when I’m going to be mur-"
    },
    {
      "character": "Sensei",
      "text": "When I’m going to be severely punished the moment I get home."
    },
    {
      "character": "Sana",
      "text": "Nice save..."
    },
    {
      "character": "narrator",
      "text": "Futaba, Rin, and Molly head inside after waving goodbye to the two of us and...suddenly, I’m alone with Sana for the first time since-"
    },
    {
      "character": "narrator",
      "text": "For the first time in a while."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "But it’s not just because it’s been so long that things feel different now. "
    },
    {
      "character": "narrator",
      "text": "Sana is...well, she doesn’t feel the way she used to. And {i}I{/i} no longer feel like it’s my duty to protect her whenever she’s by my side."
    },
    {
      "character": "narrator",
      "text": "And frankly, that’s a good thing. Because I wouldn’t even be able to protect a kitten in my current state. Or an egg. Or anything else that needs to be handled with care."
    },
    {
      "character": "narrator",
      "text": "But it’s not like I can rely on her to protect me either the way I could with, like...Ami or...Ayane or...Niki. Or even Chika when she’s not shopping for concrete."
    },
    {
      "character": "narrator",
      "text": "She’s a girl I can kind of just exist with. "
    },
    {
      "character": "narrator",
      "text": "No she’s not. I can’t exist with her at all."
    },
    {
      "character": "Sana",
      "text": "You’ve been...really quiet ever since we left the dorms, Sensei..."
    },
    {
      "character": "Sensei",
      "text": "I was quiet before that too. I’m being held against my will right now."
    },
    {
      "character": "Sana",
      "text": "Is that so?"
    },
    {
      "character": "Sana",
      "text": "You really think a girl my size could ever hold someone like {i}you{/i} against your will? If anything...wouldn’t it normally be the other way around?"
    },
    {
      "character": "Sensei",
      "text": "Probably. "
    },
    {
      "character": "Sana",
      "text": "Probably?"
    },
    {
      "character": "Sensei",
      "text": "I’m not really sure what else you expect me to say there."
    },
    {
      "character": "Sana",
      "text": "I wasn’t expecting anything in particular...I just think it’s a little weird seeing you so...different all of a sudden. It feels strange being the...more confident one out of the two of us..."
    },
    {
      "character": "Sensei",
      "text": "Yeah, well...confidence for me was never much of a strong suit to begin with. I’ve moreso just been a staunch believer of “fake it ‘til you make it.”"
    },
    {
      "character": "Sana",
      "text": "I think...that’s a perfectly fine strategy to have. But I’d still like it if you could get back to your old self soon."
    },
    {
      "character": "Sensei",
      "text": "Yeah, well...so would I."
    },
    {
      "character": "Sana",
      "text": "Why not talk about it? We’re alone now...and I’ve yet to give up any of your...{i}secrets...{/i}"
    },
    {
      "character": "Sensei",
      "text": "Do you actually want to talk about that stuff? Or is there something else you want instead? "
    },
    {
      "character": "Sana",
      "text": "I don’t care what we talk about...I’m just happy to be with you again."
    },
    {
      "character": "Sana",
      "text": "I’ve had a lot of time to think while you’ve been gone...a lot of time to, like...self-reflect, I guess? And I think I agree with what everyone’s been saying about how I’ve been changing lately."
    },
    {
      "character": "Sana",
      "text": "There was a lot of stuff I said before I knew you very well that...doesn’t really explain the way I feel anymore. So me just...being open like this doesn’t mean I {i}want{/i} something."
    },
    {
      "character": "Sana",
      "text": "I’m just in a good mood. That’s all."
    },
    {
      "character": "Sana",
      "text": "I missed you just as much as everybody else."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "N...Not getting a response to that...{i}is{/i} kind of embarrassing, though..."
    },
    {
      "character": "Sensei",
      "text": "Sana..."
    },
    {
      "character": "Sensei",
      "text": "Did something, like...{i}happen{/i} to you?"
    },
    {
      "character": "Sana",
      "text": "Other than you, you mean?"
    },
    {
      "character": "Sensei",
      "text": "Yeah. Because I don’t think I alone could have made this sort of impact on you after one delusional night followed by two months of complete absence."
    },
    {
      "character": "Sana",
      "text": "Delusional, huh?"
    },
    {
      "character": "Sana",
      "text": "You know...maybe something {i}did{/i} happen. "
    },
    {
      "character": "Sana",
      "text": "Maybe something {i}keeps{/i} happening. And I’m just not really sure how to talk about it or...even {i}start{/i} explaining it to anyone."
    },
    {
      "character": "Sana",
      "text": "That might just be a...side effect of never talking to anyone about {i}anything,{/i} though..."
    },
    {
      "character": "Sana",
      "text": "You can relate to that...can’t you?"
    },
    {
      "character": "Sana",
      "text": "Even with Ayane...it’s not like I can just tell her how I feel. Or let her know about the stuff that scares me...because it’ll just make things more complicated and...before I know it, she’ll be stressed too..."
    },
    {
      "character": "Sensei",
      "text": "You’re stressed about something?"
    },
    {
      "character": "Sana",
      "text": "You’d be stressed too if you were stuck in this body. But it’s not just that I’ve been troubled by lately...it’s everything. "
    },
    {
      "character": "Sana",
      "text": "You see...I keep having these weird dreams where I can hear my brother’s voice, but I never get to {i}see{/i} him. And what I {i}do{/i} see is impossible to even describe. "
    },
    {
      "character": "Sana",
      "text": "They’re really creepy dreams, actually. They’re even...kind of cool in hindsight. Like, maybe I’m actually pretty creative after all?"
    },
    {
      "character": "Sensei",
      "text": "What does your brother tell you in those dreams?"
    },
    {
      "character": "Sana",
      "text": "Stuff that’s...not too different from the kind of stuff Yasu normally says. But he sounds a lot less crazy when he talks about it..."
    },
    {
      "character": "Sana",
      "text": "And even if they’re just dreams, they’ve got me thinking that there might be more to life than this."
    },
    {
      "character": "Sana",
      "text": "Maybe...just trying to keep things the way they are is a waste of my time? "
    },
    {
      "character": "Sana",
      "text": "I only get one life...so why don’t I try to make the best of it? Because...for all I know, {i}I{/i} could get stabbed to death tomorrow and this would all be over without me having ever {i}loved{/i} anything."
    },
    {
      "character": "Sana",
      "text": "The thought of that is pretty scary, isn’t it?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "You said you lost something, didn’t you? Something you {i}loved.{/i}"
    },
    {
      "character": "Sensei",
      "text": "...."
    },
    {
      "character": "Sana",
      "text": "What was it like? That feeling. {i}Love.{/i}"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "It was horrible."
    },
    {
      "character": "Sensei",
      "text": "I’d kill to have it back."
    },
    {
      "character": "Sana",
      "text": "Do you think you ever can?..."
    },
    {
      "character": "Sensei",
      "text": "I don’t know..."
    },
    {
      "character": "Sana",
      "text": "Hm..."
    },
    {
      "character": "Sana",
      "text": "I think that’s fine. "
    },
    {
      "character": "Sana",
      "text": "You don’t need to know everything about your future now."
    },
    {
      "character": "Sana",
      "text": "Because, even if you feel lost, there’s always the possibility that something will appear out of nowhere and show you what you really want out of life."
    },
    {
      "character": "Sensei",
      "text": "Do you think that’s what those “dreams” of yours are trying to do?"
    },
    {
      "character": "Sana",
      "text": "Trying, maybe. But I’m not sure if they’re having the right effect on me. "
    },
    {
      "character": "Sana",
      "text": "I’m changing...yeah...but how much of that is because of those and how much of it is because of what I’m experiencing outside of them?"
    },
    {
      "character": "Sana",
      "text": "It’s not a thing you can measure..."
    },
    {
      "character": "Sana",
      "text": "I think I just want to be happy. "
    },
    {
      "character": "Sana",
      "text": "And I’m not sure if I’ve ever really felt that way before."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "Did any of that make sense to you? Or do I just sound kind of crazy now?"
    },
    {
      "character": "Sensei",
      "text": "It made sense. And I’m sure you’re not far off in saying that our dreams can show us what it is we want out of life. Because I’ve been having the same dream lately too, and..."
    },
    {
      "character": "Sensei",
      "text": "And what I see in those dreams is the {i}only{/i} thing I want right now."
    },
    {
      "character": "Sana",
      "text": "Then take it."
    },
    {
      "character": "Sensei",
      "text": "I can’t {i}do{/i} that because it’s the same thing I lost. Which is why all I want to do is sleep now since it’s the only time I ever get to see {i}it.{/i}"
    },
    {
      "character": "Sana",
      "text": "Then...I hope you find something else. Something attainable."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "There was something else I dreamt too, Sana. "
    },
    {
      "character": "Sana",
      "text": "Is that so?"
    },
    {
      "character": "Sensei",
      "text": "Though, it might not have been a dream. It could have been some sort of delusion. That does happen unfortunately often."
    },
    {
      "character": "Sana",
      "text": "So I’ve heard."
    },
    {
      "character": "Sensei",
      "text": "I’m talking about you."
    },
    {
      "character": "Sana",
      "text": "Huh?..."
    },
    {
      "character": "Sensei",
      "text": "In the dream or...vision or...delusion or whatever you want to call it, you were there. But it wasn’t {i}you{/i} as you are now."
    },
    {
      "character": "Sensei",
      "text": "It was years from now, in the future. And...I remember that you were the only person I had left."
    },
    {
      "character": "Sensei",
      "text": "Everyone else was gone. And...And I think you loved me. But I was so broken at the time that I’m not sure I loved you back."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "You’d come to my house...make me dinner...have sex with me...then you’d curl up in a ball and sleep by my side until it was time for you to go back home."
    },
    {
      "character": "Sensei",
      "text": "It was like having an entire second life inside of my head. And it all felt so real and so...{i}comfortable.{/i}"
    },
    {
      "character": "Sensei",
      "text": "But at the same time, it filled me with such a great deal of dread that I’m terrified even trying to recall it right now."
    },
    {
      "character": "Sensei",
      "text": "Why was it you? Why were {i}you{/i} the girl who stayed with me when, with all due respect, I’m so much closer to almost everyone else?"
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "Huh."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "Do I ever get taller?"
    },
    {
      "character": "Sensei",
      "text": "What?"
    },
    {
      "character": "Sana",
      "text": "When I’m older...Do I keep growing? Or is this just going to be my height for the rest of my life?"
    },
    {
      "character": "Sensei",
      "text": "{i}That’s{/i} your first question? Why?"
    },
    {
      "character": "Sana",
      "text": "I’m trying to envision it...and I can only picture the way you look from all the way down here. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "What did the house look like?...What color were the cabinets?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "They were blue."
    },
    {
      "character": "Sensei",
      "text": "There were checkerboard tiles covering the floor...and a vase of roses near the entryway beside a coat rack full of things I never wore."
    },
    {
      "character": "Sensei",
      "text": "The windows were boarded and there was an ugly carpet in front of the sink where fish would appear once per week."
    },
    {
      "character": "Sensei",
      "text": "A voice on the PA above the door would announce the weather for the day and remind me that I shouldn’t ever leave. And I’d spend my free time either writing or watching porn."
    },
    {
      "character": "Sensei",
      "text": "The table was a clock...I had a parrot and a squirrel...and the cabinet above the stove wore a wig and loved the Notebook."
    },
    {
      "character": "Sensei",
      "text": "Should I stop now? Is it getting too weird?"
    },
    {
      "character": "Sana",
      "text": "No...keep going."
    },
    {
      "character": "Sana",
      "text": "I want to see everything you saw."
    },
    {
      "character": "Sensei",
      "text": "But why?...Everything about it was just so...{i}wrong.{/i}"
    },
    {
      "character": "Sana",
      "text": "It’s simple, really."
    },
    {
      "character": "Sana",
      "text": "It might be the only future I ever get to have with you."
    },
    {
      "character": "narrator",
      "text": "I finish explaining the room in my head to Sana...and she never once calls me insane despite how badly I deserve it."
    },
    {
      "character": "narrator",
      "text": "And I wish she would have- "
    },
    {
      "character": "narrator",
      "text": "Because the smile on her face brings me closer to comfort than I am comfortable with. "
    },
    {
      "character": "narrator",
      "text": "Has she always been this beautiful? This {i}calming?{/i}"
    },
    {
      "character": "narrator",
      "text": "Is {i}this{/i} why it was her in there with me? Have I known it all along and just pushed it aside in favor of those a bit less angelic?"
    },
    {
      "character": "narrator",
      "text": "These are questions I don’t want to have because I know they can’t be answered."
    },
    {
      "character": "narrator",
      "text": "And even if they could, I fear the way the results would make me feel."
    },
    {
      "character": "narrator",
      "text": "Because when feeling {i}anything{/i} is like a dagger in my heart, this overabundance of longing does naught but cut the cords that hold it up."
    },
    {
      "character": "narrator",
      "text": "If {i}she{/i} were still here, she’d call me disgusting. "
    },
    {
      "character": "narrator",
      "text": "She’d be right."
    },
    {
      "character": "narrator",
      "text": "So I grit my teeth to prevent this new wave of feelings from flowing in."
    },
    {
      "character": "narrator",
      "text": "I don’t want them to wash away what’s left of {i}her.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Sana’s affection has increased to [sana_love]!{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    }
  ],
  "state_changes": {
    "sanaspring1": {
      "from": null,
      "to": true
    },
    "sana_love +": {
      "from": 10,
      "to": 1
    }
  }
}