{
  "event_id": 337,
  "event_label": "chikaspring2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "It isn’t often that I wake up in unfamiliar rooms, but it {i}is{/i} often that I feel out of place."
    },
    {
      "character": "narrator",
      "text": "This is strange on one hand, and all too common on the other."
    },
    {
      "character": "narrator",
      "text": "And as I lie here in bed with a girl half my size and half my age, I come to terms with the fact that I have never been pure."
    },
    {
      "character": "narrator",
      "text": "I was born just as everyone else — with original sin and a cord attached to my belly. But while one was severed and left to decay in a dumpster somewhere, the other sits with me to this day."
    },
    {
      "character": "narrator",
      "text": "It’s never bothered me before. Knowing I had never had a chance, I mean. Because, when it really comes down to it, there isn’t a single person on the face of this earth that’s truly pure."
    },
    {
      "character": "narrator",
      "text": "I thought there was once."
    },
    {
      "character": "narrator",
      "text": "But I was just deluding myself."
    },
    {
      "character": "narrator",
      "text": "I latched onto something that felt impossible and out of reach. But in my head, it was more like I was latching onto the idea of holding something I knew I couldn’t have."
    },
    {
      "character": "narrator",
      "text": "What I know now is that there is nothing I can not take."
    },
    {
      "character": "narrator",
      "text": "It’s that I {i}should have{/i} taken something when I was told to."
    },
    {
      "character": "narrator",
      "text": "Because if I had only listened to directions, the girl beside me might be different right now."
    },
    {
      "character": "narrator",
      "text": "And while their sizes are similar, I can’t imagine one as the other even when I close my eyes."
    },
    {
      "character": "narrator",
      "text": "I know this to be true, because I tried all throughout the night."
    },
    {
      "character": "Sara",
      "text": "Sana! Are you still asleep in there? It’s half-past nine already!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sara",
      "text": "Sana, don’t you have school today? You’re gonna be late! You need to get up!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sara",
      "text": "{i}Hah...{/i}Fine! You can stay home! But I have things to do, so I won’t be here to make you breakfast whenever you decide to get out of bed! Got it?!"
    },
    {
      "character": "Sana",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sara",
      "text": "{i}Ah, who am I kidding? It’s not like she can hear me.{/i}"
    },
    {
      "character": "narrator",
      "text": "Sara’s footsteps fade away, only to be replaced by the creaking of her stairway seconds later."
    },
    {
      "character": "narrator",
      "text": "Part of me wished she would have opened the door. That she would have seen me here in bed beside her daughter, with nothing more than a thick blanket covering the two of us."
    },
    {
      "character": "narrator",
      "text": "But even this I get away with."
    },
    {
      "character": "narrator",
      "text": "I’m practically invincible."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "But only practically."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "That’s not as many as I thought."
    },
    {
      "character": "narrator",
      "text": "I wonder if Ami got any sleep last night."
    },
    {
      "character": "narrator",
      "text": "I can’t imagine she did. But the last call from her came in around 6:00 AM, so I guess it’s possible she finally crashed after being hysterical for so long."
    },
    {
      "character": "narrator",
      "text": "Or she’s dead."
    },
    {
      "character": "narrator",
      "text": "If that’s the case, I’ll probably just end it today as well."
    },
    {
      "character": "narrator",
      "text": "I got to knock Sana off my bucket list, so at least I’d be going out with a bang. Just not {i}literally{/i} as we didn’t have sex last night."
    },
    {
      "character": "narrator",
      "text": "It’ll happen soon, though."
    },
    {
      "character": "narrator",
      "text": "She’s the type who won’t ever say no."
    },
    {
      "character": "Sensei",
      "text": "What am I doing?..."
    },
    {
      "character": "narrator",
      "text": "The phone begins to vibrate once more."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "But it’s not who I expect it to be."
    },
    {
      "character": "Sensei",
      "text": "Hello?"
    },
    {
      "character": "Chika",
      "text": "Hey! Are you just waking up now? You sound tired."
    },
    {
      "character": "Sensei",
      "text": "I had a long night."
    },
    {
      "character": "Chika",
      "text": "Because you were burying Ami’s body in a ditch somewhere? God, please tell me that’s it."
    },
    {
      "character": "Sensei",
      "text": "Something like that."
    },
    {
      "character": "Chika",
      "text": "Awesome! That means I might get to work a double today. You don’t mind staying a little longer, do you? Chinami’s super excited to see you."
    },
    {
      "character": "Sensei",
      "text": "Oh, right. Babysitting."
    },
    {
      "character": "Chika",
      "text": "Babysitting, indeed. I’ll send you the new address just as soon as I’m done with my makeup. Don’t worry about travel time, though. It’s waaaaay closer than my old place. Way nicer too. You’ll love it."
    },
    {
      "character": "Chika",
      "text": "Can you come now? Should I make some coffee for you? "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "Sensei? You there? You didn’t fall back asleep, did you?"
    },
    {
      "character": "Sensei",
      "text": "No, I’m here."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I can come now."
    },
    {
      "character": "Chika",
      "text": "Great!"
    },
    {
      "character": "Chika",
      "text": "Go ahead and get ready then. And, if you get here early enough, I might even have a little surprise in store for youuuuu~"
    },
    {
      "character": "Sensei",
      "text": "Is it sex?"
    },
    {
      "character": "Chika",
      "text": "Not this time, unfortunately. But {i}God{/i} I wish it was. I’ve been literally dying without you. "
    },
    {
      "character": "Chika",
      "text": "{i}And between the two of us, I didn’t touch myself at all the whole time you were gone~{/i}"
    },
    {
      "character": "Sensei",
      "text": "Oh yeah?"
    },
    {
      "character": "Chika",
      "text": "{i}Yeah...so you can bet I’ll be extra eager to ride your big, hard-{/i} PANCAKES!"
    },
    {
      "character": "Sensei",
      "text": "...My what?"
    },
    {
      "character": "Chika",
      "text": "Sorry! Gotta go! Chinami’s breakfast is burning!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Chika hangs up the phone and sends me her new address a few minutes later."
    },
    {
      "character": "narrator",
      "text": "As expected given the Tsukiokas’ ability to “make things happen,” she’s in the same building as me. "
    },
    {
      "character": "narrator",
      "text": "But thankfully, she’s on a different floor. So at least I’ll have that layer of privacy in...a building I barely spend any time in to begin with."
    },
    {
      "character": "narrator",
      "text": "But...maybe that will change."
    },
    {
      "character": "narrator",
      "text": "Ami doesn’t know about it yet, so I could always disappear there if I need to get away from-"
    },
    {
      "character": "narrator",
      "text": "No. No, I shouldn’t think that. I don’t need to get away from her. I love her. And right now, she needs me. "
    },
    {
      "character": "narrator",
      "text": "Right now, she’s hurting and..."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "And..."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I put my clothes back on...and cover the rest of Sana’s body with the blanket."
    },
    {
      "character": "narrator",
      "text": "She doesn’t move a muscle."
    },
    {
      "character": "narrator",
      "text": "But when she finally wakes up, I hope she thinks of me."
    },
    {
      "character": "narrator",
      "text": "And our house inside of my head."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I make it there by 10:30, but I’m surprised to find a completely empty parking lot without a single moving truck in sight."
    },
    {
      "character": "narrator",
      "text": "Maybe Chika’s the first one to move in apart from me? I still have no idea what Touka’s plan is- or {i}was,{/i} considering that she likely didn’t stop just because I was bedridden."
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I wonder how she’s doing."
    },
    {
      "character": "narrator",
      "text": "And I wonder how she felt about my last ditch effort to regain some sanity by leaning on her during the Halloween party."
    },
    {
      "character": "narrator",
      "text": "I hope she didn’t mind."
    },
    {
      "character": "narrator",
      "text": "If only I was brave enough to ask her."
    },
    {
      "character": "Chika",
      "text": "Well, look who it is! And without his mosquito of a niece buzzing around him this time!"
    },
    {
      "character": "Sensei",
      "text": "Hey...and...Touka’s here too, I see."
    },
    {
      "character": "Chinami",
      "text": "And Chinami! Hi, Papa! Chinami missed you lots and hopes you’re feeling better now!"
    },
    {
      "character": "Touka",
      "text": "Good morning, Sensei. I was just explaining some things about the apartment complex to Chika as I’m the new owner of this building and will be renting out several units to low-income families."
    },
    {
      "character": "Touka",
      "text": "That’s not offensive language, is it? “Low-income families?” Do you prefer “lower class” instead?"
    },
    {
      "character": "Chika",
      "text": "Definitely not. Low-income is both accurate and preferred over the latter. And thanks again for making this place affordable, Touka. It really means a lot to us."
    },
    {
      "character": "Sensei",
      "text": "You’re really okay with living here? I thought your place in the old district, like...held a lot of sentimental value and whatnot?"
    },
    {
      "character": "Chika",
      "text": "It did. But staying there forever just...wasn’t going to be possible. Especially with the place practically falling apart over the last couple months. "
    },
    {
      "character": "Chika",
      "text": "But, on the bright side, {i}this{/i} place is so cheap that I can keep both of them. At least for a little while, I mean. Which is great since it gives Yumi a place to stay as well when she doesn’t want to be here."
    },
    {
      "character": "Sensei",
      "text": "Yumi? She’s staying at the old apartment?"
    },
    {
      "character": "Chika",
      "text": "Kinda? I actually think she likes the old district for whatever reason. And I’m pretty sure she’s trying to get a job at the convenience store since Noriko brought up an opening there to her."
    },
    {
      "character": "Chika",
      "text": "So I think the plan now is for her to just bounce around and chip in for rent if she {i}does{/i} get the job. "
    },
    {
      "character": "Chika",
      "text": "But, of course none of this would be possible without you, Touka! You’re seriously saving my ass. And this place will be way better for Chinami in the long run."
    },
    {
      "character": "Chinami",
      "text": "Chinami liked her old house, but she likes this one a lot better! There’s hot water here! And Chinami loves hot water!"
    },
    {
      "character": "Touka",
      "text": "There’s no need to thank me, Chika. This is simply a business venture and not an act of charity by any means. And I {i}will{/i} evict you if you do not make your payments on time."
    },
    {
      "character": "Chika",
      "text": "Oh, you don’t have to worry about that. The maid cafe’s got me covered. And I’ve got auto-pay set up on the same day my new phone bill goes through, so I’ll always know when it’s coming!"
    },
    {
      "character": "Sensei",
      "text": "Oh, right. I’m saving money now."
    },
    {
      "character": "Chika",
      "text": "You sure are! And with how cheap this place is, maybe {i}you{/i} can get a room here as well."
    },
    {
      "character": "Touka",
      "text": "This complex is for women only, I’m afraid. I apologize for the inconvenience, Sensei."
    },
    {
      "character": "Chika",
      "text": "Don’t worry. You’re still allowed to sleep over whenever you want. My name’s on the lease, so I get to do what I want."
    },
    {
      "character": "Touka",
      "text": "That much is true, yes. There are no rules in place prohibiting “sleepovers” of any sort. Just please keep the noise down as I’ve heard the two of you play {i}games{/i} that tend to be rather...{i}loud{/i} at times."
    },
    {
      "character": "Chika",
      "text": "Oh, you must be talking Yahtzee. I get really into...dice-based board games."
    },
    {
      "character": "Touka",
      "text": "Yes...{i}Yahtzee.{/i}"
    },
    {
      "character": "Touka",
      "text": "Anyway, I must be leaving. I have other matters to attend to. Namely {i}school,{/i} as I’m sure Miss Imai is currently wondering why my perfect attendance has suddenly become {i}imperfect{/i} attendance."
    },
    {
      "character": "Sensei",
      "text": "Touka...wait."
    },
    {
      "character": "Touka",
      "text": "Wait?..."
    },
    {
      "character": "Touka",
      "text": "Do you need something, Sensei?"
    },
    {
      "character": "Chika",
      "text": "Yeah. What do you need from Touka? She’s a busy...business woman now. She’s got stuff to do and things to learn. "
    },
    {
      "character": "Sensei",
      "text": "Can we...talk?"
    },
    {
      "character": "Touka",
      "text": "About what?"
    },
    {
      "character": "Chika",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I..."
    },
    {
      "character": "Sensei",
      "text": "Uhh..."
    },
    {
      "character": "Touka",
      "text": "Ah. You must be referring to those business tips you inquired about before your two-month absence. I apologize, it’s just been so long that I must have forgotten."
    },
    {
      "character": "Chika",
      "text": "Business tips? "
    },
    {
      "character": "Touka",
      "text": "Is that correct, Sensei? Am I mistaken?"
    },
    {
      "character": "Chika",
      "text": "Have you been thinking about quitting teaching for that long? What sort of business are you trying to get into?"
    },
    {
      "character": "Sensei",
      "text": "I...don’t know yet. Which is why I was looking for Touka’s help as I know she has experience with...business."
    },
    {
      "character": "Touka",
      "text": "Then, I will give you my {i}business{/i} phone number. Which is not to be confused with my personal phone number. I am very wealthy, so the fact that I have two phone numbers is believable."
    },
    {
      "character": "Chika",
      "text": "She’s got a point. That is believable."
    },
    {
      "character": "Touka",
      "text": "Your phone please, Sensei. I’ll enter my contact information that you may use to reach me during {i}business{/i} hours only."
    },
    {
      "character": "narrator",
      "text": "Touka snatches my phone out of my hand and...all I can do is silently thank her inside of my head as she expertly covers for me in every which way possible."
    },
    {
      "character": "narrator",
      "text": "{i}You have obtained Touka Tsukioka’s “business” phone number!{/i}"
    },
    {
      "character": "Chika",
      "text": "Hey, isn’t that your personal number?"
    },
    {
      "character": "narrator",
      "text": "{i}Or not!{/i}"
    },
    {
      "character": "Touka",
      "text": "No. But they look very similar, so I can not fault you for thinking that."
    },
    {
      "character": "Touka",
      "text": "I {i}can{/i} fault you for glaring at my belongings, though. That is very unbecoming of you, Chika."
    },
    {
      "character": "Chika",
      "text": "Well, if you’re just gonna let them hang out like that-"
    },
    {
      "character": "Touka",
      "text": "Really?"
    },
    {
      "character": "Chika",
      "text": "Oh. You meant your phone."
    },
    {
      "character": "Touka",
      "text": "..."
    },
    {
      "character": "Chika",
      "text": "What? They’re nice. We all know it."
    },
    {
      "character": "Touka",
      "text": "Yes, well..."
    },
    {
      "character": "Touka",
      "text": "Goodbye."
    },
    {
      "character": "Chika",
      "text": "You can look at mine if it makes you feel better!"
    },
    {
      "character": "Touka",
      "text": "I believe I will be fine without doing that, but thank you for the offer. Now again, goodbye."
    },
    {
      "character": "Touka",
      "text": "And Sensei, please do call about those business tips whenever you can. There are a few things I would like to ask you as well."
    },
    {
      "character": "Sensei",
      "text": "Yeah...see you."
    },
    {
      "character": "narrator",
      "text": "Touka leaves and...honestly, I was not ready to see her today. But I guess I should have expected her to be here considering this is {i}her{/i} building and all."
    },
    {
      "character": "narrator",
      "text": "But...I need to focus on Chika for now. I’ve already messed things up with her after allowing Ami to walk all over her yesterday, so any chance I get to patch things up is-"
    },
    {
      "character": "Chika",
      "text": "Okay. So. I don’t have much time before I have to leave for work, but I wanted you to see me in my outfit before I go since I heard from Uta how much you love maids."
    },
    {
      "character": "narrator",
      "text": "I guess patching things up can wait. "
    },
    {
      "character": "Sensei",
      "text": "I haven’t even commented on your hair yet, have I?"
    },
    {
      "character": "Chika",
      "text": "No, actually. I was so busy wanting to kill Ami yesterday that I forgot to ask you how you felt about it."
    },
    {
      "character": "Sensei",
      "text": "You look beautiful, Chika."
    },
    {
      "character": "Chika",
      "text": "Y...Yeah? You...really think so? It’s not weird after...seeing me blonde for so long?"
    },
    {
      "character": "Chika",
      "text": "Also, don’t look at the rest of me because I’m pretty sure I gained weight while you were gone. And I finally have enough money for a gym membership, but I haven’t had time to go yet and-"
    },
    {
      "character": "Sensei",
      "text": "Sorry to interrupt, but aren’t you short on time? I just really don’t want you to regret not showing me your costume, which is a thing I know you really want to do."
    },
    {
      "character": "Chika",
      "text": "R...Right! Be right back!"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "What? Why are you looking at me like that?"
    },
    {
      "character": "Chinami",
      "text": "Chinami knows flirting when she hears it. Exposure to cable television has made her more aware of love than ever before."
    },
    {
      "character": "Sensei",
      "text": "Chinami, go back to watching TV. Your sister is-"
    },
    {
      "character": "Chinami",
      "text": "My sister really missed you."
    },
    {
      "character": "Chinami",
      "text": "Chinami will give you all the alone time you need together."
    },
    {
      "character": "Chinami",
      "text": "And if you just happen to give Chinami another sister, Chinami won’t mind."
    },
    {
      "character": "Sensei",
      "text": "Yeah, I’m sure..."
    },
    {
      "character": "Chika",
      "text": "Okaaaaay! Here I coooooome!"
    },
    {
      "character": "Chika",
      "text": "Ta-da! Kumon-mi’s hottest new maid, at your service!"
    },
    {
      "character": "Chika",
      "text": "Oh! And speaking of which, did you know Niki was a maid once too?! I have no idea how I never heard about that! It must have been, like, a super underground early promo thing! But wow!"
    },
    {
      "character": "Chika",
      "text": "Learning that was part of my orientation and just knowing I stood in the same locker room as her is...aaah! I’m so friggin’ pumped going to work every day now!"
    },
    {
      "character": "narrator",
      "text": "Yeah, you’ve done much more than just “stand in the same locker room.”"
    },
    {
      "character": "Chika",
      "text": "Like...what if she wore this same dress? Our bodies aren’t {i}that{/i} different, right? She was probably a little smaller back when she did the promo, right? Right???"
    },
    {
      "character": "Sensei",
      "text": "Can I appreciate the way {i}you{/i} look instead of thinking about {i}her{/i} right now?"
    },
    {
      "character": "Chika",
      "text": "Yes! Please do!"
    },
    {
      "character": "Chika",
      "text": "And please say a bunch of sweet things about me since I could really use the dopamine boost after the emotional rollercoaster that has been my last two months!"
    },
    {
      "character": "Sensei",
      "text": "You’re the second prettiest maid I’ve ever laid my eyes on."
    },
    {
      "character": "Chika",
      "text": "That sucked! Hard! But I also knew it was coming since Uta told me all about your obsession with her!"
    },
    {
      "character": "Sensei",
      "text": "My obsession is with Uta-chan, not Uta. "
    },
    {
      "character": "narrator",
      "text": "Though, I’d be lying if I said the two of them haven’t already merged together inside my head."
    },
    {
      "character": "narrator",
      "text": "Chika doesn’t need to know that, though. "
    },
    {
      "character": "Chika",
      "text": "Whatever! Say more nice things!"
    },
    {
      "character": "Sensei",
      "text": "You’re adorable."
    },
    {
      "character": "Chika",
      "text": "More!"
    },
    {
      "character": "Sensei",
      "text": "You’re...cute?"
    },
    {
      "character": "Chika",
      "text": "More, more, more!"
    },
    {
      "character": "Sensei",
      "text": "I love you."
    },
    {
      "character": "Chika",
      "text": "Kyah!"
    },
    {
      "character": "Sensei",
      "text": "Kyah?"
    },
    {
      "character": "Chika",
      "text": "It’s just been so long since I’ve heard you say you love me that my heart skipped a beat! I feel like I’m ready to take on the world now!"
    },
    {
      "character": "Sensei",
      "text": "Then get out there and show the unnamed maid cafe what you’re {i}made{/i} of."
    },
    {
      "character": "Chika",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "I’m sorry. I’ve never been good at making jokes to begin with, but making them when I feel like I could be crushed by the weight of the world at any given moment is significantly harder."
    },
    {
      "character": "Chika",
      "text": "I’m just going to pretend you stopped saying things after “I love you” and go to work now!"
    },
    {
      "character": "Sensei",
      "text": "Sounds good, Chika."
    },
    {
      "character": "Chika",
      "text": "Chinami! Be good for Sensei, okay?"
    },
    {
      "character": "Chika",
      "text": "Sensei, I love you too. Mwah!"
    },
    {
      "character": "Chika",
      "text": "{i}LET’S FUCKING GOOOOO!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Chika’s affection has increased to [chika_love]!{/i}"
    }
  ],
  "state_changes": {
    "totaldays +": {
      "from": 9,
      "to": 1
    },
    "toukanumber": {
      "from": null,
      "to": true
    },
    "chikaspring2": {
      "from": null,
      "to": true
    },
    "chika_love +": {
      "from": 10,
      "to": 1
    },
    "day": {
      "from": 1,
      "to": 2
    }
  }
}