{
  "event_id": 338,
  "event_label": "chinamispring1",
  "dialogue": [
    {
      "character": "Chinami",
      "text": "Three..."
    },
    {
      "character": "Chinami",
      "text": "Two..."
    },
    {
      "character": "Chinami",
      "text": "One..."
    },
    {
      "character": "Chika",
      "text": "I am {i}not{/i} supposed to be wearing this yet!"
    },
    {
      "character": "Chinami",
      "text": "She’s not supposed to be working right now either. But big sis Chika has had her priorities all kinds of messed up lately!"
    },
    {
      "character": "Sensei",
      "text": "Yeah...I can see that."
    },
    {
      "character": "Chika",
      "text": "Okay! {i}Now,{/i} I can leave! Bye, guys! Be good! I’ll let you know when I’m on the way home!"
    },
    {
      "character": "Chika",
      "text": "{i}LET’S FUCKING GO FOR REAL THIS TIIIIIIIME!{/i}"
    },
    {
      "character": "narrator",
      "text": "The clopping of Chika’s boots as she sprints off toward the maid cafe fades long before I want it to. And as she disappears from her now home, I envision a future in which it is ours."
    },
    {
      "character": "narrator",
      "text": "Well...I guess, technically speaking, it {i}is{/i} ours. Just she’s not currently aware that I’m inhabiting such a place. And unless Chinami has ESP (Which is always a possibility), she’s unaware as well."
    },
    {
      "character": "narrator",
      "text": "It’s strange and depressing how the last twenty-four hours have gone. "
    },
    {
      "character": "narrator",
      "text": "I’ve spent time with two families who would openly allow me to insert myself into them (In any way I want) while neglecting the family I already have for reasons I can’t even properly explain."
    },
    {
      "character": "narrator",
      "text": "It’s not fear, is it?"
    },
    {
      "character": "narrator",
      "text": "Responsibility?"
    },
    {
      "character": "narrator",
      "text": "I’d say it’s just me being a terrible guardian, but that’s always been the case as {i}I’ve{/i} been the one being guarded instead."
    },
    {
      "character": "narrator",
      "text": "And when I’m most needed, I’m here — spending time with someone I have nothing in common with as an excuse disguised as obligation."
    },
    {
      "character": "narrator",
      "text": "And as depressing as it is that the Chosokabes have lost both of their parents, the most depressing facet of all is that’s created a future in which {i}I{/i} could be Chinami’s father figure."
    },
    {
      "character": "narrator",
      "text": "And I would break her like the china doll she is, but she doesn’t see me that way. "
    },
    {
      "character": "narrator",
      "text": "Just look at her, completely trusting and vulnerable, when her fate lies entirely in my hands for the next eight or so hours."
    },
    {
      "character": "narrator",
      "text": "Does she not realize how easy it would be for me to snap? How many times it’s happened already? How {i}she{/i} could be the next Yumi or Molly and live the rest of her life scarred and traumatized?"
    },
    {
      "character": "narrator",
      "text": "Of course she doesn’t."
    },
    {
      "character": "narrator",
      "text": "Because not only are those things beyond her understanding at this point in life-"
    },
    {
      "character": "narrator",
      "text": "It’s that the “rest of her life” is questionable to begin with when she’s probably going to die before any one of us."
    },
    {
      "character": "narrator",
      "text": "But hey, maybe I’ll beat her there if the cards start favoring me soon. After all, they {i}do{/i} say that every dog has its day, and I’ve been nothing short of a bitch lately. "
    },
    {
      "character": "Chinami",
      "text": "Arf!"
    },
    {
      "character": "narrator",
      "text": "But I guess Chinami is part-dog too."
    },
    {
      "character": "narrator",
      "text": "I’m just not sure if death is what she’d order off the menu right now."
    },
    {
      "character": "Sensei",
      "text": "Why are you barking without your helmet on?"
    },
    {
      "character": "Chinami",
      "text": "Chinami just felt like barking. Dogs do that sometimes."
    },
    {
      "character": "Chinami",
      "text": "A lot of people say it’s because they can see ghosts, but Chinami isn’t sure she believes in them."
    },
    {
      "character": "Chinami",
      "text": "Do you believe in ghosts, Papa?"
    },
    {
      "character": "Sensei",
      "text": "Yes."
    },
    {
      "character": "Chinami",
      "text": "Really? Chinami is surprised to hear that! Chinami was sure that Papa was about to lecture her about imagination being stupid."
    },
    {
      "character": "Sensei",
      "text": "It’s not stupid, it’s harmful. Plus, I don’t have the energy to lecture you about anything today. So I don’t really care about whatever your stance on dead people is. "
    },
    {
      "character": "Chinami",
      "text": "Imagination is harmful? Why?"
    },
    {
      "character": "Sensei",
      "text": "Well..."
    },
    {
      "character": "Sensei",
      "text": "It doesn’t always have to be."
    },
    {
      "character": "Sensei",
      "text": "But it usually {i}is{/i} because engaging with it is like...spending time away from reality. And there’s no benefit to imagining {i}anything{/i} if the bulk of your life is going to be spent...you know, {i}living.{/i}"
    },
    {
      "character": "Chinami",
      "text": "But it can keep you entertained when things are boring. And if things are boring and you can’t use your imagination, what are you supposed to do?"
    },
    {
      "character": "Sensei",
      "text": "Either sit there and watch TV like you’re doing or engage in acts I can’t talk to you about."
    },
    {
      "character": "Chinami",
      "text": "Is Papa in a bad mood today? He seems a lot grumpier than he was just a minute ago."
    },
    {
      "character": "Sensei",
      "text": "It’s been a tough week. I’m sorry."
    },
    {
      "character": "Chinami",
      "text": "Papa doesn’t need to be sorry! Chinami accepts Papa no matter who he is and how he feels! But Chinami might also just be saying that because she’s always lonely now and wants more company."
    },
    {
      "character": "Chinami",
      "text": "Big sis Chika has been working a lot while you’ve been gone so she can save up money for stuff. And big sis Yumi is...actually, Chinami doesn’t know what big sis Yumi has been doing. But she’s been busy too."
    },
    {
      "character": "Chinami",
      "text": "Those two and Papa are the only people Chinami knows. Minus her business partner, Tsukasa, of course. But Tsukasa and Chinami are very different."
    },
    {
      "character": "Sensei",
      "text": "And you and I aren’t?"
    },
    {
      "character": "Chinami",
      "text": "Chinami doesn’t think so! Chinami thinks Papa is kind beneath his grumpy outside. And he loves big sis Chika just like Chinami does, so they have that in common."
    },
    {
      "character": "Sensei",
      "text": "I think I {i}love{/i} her a little differently than you do."
    },
    {
      "character": "Chinami",
      "text": "Like you’re going to make babies with her? Because Chinami doesn’t know how to do that and will understand if that’s what makes you different."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "Or did you mean something else?"
    },
    {
      "character": "Sensei",
      "text": "You were close enough. But I’ve also been rethinking just what “love” is lately, so who can say I have any idea what I’m even talking about at this point?"
    },
    {
      "character": "Chinami",
      "text": "Does Papa love Chinami?"
    },
    {
      "character": "Sensei",
      "text": "No."
    },
    {
      "character": "Chinami",
      "text": "So quick! Chinami is hurt!"
    },
    {
      "character": "Sensei",
      "text": "Like I said, the way I love things is different from how you love things. And it’s even worse because the things I love are always {i}wrong{/i} for me to love in the first place."
    },
    {
      "character": "Chinami",
      "text": "Is it wrong for you to love big sis Chika?"
    },
    {
      "character": "Sensei",
      "text": "It’s extremely wrong."
    },
    {
      "character": "Chinami",
      "text": "Why?"
    },
    {
      "character": "Sensei",
      "text": "Because I’m thirty-one. And she’s..."
    },
    {
      "character": "Chinami",
      "text": "And that makes it bad?"
    },
    {
      "character": "Sensei",
      "text": "Yeah. The only type of love I know how to have isn’t meant for girls her age. I should love people closer to mine."
    },
    {
      "character": "Chinami",
      "text": "Chinami thinks she understands. She watched a K-drama where a teacher kissed a student and everybody got mad. Is it like that?"
    },
    {
      "character": "Sensei",
      "text": "Yeah...It’s like that."
    },
    {
      "character": "Sensei",
      "text": "But it’s not bad because it makes other people mad. It’s bad because I should know better by now."
    },
    {
      "character": "Chinami",
      "text": "Why don’t you?"
    },
    {
      "character": "Sensei",
      "text": "Because I’m an idiot, Chinami."
    },
    {
      "character": "Chinami",
      "text": "But how did Papa become a teacher if he is an idiot? Is the educational system failing us? Is it good that Chinami is homeschooled?"
    },
    {
      "character": "Sensei",
      "text": "Yeah. You’re a lot safer here. Even if it {i}can{/i} get pretty boring at times."
    },
    {
      "character": "Chinami",
      "text": "That’s good. Because Chinami wants to be able to have good conversations with Papa, and she can’t do that if she isn’t smart. "
    },
    {
      "character": "Chinami",
      "text": "But maybe she can after all if Papa is dumb too. Chinami doesn’t know what to think right now. Her brain is moving in two different directions."
    },
    {
      "character": "Sensei",
      "text": "Well, hey. We’ve got that in common too."
    },
    {
      "character": "Chinami",
      "text": "Like Chinami said! We have lots in common! Papa probably just doesn’t want to think so because he isn’t good at letting himself be happy."
    },
    {
      "character": "Sensei",
      "text": "And how do {i}you{/i} know that? We barely even talk."
    },
    {
      "character": "Chinami",
      "text": "Chinami overheard it!"
    },
    {
      "character": "Chinami",
      "text": "Chinami’s heard lots of stuff about Papa over the last two months. Big sis Chika’s been going kinda crazy and it’s making her say some weird stuff sometimes."
    },
    {
      "character": "Sensei",
      "text": "What kind of weird stuff?"
    },
    {
      "character": "Chinami",
      "text": "Some stuff that makes her sound really smart. And then other stuff that makes her sound really insecure."
    },
    {
      "character": "Chinami",
      "text": "Big sis Chika’s always been super strong and super confident. But when Papa wasn’t around, Chinami heard her blaming herself for it sometimes. And it was super-duper weird."
    },
    {
      "character": "Sensei",
      "text": "It wasn’t Chika’s fault at all..."
    },
    {
      "character": "Chinami",
      "text": "Chinami knows that! Big sis Chika is too good at things to mess any of them up. So Chinami assumed Papa had other problems that nobody knew about. But that confused her too because her brain is small."
    },
    {
      "character": "Chinami",
      "text": "Big sis Yumi said you hate yourself, but Chinami doesn’t understand why. Is it because you love the wrong things? Like you said earlier?"
    },
    {
      "character": "Sensei",
      "text": "That’s definitely a part of it..."
    },
    {
      "character": "Chinami",
      "text": "Will the other parts be easier for Chinami to understand?"
    },
    {
      "character": "Sensei",
      "text": "Maybe in a few years, when your brain is bigger."
    },
    {
      "character": "Chinami",
      "text": "Chinami hopes so. She wants all the people she loves to be happy together, even if they all love each other differently."
    },
    {
      "character": "Chinami",
      "text": "And she was starting to worry that maybe you wouldn’t come see her anymore."
    },
    {
      "character": "Sensei",
      "text": "It’s possible that’s true, Chinami. I need some time to myself to...think about things."
    },
    {
      "character": "Chinami",
      "text": "So..."
    },
    {
      "character": "Chinami",
      "text": "This might be the last time Chinami sees you?"
    },
    {
      "character": "Sensei",
      "text": "Maybe. Maybe not. There’s no way of knowing for sure."
    },
    {
      "character": "Chinami",
      "text": "Huh..."
    },
    {
      "character": "Chinami",
      "text": "Chinami doesn’t like that."
    },
    {
      "character": "Sensei",
      "text": "I didn’t expect Chinami to like that."
    },
    {
      "character": "narrator",
      "text": "A moment of silence washes over us as Chinami attempts to understand what exactly I mean by this. And that moment is reinforced by {i}me{/i} wondering the same exact thing."
    },
    {
      "character": "narrator",
      "text": "Just {i}I’m{/i} doing it earnestly. And Chinami is-"
    },
    {
      "character": "Chinami",
      "text": "I think that’s a bad idea, Papa."
    },
    {
      "character": "narrator",
      "text": "Chinami is hard to understand sometimes."
    },
    {
      "character": "Chinami",
      "text": "If you stop coming here, big sis Chika might go crazy. And listening to her say sad and hurtful things about herself is very hard."
    },
    {
      "character": "Sensei",
      "text": "Yeah, well, there’s someone else I love going crazy at this very moment. But all of the things she says are hurtful toward other people."
    },
    {
      "character": "Chinami",
      "text": "Is she a bully like big sis Yumi?"
    },
    {
      "character": "Sensei",
      "text": "No. "
    },
    {
      "character": "Sensei",
      "text": "She’s just confused and scared."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Your sister doesn’t need me the way she does. Like you said, Chika is really strong and really confident. And she’s done a great job when it comes to raising you. "
    },
    {
      "character": "Sensei",
      "text": "There’s nothing {i}I{/i} can do for her that she can’t do for herself."
    },
    {
      "character": "Chinami",
      "text": "So it’s okay to hurt her? "
    },
    {
      "character": "Sensei",
      "text": "It’s not {i}okay.{/i} That’s just kind of...how things happen when it comes to relationships sometimes. "
    },
    {
      "character": "Chinami",
      "text": "Should I stop calling you Papa?"
    },
    {
      "character": "Sensei",
      "text": "You never should have started in the first place..."
    },
    {
      "character": "Chinami",
      "text": "She won’t give up on you, you know."
    },
    {
      "character": "Chinami",
      "text": "If you just stop coming here, she’ll follow you. Forever. That’s the type of person big sis Chika is."
    },
    {
      "character": "Chinami",
      "text": "She’s loyal. And she cares about you as much as she cares about me. If you leave things open-ended, her feelings won’t just fade away. They’ll get bigger and scarier and more desperate."
    },
    {
      "character": "Chinami",
      "text": "If you don’t want to love her forever, that’s something you’ll have to tell her. If you don’t, it won’t ever actually end. And you’ll be running away for the rest of your life."
    },
    {
      "character": "Sensei",
      "text": "Now, I’m not saying that’s what I’m {i}going{/i} to do...but a thing you should know about me if you want to have “good conversations” is that I’ve already been {i}doing{/i} that for my entire life."
    },
    {
      "character": "Chinami",
      "text": "Why?"
    },
    {
      "character": "Sensei",
      "text": "Obviously because I don’t want what’s behind me to catch up."
    },
    {
      "character": "Chinami",
      "text": "What’s behind you?"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "A ghost."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "Another moment of silence creeps in. But this time, I know exactly what Chinami is thinking. I’ve known since the moment she let go of that childish persona again."
    },
    {
      "character": "narrator",
      "text": "She’s concerned."
    },
    {
      "character": "narrator",
      "text": "She sees the somewhat happy life she’s wound up with slipping away, and she’s worried that the future she’s spent so much time alone {i}imagining{/i} is going to be harmful after all."
    },
    {
      "character": "narrator",
      "text": "But more than that-"
    },
    {
      "character": "Chinami",
      "text": "Come here, Papa."
    },
    {
      "character": "narrator",
      "text": "More than that, she’s worried about who will love her sister when she’s not there to do it anymore."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "Hi, Mama. Say hi to Papa. "
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "Mama says hi. "
    },
    {
      "character": "Sensei",
      "text": "Do I have to say hello back?"
    },
    {
      "character": "Chinami",
      "text": "That would be the polite thing to do, yes."
    },
    {
      "character": "Sensei",
      "text": "Then...hello."
    },
    {
      "character": "Chinami",
      "text": "She can’t hear you. She’s just a picture."
    },
    {
      "character": "Sensei",
      "text": "Yeah. I’m aware, Chinami."
    },
    {
      "character": "Chinami",
      "text": "And one day, Chinami will be “just a picture” too."
    },
    {
      "character": "Sensei",
      "text": "Picking the third-person act back up now that your mom is watching?"
    },
    {
      "character": "Chinami",
      "text": "Chinami has no idea what you’re talking about! Her brain is small, remember?"
    },
    {
      "character": "Sensei",
      "text": "Yeah, sure it is..."
    },
    {
      "character": "Chinami",
      "text": "Chinami loves her new house. But her most favorite part of all is that they have a real altar now. And that Chinami can finally pay her proper respects to Mommy for giving Chinami a life."
    },
    {
      "character": "Chinami",
      "text": "She doesn’t want Mommy to blame herself for Chinami’s body not being perfect. Especially since Mommy’s body was never perfect either. "
    },
    {
      "character": "Chinami",
      "text": "She knows that sometimes, people just have bad luck. And that our luck was some of the worst ever. "
    },
    {
      "character": "Chinami",
      "text": "But that just makes big sis Chika seem even more lucky since {i}her{/i} body is super healthy and super pretty!"
    },
    {
      "character": "Chinami",
      "text": "Which is why it’s super important that she lives a happy, fulfilling life since neither Mommy nor Chinami will!"
    },
    {
      "character": "Sensei",
      "text": "Chinami, you don’t know-"
    },
    {
      "character": "Chinami",
      "text": "I do, though. "
    },
    {
      "character": "Chinami",
      "text": "I don’t want to hide behind a mask forever. I want to be a normal girl...and do normal things. "
    },
    {
      "character": "Chinami",
      "text": "I want to know what you mean when you talk about different kinds of love. I want to make friends and go to the park and..."
    },
    {
      "character": "Chinami",
      "text": "And pierce my ears and...try out new parfaits at fancy cafes! I want to join a club and...and I want to eat peanuts!"
    },
    {
      "character": "Sensei",
      "text": "That last one is just asking to die, Chinami."
    },
    {
      "character": "Chinami",
      "text": "They’re {i}all{/i} asking to die because doing {i}anything{/i} with this body is putting it in danger. But sitting inside and watching Spongebob Squarepants for eight hours a day isn’t {i}living.{/i}"
    },
    {
      "character": "Chinami",
      "text": "None of this is {i}living.{/i} But I put up with it because I want my sister to be happy. I want her to have something she looks forward to when she comes home from work."
    },
    {
      "character": "Chinami",
      "text": "But there will be a time, whether we like it or not, when she comes home and I {i}won’t{/i} be here. And when that happens, I..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "I was hoping you would take my place."
    },
    {
      "character": "Chinami",
      "text": "Because I know you love her. I can feel it when you’re together. I can see the way you look at one another and...it’s even better than what I see in movies."
    },
    {
      "character": "Chinami",
      "text": "You might not be perfect...and you might hate yourself like big sis Yumi says...but I think you can learn to live with that if you keep at it long enough, Papa."
    },
    {
      "character": "Chinami",
      "text": "Chinami doesn’t know the ghost you’ve been running from your whole life, but she knows that big sis Chika wasn’t there to run with you until a little while ago."
    },
    {
      "character": "Chinami",
      "text": "And no ghost is gonna mess with big sis Chika. She’s too strong."
    },
    {
      "character": "Chinami",
      "text": "She’s too {i}lucky.{/i}"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "Aaah! Crying always hurts Chinami’s head! Look what you made her do, Papa!"
    },
    {
      "character": "Sensei",
      "text": "I know. But I’ve never claimed to be good at babysitting."
    },
    {
      "character": "Chinami",
      "text": "How about tutoring, then?"
    },
    {
      "character": "Sensei",
      "text": "Uh..."
    },
    {
      "character": "Chinami",
      "text": "Papa is a teacher, right? Maybe he can make Chinami feel better by teaching her things while her big sister is at work?"
    },
    {
      "character": "Sensei",
      "text": "I..."
    },
    {
      "character": "Sensei",
      "text": "I don’t think that’s a good idea."
    },
    {
      "character": "Chinami",
      "text": "It’s not?"
    },
    {
      "character": "Sensei",
      "text": "Yeah, I don’t think that’s...a thing I should be doing here."
    },
    {
      "character": "Chinami",
      "text": "Rats."
    },
    {
      "character": "Chinami",
      "text": "We’ve got a big problem on our hands then, Papa."
    },
    {
      "character": "Sensei",
      "text": "What do you mean we’ve got a big problem on our hands? What kind of problem do we have? I never agreed to tutor anyone. I don’t do that anymore. I don’t-"
    },
    {
      "character": "Chinami",
      "text": "But Chinami already told her business partner that you said yes."
    },
    {
      "character": "Sensei",
      "text": "You did {i}what?{/i}"
    },
    {
      "character": "Chinami",
      "text": "That must be her now!"
    },
    {
      "character": "Sensei",
      "text": "Chinami-"
    },
    {
      "character": "Chinami",
      "text": "Quick, Papa! To the door!"
    }
  ],
  "state_changes": {
    "chinamispring1": {
      "from": null,
      "to": true
    }
  }
}