{
  "event_id": 339,
  "event_label": "chinamispring2",
  "dialogue": [
    {
      "character": "narrator",
      "text": "To the door."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "I should not have come here."
    },
    {
      "character": "narrator",
      "text": "I have found myself wedged between the past and the present in a space that can only be known as “doorway.”"
    },
    {
      "character": "narrator",
      "text": "I resist the temptation to put my shoes back on and march around in circles in hope of burning a hole through the floor, falling several stories, and then being impaled by my hip bones."
    },
    {
      "character": "narrator",
      "text": "I reach out my hand, which still unfortunately works, and make contact with a cold, metal handle."
    },
    {
      "character": "narrator",
      "text": "I keep it there for a moment, causing the small girl behind me to scratch her head in confusion."
    },
    {
      "character": "narrator",
      "text": "Then I open it because I always do the wrong thing."
    },
    {
      "character": "Tsukasa",
      "text": "Oh, Jeeves. You’re here already. Good. I was worried that Chinami was only lying to me about your presence as a means of luring me into her home so she could murder me and steal my assets."
    },
    {
      "character": "Chinami",
      "text": "Chinami would never do that! She values her business partner’s assets just as much as she values her own!"
    },
    {
      "character": "Tsukasa",
      "text": "Which goes to show that you are {i}clearly{/i} inferior to the great Tsukasa as you believe {i}your{/i} things are worth even a fraction of what {i}my{/i} things are worth!"
    },
    {
      "character": "Tsukasa",
      "text": "Let this be a lesson to you, Chinami. {i}Always{/i} assume the person you are meeting will be planning to kill you. That way, you’ll never be caught off guard!"
    },
    {
      "character": "Chinami",
      "text": "Being rich sounds scary. Chinami would like to sell her shares and move on to other ventures now."
    },
    {
      "character": "Tsukasa",
      "text": "Then Chinami will have to find a buyer."
    },
    {
      "character": "Chinami",
      "text": "Papa! Would you like to buy Chinami’s minority stake in-"
    },
    {
      "character": "Sensei",
      "text": "No."
    },
    {
      "character": "Chinami",
      "text": "Rats!"
    },
    {
      "character": "Tsukasa",
      "text": "So! What will we be learning today, Jeeves? What is my first task as your newest pupil?"
    },
    {
      "character": "Tsukasa",
      "text": "If I’m allowed to make a suggestion, I’d like to start off on topics more advanced than what you’re currently teaching my sister. But I will settle for advanced calculus if that is not possible."
    },
    {
      "character": "Sensei",
      "text": "Yeah, I’m not doing this."
    },
    {
      "character": "Tsukasa",
      "text": "What do you mean you’re not doing this?"
    },
    {
      "character": "Sensei",
      "text": "I mean I never agreed to tutor either one of you. Chinami just decided I was going to."
    },
    {
      "character": "Tsukasa",
      "text": "But didn’t you have a meeting with my mother in which she explained to you that you would have to serve as my tutor going forward?"
    },
    {
      "character": "Sensei",
      "text": "My memory’s never been great, but I recall that meeting going a little differently. "
    },
    {
      "character": "Tsukasa",
      "text": "Jeeves, are you trying to tell me I came all the way over here for nothing?"
    },
    {
      "character": "Sensei",
      "text": "Yes. But I’m sure you’ll be able to get a ride back to your manor within five seconds so long as you have your phone on you."
    },
    {
      "character": "Tsukasa",
      "text": "I didn’t come from the manor. I came from next door."
    },
    {
      "character": "Sensei & Chinami",
      "text": "What?"
    },
    {
      "character": "Tsukasa",
      "text": "Didn’t I tell you? I’m renting the room beside yours from my sister so I can begin to build credit history early."
    },
    {
      "character": "Tsukasa",
      "text": "What I really wanted was to rent the whole building. But unfortunately, Onee-sama has put several silly {i}rules{/i} in place that prevent me from leasing more than one room."
    },
    {
      "character": "Chinami",
      "text": "So Chinami has a friend who lives right next door?!"
    },
    {
      "character": "Tsukasa",
      "text": "Yes. But don’t expect me to spend too much time here as this place {i}is{/i} rather dreary and far below my standards."
    },
    {
      "character": "Sensei",
      "text": "Well, at least that means you won’t have a long way to go to make it home. Bye, Tsukasa."
    },
    {
      "character": "Tsukasa",
      "text": "Chinami! What do you think we’ll be learning about today?! Molecular biology?! The fall of the Roman Empire?!"
    },
    {
      "character": "Chinami",
      "text": "Chinami needs to practice food kanji so she hopes it’s that!"
    },
    {
      "character": "Sensei",
      "text": "You two aren’t listening to me at all, are you?"
    },
    {
      "character": "Tsukasa",
      "text": "Ancient wizards listen to no one, Jeeves. So it appears that you’re stuck doing as we tell you until my lessons are over."
    },
    {
      "character": "Chinami",
      "text": "Tsukasa is right, Papa. But don’t worry! If you’re uncomfortable teaching outside of the classroom, Chinami will do her best to simulate such an environment by using her very own notebook!"
    },
    {
      "character": "Sensei",
      "text": "It takes more than a notebook to make a classroom, Chinami."
    },
    {
      "character": "Tsukasa",
      "text": "Ooh! An ancient proverb! Are {i}those{/i} what we’ll be learning today?!"
    },
    {
      "character": "Sensei",
      "text": "What? No. That wasn’t a proverb, it was-"
    },
    {
      "character": "Chinami",
      "text": "Education! Wahoo!"
    },
    {
      "character": "Sensei",
      "text": "You two...I’m not a tutor anymore. I’m not even a {i}teacher{/i} anymore. I quit."
    },
    {
      "character": "Tsukasa",
      "text": "Quit?! Onee-sama said nothing about you quitting! But she {i}has{/i} been very rude as of late, so it would not come as a surprise to me if this was true."
    },
    {
      "character": "Chinami",
      "text": "Big sis Chika said Papa was just taking a break! Is his break going to last forever?! Isn’t that not a break at all?!"
    },
    {
      "character": "Sensei",
      "text": "Okay, so...maybe I didn’t {i}quit{/i} per se. But that still doesn’t mean I want to go back to my roots as a tutor. Especially when..."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "Tsukasa",
      "text": "..."
    },
    {
      "character": "Tsukasa",
      "text": "When what?"
    },
    {
      "character": "Sensei",
      "text": "Honestly, I don’t really know."
    },
    {
      "character": "Chinami",
      "text": "That isn’t good reasoning, Papa."
    },
    {
      "character": "Sensei",
      "text": "I just don’t want to...retrace any of the steps from my past right now."
    },
    {
      "character": "Chinami",
      "text": "Because of the ghost?"
    },
    {
      "character": "Tsukasa",
      "text": "Ghost? What ghost?"
    },
    {
      "character": "Chinami",
      "text": "Papa is haunted by the ghost of his past. It forces him to make bad decisions and not love Chinami as much as he’s supposed to."
    },
    {
      "character": "Tsukasa",
      "text": "Onee-sama...mentioned nothing about ghosts in this building."
    },
    {
      "character": "Chinami",
      "text": "Cause it’s Papa’s ghost. He’s the one who brought it here."
    },
    {
      "character": "Tsukasa",
      "text": "Jeeves! I command you to get rid of your ghost right now! I will not have my education stalled by paranormal entities!"
    },
    {
      "character": "Sensei",
      "text": "You’re really going to make me regret telling you about that ghost thing. Aren’t you, Chinami?"
    },
    {
      "character": "Chinami",
      "text": "If there is anything that Chinami has learned from watching every season of Game of Thrones, it’s that ending a popular book adaptation is hard without understanding the author’s true intent!"
    },
    {
      "character": "Chinami",
      "text": "But if there is anything else she learned, it’s that sometimes you have to leverage information people share with you in confidence to get them to do things you want them to do!"
    },
    {
      "character": "Tsukasa",
      "text": "Chinami is right! And this finger is me leveraging my power and influence to get you to leave the past behind and focus on the future! A future where you teach me things!"
    },
    {
      "character": "Sensei",
      "text": "No."
    },
    {
      "character": "Tsukasa",
      "text": "Maybe if we just go sit down, he’ll follow us?"
    },
    {
      "character": "Chinami",
      "text": "Chinami thinks that’s a good idea. Papa gives into pressure easily."
    },
    {
      "character": "Sensei",
      "text": "I don’t-"
    },
    {
      "character": "Tsukasa",
      "text": "{i}Hey, does your TV ever get switched to really weird channels too? Or is that just mine?{/i}"
    },
    {
      "character": "Chinami",
      "text": "{i}Chinami woke up late last night and a bunch of girls were taking their shirts off. Is that what you’re talking about?{/i}"
    },
    {
      "character": "Tsukasa",
      "text": "{i}What? No. Are they actually allowed to put that on TV?{/i}"
    },
    {
      "character": "Chinami",
      "text": "{i}Chinami doesn’t know. She just works here.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Hah..."
    },
    {
      "character": "narrator",
      "text": "I’ll be fine."
    },
    {
      "character": "narrator",
      "text": "This is just another day."
    },
    {
      "character": "narrator",
      "text": "What’s the worst that could possibly happen?"
    },
    {
      "character": "narrator",
      "text": "{i}Answer: The worst that could possibly happen is you “falling” for one of them long before they’re meant to be fallen for, and leveraging YOUR power to make them do what YOU want them to do!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}And it’ll be fine since THAT is what THEY are doing to you now! And THEY might want IT anyway!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}There’s no way of knowing unless you try, Sensei! And you joined them on the blanket, so you CLEARLY want to, RIGHT?{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Do it!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Collect more skin!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Be the PERVERT we all know you to be!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}If she will not come back, simply MAKE A NEW HER.{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}CHOOSE.{/i}"
    },
    {
      "character": "Sensei",
      "text": "Chinami."
    },
    {
      "character": "Chiaki",
      "text": "Yes, Papa?"
    },
    {
      "character": "Sensei",
      "text": "What do you know about The Catcher in the Rye?"
    },
    {
      "character": "Chika",
      "text": "Chinami is sorry, but she doesn’t know much about baseball."
    },
    {
      "character": "Tsukasa",
      "text": "He’s not talking about baseball, Chinami. He’s talking about a book some old, white guy wrote in the 1940’s."
    },
    {
      "character": "Tsukasa",
      "text": "They make teens in American schools read it because it’s supposed to teach them about growing up and losing their innocence and stuff. But I’ve never read it because Mother says it’s very boring."
    },
    {
      "character": "Sensei",
      "text": "Right. Well, you see..."
    },
    {
      "character": "Sensei",
      "text": "The reason most people call it boring is actually-"
    },
    {
      "character": "Maya",
      "text": "I’m telling you! For the millionth time, there’s no way this “book” is preparing {i}anyone{/i} for {i}anything!{/i} It’s like 300 pages of some idiot kid whining about life."
    },
    {
      "character": "Noriko",
      "text": "Oh man, here we go again."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "Maya, all I said was that you’re being a little harsh on Holden when he’s very clearly suffering from depression. It’s not like I said it was a great, interesting book that everybody should read."
    },
    {
      "character": "Maya",
      "text": "So what? There are millions of people suffering from depression out there. And it’s not like all of {i}them{/i} go around calling every single person they encounter fake. He’s infuriating."
    },
    {
      "character": "Sensei",
      "text": "Those are both good points, so stop arguing with each other."
    },
    {
      "character": "Noriko",
      "text": "I would love to, but I’m not allowed to say literally anything without Maya jumping down my throat for it."
    },
    {
      "character": "Sensei",
      "text": "You {i}have{/i} been...unnecessarily rough on her today, Maya. Would it kill you to tone it down a bit?"
    },
    {
      "character": "Maya",
      "text": "{i}Kill{/i} me? Probably not. But I think you’re underestimating how hard it is for me to sit here and listen to someone vouch for the most incorrigible character in all of fiction."
    },
    {
      "character": "Sensei",
      "text": "She’s not trying to vouch for him, though. All Noriko’s doing is trying to explain and understand {i}why{/i} he does the things he does."
    },
    {
      "character": "Maya",
      "text": "Yeah. And {i}I’m{/i} trying to say that it’s bullshit. You’ve got depression too, don’t you? And you’re way more bearable than Holden fucking Caulfield is. So why is {i}that{/i} what we keep coming back to?"
    },
    {
      "character": "Maya",
      "text": "I got absolutely {i}nothing{/i} from this book. So hearing all this stuff about its potential themes and purposes all just sounds like hogwash to me. It was a waste of time. Nothing deeper."
    },
    {
      "character": "Noriko",
      "text": "I mean, I wasn’t a fan either. But we need to analyze it through the lens of the average reader if we’re going to understand its impact on the industry and why it’s still relevant today."
    },
    {
      "character": "Sensei",
      "text": "Noriko’s right. You two are different from everyone else."
    },
    {
      "character": "Sensei",
      "text": "There’s a reason I’m giving you harder reading material, after all. It’s because I {i}want{/i} to hear these types of outlooks. And I want {i}you two{/i} to be able to contrast them with the “popular” opinion."
    },
    {
      "character": "Sensei",
      "text": "It’s important to understand and analyze why you’re different, because there are going to be times in life where you {i}can’t{/i} be. And you’ll need to figure out how to blend in whether you like it or not."
    },
    {
      "character": "Maya",
      "text": "Do you always have to side with her, though? It’s frustrating."
    },
    {
      "character": "Noriko",
      "text": "Oh, stop. Sensei doesn’t {i}always{/i} side with me."
    },
    {
      "character": "Noriko",
      "text": "I’ve just known him longer, so I know what he wants to hear!"
    },
    {
      "character": "Maya",
      "text": "Suck-up."
    },
    {
      "character": "Sensei",
      "text": "Maya."
    },
    {
      "character": "Maya",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Look at me."
    },
    {
      "character": "Maya",
      "text": "What do you want?..."
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "Noriko",
      "text": "..."
    },
    {
      "character": "Sensei",
      "text": "Noriko, could you leave the room for a minute?"
    },
    {
      "character": "Noriko",
      "text": "Can I count the seconds? Because last time you said a minute-"
    },
    {
      "character": "Sensei",
      "text": "I’ll call you back in when I’m done talking to Maya, okay?"
    },
    {
      "character": "Tsukasa",
      "text": "Okay!"
    },
    {
      "character": "Tsukasa",
      "text": "I get it now! This is a secret method of tutoring that Jeeves must have learned from...China! No! South Korea! The silent method!"
    },
    {
      "character": "Chinami",
      "text": "Chinami doesn’t like the silent method. She learns better when there are words involved."
    },
    {
      "character": "Tsukasa",
      "text": "Tsk, tsk, tsk. If you’re ever going to be a CEO, you’re going to need to master the silent method, Chinami. That way, when someone asks you for a raise, you can just stare at them until they go away."
    },
    {
      "character": "Tsukasa",
      "text": "I’ve watched Mother do it thousands of times. It helps if you have a good smile. Here! Let’s practice!"
    },
    {
      "character": "Sensei",
      "text": "..."
    },
    {
      "character": "narrator",
      "text": "She wasn’t blurred this time."
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    },
    {
      "character": "narrator",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "Papa! Look at our smiles! Are we doing it right?!"
    },
    {
      "character": "Tsukasa",
      "text": "Do you think we’ll be able to effectively fend off lesser employees with them?!"
    },
    {
      "character": "Sensei",
      "text": "How long have we been sitting here?"
    },
    {
      "character": "Tsukasa",
      "text": "Maybe like...twenty minutes or something?"
    },
    {
      "character": "Chinami",
      "text": "Chinami’s not convinced Papa was using the silent method like her business partner says. She thinks Papa might have just fallen asleep."
    },
    {
      "character": "Sensei",
      "text": "Yeah...that’s a little closer to the truth."
    },
    {
      "character": "Tsukasa",
      "text": "So...does this mean we’re actually starting now? The first part was just a...warm-up?"
    },
    {
      "character": "Sensei",
      "text": "We’re not starting {i}ever.{/i} I can’t do this."
    },
    {
      "character": "Tsukasa",
      "text": "But you do it for Onee-sama all the time. I watched you. On National Tsukasa Day."
    },
    {
      "character": "Chinami",
      "text": "Is it because we’re too young?"
    },
    {
      "character": "Tsukasa",
      "text": "I doubt that’s the problem at all, Chinami."
    },
    {
      "character": "Tsukasa",
      "text": "{b}IF ANYTHING, I THINK THAT WOULD MAKE JEEVES WANT TO TEACH US EVEN MORE{/b}"
    },
    {
      "character": "Chinami",
      "text": "{b}ARE YOU SAYING THAT HE LIKES LITTLE GIRLSSSSSSSSSSSS??????????{/b}"
    },
    {
      "character": "Tsukasa",
      "text": "{b}THAT’S RIGHT, CHINAMI. HE IS LIKELY STRUGGLING RIGHT NOW BECAUSE HE HAS WHAT IS CALLED AN “ERECTION” lol{/b}"
    },
    {
      "character": "Chinami",
      "text": "{b}CHINAMI HAS HEARD ABOUT THOSE! BIG SIS CHIKA GETS ERECTIONS INSIDE HER ALL THE TIME. SHE SAYS THEY MAKE HER insides FEEL GOOOOOOD.{/b}"
    },
    {
      "character": "Tsukasa",
      "text": "{b}WHENEVER i WANT MY INSIDES TO FEEL GOOD, I SWALLOW THE INK FROM FOUNTAIN PENS!{/b}"
    },
    {
      "character": "Chinami",
      "text": "{b}FOUNTAIN PENSSSSSSSSSSSSSSSS?{/b}"
    },
    {
      "character": "Tsukasa",
      "text": "{b}AM I DOING IT WRONG, JEEEEEEEEVES?{/b}"
    },
    {
      "character": "Chinami",
      "text": "{b}PAPO! PUT THE ERECTION INSIDE OF TSUKASA TO GET RID OF THE INK!{/b}"
    },
    {
      "character": "Tsukasa",
      "text": "{b}FIX MY TINY BODY WITH YOUR PENIS, HEEVES!{/b}"
    },
    {
      "character": "Tsukasa",
      "text": "Really? So he lives in a pineapple?"
    },
    {
      "character": "Chinami",
      "text": "Under the sea, yeah."
    },
    {
      "character": "Sensei",
      "text": "Uh..."
    },
    {
      "character": "Tsukasa",
      "text": "Oh, he’s back again."
    },
    {
      "character": "Chinami",
      "text": "Papa...Chinami’s starting to worry with how your eyes keep going away. So she thinks you should take a nap in big sis Yumi’s futon since she’s not coming home tonight."
    },
    {
      "character": "Tsukasa",
      "text": "Nonsense, Chinami. Business has only just begun, and Jeeves has yet to teach us anything at all apart from that weird story about those two angels who talk in crossed out letters."
    },
    {
      "character": "Chinami",
      "text": "{s}sssssssssssssssssssssssssssssssssss{/s}"
    },
    {
      "character": "Tsukasa",
      "text": "{s}kkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkkk{/s}"
    },
    {
      "character": "Sensei",
      "text": "I..."
    },
    {
      "character": "Sensei",
      "text": "Uhh..."
    },
    {
      "character": "Noriko",
      "text": "So, now that you’re gone, how long do you think it’ll take before Sensei fucks me?"
    },
    {
      "character": "Maya",
      "text": "Probably not {i}that{/i} long. You’ve had your lust stat turned on since you were added to the game so, in a sense, you’ve kind of always {i}almost{/i} been there."
    },
    {
      "character": "Noriko",
      "text": "God, I hope so. But between his grief and the fact that Ami might actually kill me if it happens, I’m just not sure if it’s even the right call anymore."
    },
    {
      "character": "Maya",
      "text": "Let’s just ask him. When are you going to fuck Noriko? And, if the answer is “no,” is it because I was so good that it ruined sex forever?"
    },
    {
      "character": "Noriko",
      "text": "You should just do it right now if you’re going to. I promise that I’m not someone else and that you’re just hallucinating right now."
    },
    {
      "character": "Maya",
      "text": "Same here, so do me instead. I promise I won’t tell anyone."
    },
    {
      "character": "Tsukasa",
      "text": "Not so fast, younger version of Maya!"
    },
    {
      "character": "Maya",
      "text": "Crap."
    },
    {
      "character": "Tsukasa",
      "text": "It is I, Tsukasa Tsukioka, here to verify that I am {i}indeed{/i} still here and that I will {i}not{/i} be having sexual intercourse with you at this point in time!"
    },
    {
      "character": "Tsukasa",
      "text": "But that I will likely do that if you keep showing me affection because no one else will and it makes me very sad."
    },
    {
      "character": "Chinami",
      "text": "Arf arf! Let’s do dog sex!"
    },
    {
      "character": "Tsukasa",
      "text": "..."
    },
    {
      "character": "Chinami",
      "text": "..."
    },
    {
      "character": "Tsukasa",
      "text": "Jeeves, I think you should probably go home."
    },
    {
      "character": "Sensei",
      "text": "I should never have come in the first place."
    },
    {
      "character": "narrator",
      "text": "{i}Chinami’s affection has increased by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}Tsukasa’s affection has increased by 10!{/i}"
    },
    {
      "character": "narrator",
      "text": "{i}iT IS never TOo lATE TO TUrn OFf thE GAMe{/i}"
    },
    {
      "character": "narrator",
      "text": "........."
    },
    {
      "character": "narrator",
      "text": "......"
    }
  ],
  "state_changes": {
    "tsukasa_love +": {
      "from": null,
      "to": 10
    },
    "chinamichosen": {
      "from": null,
      "to": true
    },
    "chinamispring2": {
      "from": null,
      "to": true
    },
    "chinami_love +": {
      "from": 1,
      "to": 10
    }
  }
}